{
    "py/object": "mylib.pedal.Pedal",
    "id": "30020",
    "name": "RESPIRA",
    "image": "images/ac-noises-respira.jpg",
    "function": [
        "Reverb",
        "Tremolo"
    ],
    "manufacturer": "AC Noises",
    "current": "100 mA / 9 V / DC / Negative Center",
    "cost": "$340 Price in €",
    "width": 94,
    "height": 117,
    "details": "shimmer reverb + multimode lfo tremolo\"Respira\" is an Italian verb which means \"breathe\" in second person imperative (tu, respira = you, breathe).\nThis percussive ambient machine consists in 2 effects in 1 pedal unit, and it’s something that we dreamed about for a very long time here at AC noises due our true love for movie soundtracks, cinematic soundscapes and atmospheric music in general: a shimmer reverb in front of a multimode lfo tremolo.\nSHIMMER REVERB\nThe digital shimmer reverb has been developed by Luca Romanelli from Mastro Valvola and is the first effect in the internal signal chain of the pedal. It provides all that every musician usually expects from this type of effects: a very deep atmospheric sound with a long/infinite decay + a dreamy character provided by other octaves sounding in addition to the one currently played by the musical instrument involved.\nAs external controls, the shimmer reverb’s side of the RESPIRA offers the following ones:\nMIX: Basically a dry/wet control. The user can easily decide how much reverberated signal has to be noticed, starting from no reverb at all by setting the knob fully counterclockwise (and that’s the most obvious setting in case the user would prefer to play the tremolo side only) to a 100% wet signal by turning the knob in the opposite direction (clockwise).\nDECAY: Turning it counterclockwise, the reverb tail becomes shorter until disappearing (when the knob is fully closed). While turning it clockwise, the decay becomes longer and longer until transforming the signal in an infinite ambient soundscape.\nAbout the other two octaves provided (-1 and +1), those are both premixed from the factory in order to offer the best balance for every musical instrument plugged into the RESPIRA. Anyway, if the user wants to experiment and try different sound flavors, the two relative internal trimmers can be easily tweaked and adjusted (always by keeping in mind the obvious counterclockwise/clockwise working method).\nMULTIMODE LFO TREMOLO\nThe brain of the RESPIRA’s tremolo consists in 16 different wave shapes splitted in two sets of 8. Once selected one of these two sets by the toggle switch placed in the middle, the central 8 positions rotary switch allows to choose the exacted wave shape that the user wants to play with.\nAbout the time control possibility, the RESPIRA provides the speed rate, the multipliers subdivision and the tap tempo control. The speed rate can be adjustable by tweaking the RATE knob: turning it counterclockwise the rate will be slower, while the speed will increase by turning the knob clockwise. The TAP TEMPO switch is related to the multiplier previously selected by the 4 positions rotary switch on the left. In fact, the user can choose up to 4 different subdivisions: = x1 (1/4 note, crotchet) = x2 (1/8th, quaver) = x3 (triplet 1/8th note, triplet quaver) = x4 (1/16th note, semiquaver).\nA truly special and pretty unique feature provided by the RESPIRA is the possibility to choose up to 4 tremolo modes by rotating the 4 positions switch on the right: M, H, B, T.\nMASTER (M): The standard optical tremolo which acts on the master volume of your signal. Pulsing, deep and side chain-like. Just perfect for basically every music genere which often requires strong rhythmic events.\nHARMONIC (H): That type of tremolo which acts between bass and treble because its out of phase action. Smoother than the master mode and incredibly useful when needing a rhythmic event with a gently modulated flavor.\nBASS (B): The tremolo acts on bass frequencies only. Created for that kind of arrangements with a sequenced/pulsing bass line and free lead phrases above.\nTREBLE (T): Obviously the opposite of the bass mode. Tremolo acts on treble frequencies only, so it allows to create sequenced phrases or arpeggios above a drone-like bass line.\nThe tremolo part of the RESPIRA also presents the most obvious and absolutely necessary control of the depth (DEPTH knob). The user can turn off the tremolo and playing just with the shimmer reverb side of the RESPIRA just by rotating the DEPTH knob fully counterclockwise. When going in the opposite direction (clockwise) the tremolo’s depth will act deeper. Also, considering both the shimmer reverb in front of the tremolo and how much we love to increase the climax while playing, we decided to add an expression input to adjust the DEPTH with an expression pedal (10k value recommended) so it’s possible having fun by making the two effects dialogue constantly.\nSYMMETRY: This is a sort of secret weapon that can be crucial in terms of wave shape sculpting. In fact, with this parameter, the user can change the symmetry of the previously selected wave shape. Tweaking the SYMMETRY knob it’s possible to decide where the wave shape must intervene: attack (counterclockwise) or release (clockwise). User can obtain a perfect wave shape symmetry (50%-50%) by leaving the knob at 12 o’clock.\nTONE: Not a very common control for a tremolo, but it's a very useful one (especially for the RESPIRA). It works as a standard tone shaping tool when using the tremolo in MASTER (M) or in HARMONIC (H) mode, while it works more like a blender between frequencies when using the tremolo in BASS (B) or TREBLE (T) mode. That means that the user can decide how much noticeable must be the sound portion actually effected by the tremolo.\nVOLUME (trimmer): The user can adjust the output level by rotating the dedicated internal trimmer. Anyway, the RESPIRA’s circuit is very sensitive to the output level because the optocouplers involved, so a “clicking” noise can be noticed when using the tremolo with a strong depth setting and too much high output, and that’s why we highly suggest to leave the trimmer as it comes from the factory.\nThe RESPIRA is a true bypass pedal (switching system managed by soft switch + programmed relay).\nPower: 9v center negative. Current draw: 100 mA minimum\nhttps://www.acnoises.com/pedals/26-respira.html",
    "hrid": "ac-noises-respira"
}