{
    "py/object": "mylib.pedal.Pedal",
    "id": "22504",
    "name": "AMA",
    "image": "images/ac-noises-ama.jpg",
    "function": [
        "Digital Glitch",
        "Reverb"
    ],
    "manufacturer": "AC Noises",
    "current": "? mA / ? V / AC/DC",
    "cost": "$223 Price in €",
    "width": 66,
    "height": 121,
    "details": "Reverb w/ oscillator + bit crusherAMA means \"love\" in second person imperative (tu, ama! = you, love!).\nThis effected pedal is a spring reverb with an analog oscillation + bit crusher an it works perfectly with guitar, bass, synth and basically every kind of instrument (human voice included). If you consider yourself as a “purist”, MAYBE the AMA could offers too much atypical shades for your idea of spring reverb pedal, but if you’re always excited to create new soundscapes, atmospheres and solutions, you could definitely fall in love with this first ambient-related AC noises pedal.\nWhen the AMA is turned on (bypass: upper white led engaged) with both the bit crusher and the oscillator turned off (toggle switch: OFF position - OSC switch: upper white led not engaged), the pedal works as a spring reverb with a maximum of 2,85” decay’s length. In this case, you can control its two dedicated parameters through the related knobs MIX and REVERB.\nMIX\nThe MIX knob controls the balance between the dry and the wet signal.\nTurn it  clockwise and the reverberated portion of your original signal will increase.\nTurn it counterclockwise and and your original signal will be directed to the output in its entirety.\nREVERB\nThe REVERB knob controls the amount of reverb (and its relative decay’s length).\nMore you'll turn it clockwise, bigger will be the reverb size (and longer will be the decay).\nTurn it counterclockwise and the amount of reverb will decrease.\nEXTREME REVERB SETTINGS\nTurning fully counterclockwise both the MIX and the REVERB knobs, you’ll have no reverb at all.\nIn case you’ll set the REVERB knob up to 8 o’clock, you'll notice a reverberated portion of the signal (even if the MIX knob is set at its minimum).\nIf you turn both knobs fully clockwise you’ll hear just the reverberated portion of your original signal. In this case, you’ll notice a sort of very fast swell-reverb effect, which could be very interesting to create atypical soundscapes.\nOSC\nIf you turn the oscillator on (OSC switch: upper white led engaged), you'll add a fully analog oscillation which will be generated immediately after each note you’ll decide to play. That means that when you’ll leave the note/s, the oscillation will be noticed as a feedback mixed to the reverb decay, creating a gently modulated waveform and making a cinematic-style soundscape, especially with the reverb knob at his maximum. In fact, the amount of oscillation has been calibrated during the development process of the AMA’s circuit to make something simple to understand and to deal with for every musician out there: more you’ll turn the reverb knob clockwise, more the oscillation will be audible.\nBIT CRUSHER\nSpeaking about the AMA's internal signal chain, the bit crusher is located AFTER the reverb. Turning it on (toggle switch: ON position) it will be added to your tone and it can be controlled by its two parameters: RESOLUTION and SAMPLE RATE.\nRESOLUTION\nIt controls the amount of the oscillation pulse (we're speaking about the internal one of the bit crusher, not the switchable one). Turning it clockwise, pulses will be wider and the signal will be noticed as less crushed (and viceversa of course).\nSAMPLE RATE\nIt controls the bit crusher internal oscillation frequency.\nTurning it clockwise, the oscillation will be more focused on high frequency and the bit crushed sound in general will be noticed as brighter.\nTrue bypass by relay + soft touch switch (same for the OSC switch).\nStandard 9V DC negative power.\nCurrent draw 68mA\nhttps://www.acnoises.com/reverb/11-ama.html",
    "hrid": "ac-noises-ama"
}