{
    "py/object": "mylib.pedal.Pedal",
    "id": "30019",
    "name": "AMA V.2",
    "image": "images/ac-noises-ama-v.2.jpg",
    "function": [
        "Digital Glitch",
        "Reverb"
    ],
    "manufacturer": "AC Noises",
    "current": "100 mA / 9 V / DC / Negative Center",
    "cost": "$232 Price in €",
    "width": 66,
    "height": 121,
    "details": "reverb w/ oscillator + bit cruhserAMA is an Italian verb which means \"love\" in second person imperative (tu, ama! = you, love!).\nThe first version of this effect pedal was released in early 2018 and it quickly became the top seller of the AC noises catalogue. In fact, during the consecutive two years, the AMA has been chosen from many alternative, post-rock, shoegaze and ambient artists (including some well known ones) and it's been featured (and mentioned several times) on the gear encyclopedia \"Pedal Crush\" in late 2019.\nThis new version (simply marked as V.2) is the result of the feedbacks we received from all around the world during the past two years and it's been created to provide the most exciting experience to all the sonic adventurers out there who love a gently modulated and oscillating spring reverb in front of a bit crusher.\nThe AMA V.2 offers up to 4 different control parameters for the reverb (OSC, MIX, REVERB and RAMP) and 2 for the re-worked and now more musical bit crusher which is still placed after the reverb (RESOLUTION and SAMPLE RATE).\nNote: About the bit crusher, there is also an internal trimmer which controls the effect's gate. Anyway, we suggest to leave that as it comes from the factory.\nOSC\nOne of the new features offered by the V.2.\nIn the first version, the reverb oscillator was only switchable (ON/OFF) and it was strictly related to the decay. Now things have changed: the OSC knob allows to decide how much oscillation has to be noticed on the reverb tail, going from no oscillation at all (OSC knob fully counterclockwise) to the as wonderful as noisy self-oscillation mode (OSC knob fully clockwise).\nMIX\nThe MIX knob controls the balance between the dry and wet signal.\nTurning it clockwise, the percentage of reverberated signal will be more noticeable (and viceversa).\nREVERB\nThe REVERB knob controls the decay’s length.\nTurning it clockwise, reverb tail will become longer (and viceversa).\nRAMP\nOne of the most exciting feature of the AMA V.2.\nThe RAMP footswitch is related to reverb's oscillator and its work speed depends on the OSC knob setting: more closed will be the OSC knob, slower will be the oscillator ramp (and viceversa).\nCRUSH\nThat's the position of the toggle switch which allows to engage the bit crusher circuit placed after the reverb.\nRESOLUTION\nThe amount of the oscillation pulse. Turning it clockwise, pulses will be wider and signal will be noticed as less crushed (and viceversa).\nSAMPLE RATE\nBit crusher internal oscillation frequency.\nTurning it clockwise, the oscillation will be more focused on high frequencies and the bit crusher will be generally noticed as brighter.\nAnother new feature offered by this new version of the AMA is an expression input connected to the sample rate, which allows to bypass the knob and controlling the frequency's cut by using an external expression pedal (10k value recommended - so most of the expression pedals on the market).\nThe AMA is a true bypass pedal (switching system managed by soft switch + programmed relay).\nPower: 9v center negative.\nCurrent draw: 100 mA minimum\nhttps://www.acnoises.com/pedals/27-ama-reverb-w-oscillator-bit-crusher-v2.html",
    "hrid": "ac-noises-ama-v.2"
}