{
    "py/object": "mylib.pedal.Pedal",
    "id": "15677",
    "name": "Flanger Reissue",
    "image": "images/ada-flanger-reissue.jpg",
    "function": [
        "Flanger"
    ],
    "manufacturer": "ADA",
    "current": "? mA / ? V / AC/DC",
    "cost": "$299 Price in €",
    "width": 168,
    "height": 140,
    "details": "Features\nA/DA Flanger\nTwo years in the making ! David Tarnowski the original A/DA owner and designer has brought back his original Flanger !\nMr. Modulation is BACK !\nThe ADA Flanger is a second generation electronic flanger capable of producing a broad range of sound colorations, dramatically enhancing the effect of any amplified musical instrument, voice or percussive instrument.\nThe term “flanging” refers to the technique of manually varying the speed of two tape recorders independently with the same program material, while mixing down in recording studios. The ADA Flanger electronically simulates varying speed in real time, during the performance.\nThe capabilities of the ADA Flanger are numerous and astounding. Effects such as rotating speakers, chilling vibrato, “jet” sounds, resonance modification, intensified studio flanging and incredible filter matrices, to name a few, suggest that experimentation will certainly find the sound you have been looking for.\nWhen two identical signals separated by a short time delay are added together, reinforcements (peaks) and cancellations (notches) occur in the output level. The positions of the peaks and notches are mathematically related to the time delay as can be seen in the graph opposite. The example shows the “comb filter” that occurs at the output of the ADA Flanger at 1 msec time delay. If a 500 Hz signal is introduced into the Flanger at 1 msec delay, it will not be heard at the output. However a 1000 Hz signal will be reinforced, thus heard at the output. By changing the time delay, we move the position of the peaks and notches up or down the audio frequency spectrum creating flanging effects.\nTECHNICAL INFORMATION\nThe 2009 Reissue A/DA Flanger is designed by the original designer of the late 1970s A/DA Flangers using very similar parts. The differences between your Reissue Flanger and the original A/DA Flangers are:\n\nThe Reissue has True Bypass and the originals did not.\nThe Reissue still uses Panasonic (Matsushita) bucket brigade devices for the analog delay. They are known for their warm, rich analog sound. The original A/DA Flangers used only the Panasonic MN3010, while the reissue can also use the MN3004, MN3210 or the MN3204 to achieve the exact original A/DA sound. *2014 - almost out of these old chips, may start using new chips. We still have some in stock with the old chips, get them while you can.\nThe Reissue does NOT use bucket brigade devices made by other manufacturers which have recently become available due to their inferiority and the fact that they cannot (in single delay path configuration) achieve the ‘over-the-top sound of the infamous A/DA Flangers. A/DA will watch and test the parts made by other manufacturers as they become available in different configurations, and will only use them if they meet or exceed the original Panasonic specifications and are suitable for the designs.\nOtherwise, the signal path for the Reissue is exactly the same as the Original Flangers made in 1979.\nThe printed circuit board (PCB) has a different layout, but is all through-hole design, using full-size carbon film resistors and precision polyester film capacitors.\nThese have an 18VDC power adaptor, for use in USA, Canada, etc.\nYou can use a Pedalpower2 etc to run it, or other 18V DC adaptors.\n\nSize 6.75\" wide x 5.75\" deep x 3\" tall\nThey're BACK !\nExpression pedal info\nThe expression control jack is not normal. A/DA will be making an expression pedal. But until then you can use a Boss EV5, just reverse the red and white wires inside the EV5 pedal. This reverses the tip and ring connection which will work with any normal expression pedal.",
    "hrid": "ada-flanger-reissue"
}