{
    "py/object": "mylib.pedal.Pedal",
    "id": "15678",
    "name": "Final Phase Reissue",
    "image": "images/ada-final-phase-reissue.jpg",
    "function": [
        "Filter"
    ],
    "manufacturer": "ADA",
    "current": "? mA / ? V / AC/DC",
    "cost": "$249 Price in €",
    "width": 171,
    "height": 127,
    "details": "The A/DA Final Phase represents the latest in phase shifter technology. The FINAL PHASE is capable of producing a very broad range of sound colorations, dramatically enhancing the effect of any amplified musical instrument, voice or percussive instrument.\nComes with a power cord for USA 120V ac power.\nElectronic phasing takes place when a signal is divided, one half slightly delayed, then remixed with the original signal. This “delay” only occurs at certain frequencies and is referred to as phase shift (when the delay occurs at all frequencies, the effect is called flanging). When the phase shift of the delayed signal differs by 180 degrees relative to the original signal, a cancellation, called a notch, is generated when they are remixed. The FINAL PHASE generates 5 notches, which when moved back and forth across the sound spectrum, for example, produces the classic rotating speaker effect.\nTECHNICAL INFORMATION\nThe 2009 Reissue A/DA Final Phase is designed by the original designers of the late 1970s A/DA Final Phases using very similar parts and exactly the same parts in the all-analog signal path. The differences between your Reissue Final Phase and the original A/DA Final Phases are:\nThe Reissue has true “hardwire” bypass and the originals did not.\nThe Reissue Overdrive (distortion) has been re-voiced to get a more modern sounding distortion, while keeping the original distortion tone and feel by backing off the new Overdrive Control. In effect we have added an “11” to the Overdrive. As you approach the maximum setting, the bass resonance increases and the highs become more complex.\nThe printed circuit board (PCB) has a different layout, but is all through-hole design, using full-size carbon film resistors and precision polyester film capacitors for the highest quality signal path. There are no surface mount components in your Reissue Final Phase.\n\nA/DA FINAL PHASE OPERATING NOTES\nHOOK UP\n\nThe cord from the instrument or microphone plugs into the IN jack.\nThe cord from the amplifier plugs into the OUT jack.\nOptional AC/DC converter. The special coax plug on the AC/DC power converter plugs into the jack marked POWER. Use A/DA PS-8001 power converter only. There is no need to remove batteries when using the converter, since they are automatically bypassed.\nThe CONTROL input accepts either the A/DA CONTROL PEDAL A or a 0 volt to +5 volt control voltage. In either case the connection should be made with a 3-conductor stereo-type cable. To obtain maximum phasing range from the CONTROL input, set the RANGE CONTROL knob fully counterclockwise. This setting defeats the automatic sweep functions (SWEEP RATE and SWEEP MODULATION). However, they may be mixed with the signal applied to the CONTROL input by turning the CONTROL RANGE slightly clockwise.\n\nCONTROLS\nSWEEP RATEControls the speed at which the phase Shift. Effect moves up and down the sound spectrum.\nSWEEP MODULATION\nA Variable speed oscillator that adds to or modulates the main sweep, producing shimmering, vibrato-like effects, asymmetrical sweep patters, multiple phaser effects, modulated sweep, syncopated beats, etc.\nRANGE CONTROL\nDetermines the limits of the automatic sweep functions (SWEEP RATE and SWEEP MODULATION), with maximum range at the full clockwise setting. When using the CONTROL input (as mentioned above), the RANGE CONTROL gives maximum range to the CONTROL input when set to full counter-clockwise position.\nINTENSITY\nA regenerative feedback control that adds emphasis (peaking) to the phasing effects. Sounds ranging from hollow tubes to intensified “wahs” are obtainable.\nOVERDRIVE\nAdds a variable amount of distortion to the input signal, smooth “tube amp” harmonic distortion are easily produced.\nFOOT SWITCHES\nIN/OUT\nSwitches electronics of FINAL PHASE into or out of operation.\nOVERDRIVE\nEngages or bypasses the electronics of distortion. Responds only when electronics of phase shifter are operating.\nSize 6.75\" wide x 5.75\" deep x 3\" tall",
    "hrid": "ada-final-phase-reissue"
}