{
    "py/object": "mylib.pedal.Pedal",
    "id": "32147",
    "name": "Mother Tongue",
    "image": "images/adventure-audio-mother-tongue.jpg",
    "function": [
        "Filter",
        "Wah"
    ],
    "manufacturer": "Adventure Audio",
    "current": "? mA / 9 V / AC/DC / Negative Center",
    "cost": "$399 Price in €",
    "width": 94,
    "height": 102,
    "details": "Vocalizing Envelope Controlled Modulated Formant FilterThe Mother Tongue is a unique breed of pedal following in the great lineage of envelope controlled devices going back to the 1970’s when syncopated funk effects played a leading role in shaping the modern music landscape. Building on the automated tracking wah power it’s predecessors pioneered, the Mother Tongue adds a range of vocal-sounding modulations to the dialogue, mixing in a powerful array of controls allowing for a unique package of options for users to create some of the craziest percussive rhythms and sonic textures never before found in one singular box.\nMinimalist Design\nThe concept for and the design of the Mother Tongue was developed by working with renown industrial designer, Josh Owen. The physical attributes of the pedal chassis reflect Owen’s signature approach, organizing the controls into a concise and readable layout. The high-quality aluminum knobs were modified with custom connections to reduce visual clutter and privilege readability and ease of use. The graphic logo on the packaging and pedal underside was designed by Owen’s son Jasper.\nMaximalist Performance\nTo say that this pedal is feature-rich would be an understatement. Mother Tongue offers an easily accessible variety of modulations and wave forms using an envelope follower and/or LFO to control multiple parameters. Also included is every musicians favorite control, ‘tap tempo’.\nA Unique Collaboration\nJosh is an industrial designer who played in funk/punk/hardcore/experimental bands for much of his youth and continues to be passionate about the power of music and the tools that shape it. He considers the artifacts of the music industry the same way he considers everything else in the built environment. Like all of his other designs, he feels that if things are well designed, objects can enhance our experiences and contribute to making the world a better place. When Josh visited the studio to discuss the merits of pedals with us, we knew right away that together, we could craft something unique and meaningful as a gift to the music industry.\nFrom Rochester with Love\nDesigned and Hand-built in Rochester NY USA . We hand-build all of our gear right here in Rochester, NY USA and make things at a high quality so that they will last a very long time. Josh Owen’s design studio resides here in Rochester too and shares our philosophy of making things that are carefully considered. This project was a local affair.\nWords of Advice\n“The Mother Tongue is the mother of all musical speech stomp boxes and you can be authorized to check it the hell out. It was born from the shrieks of burning angler fish mutating to evolve in the hot- thin Tom-Kha Gai soup of sulfuric volcanic vents squirting from the bottom of the delicious Mariana Trench. Josh “Lenses” Owen wanted to make his aquatic guitar sputter like a primal human voice and Matthew “Molecular” Manes was just the mad scientist brother to facilitate the creation of the inverted Rosetta Stone of moist guitar pedals. Deep funky shlupping sounds make this fella the William S. Burroughs of oceanic hyperspace guitar pedals. A literary high for alien Mugwumps and the intrepid only. Oh and Josh’s son Jasper does a mean graphic doodle which I’ve already lovingly tattooed onto my pet poison dart toad, Joe.”\n- Christian Terjesen, Partner, Adventure Audio\nUploader's Note: Dimensions are approximated. Please edit if you happen to know the real ones.\nhttps://www.adventurepedals.com/pedals/mothertongue",
    "hrid": "adventure-audio-mother-tongue"
}