{
    "py/object": "mylib.pedal.Pedal",
    "id": "17814",
    "name": "Wavelength",
    "image": "images/alexander-wavelength.jpg",
    "function": [
        "Chorus",
        "Digital",
        "Filter",
        "Flanger",
        "Phase Shifter",
        "Tremolo"
    ],
    "manufacturer": "Alexander",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 64,
    "height": 117,
    "details": "High Bandwidth Digital ModulatorMore.  That’s the best way we can describe the sounds and features of the Wavelength.  We took everything from our Waveland Multi-Modulator and blew it up larger than life, while keeping it the exact same size. \nWe’ve added some welcome improvements like more modulation engines and tap tempo, and some cool surprises like selectable waveforms.  It’s a true all-in-wonder for your modulation needs.\nNeo Series:\nThe sonic scientists at Alexander Pedals have been working overtime to cram the most pedal into the smallest box, and we now present the Neo Series!  Each Neo Series pedal incorporates an advanced 32-bit microcontroller adding presets, expression, and MIDI capability.\nThe Neo Series pedals are small but mighty!  Imagine having a single pedal on your board that can access up to 4 separate preset tones with a touch of your toe.  Connect an expression pedal to \"morph\" between two distinct settings for each preset for dynamic real-time effects.  Or hook up a simple footswitch to trigger a timed \"ramp\" between those expression settings.  Expressive performance technology, right at your feet.\nPresets:\nAll Neo Series pedals feature a simple yet powerful preset functionality.  Hold the bypass footswitch to move the pedal to the next available preset, and the pedal will reconfigure itself on the fly.  All knob values and the effect mode settings are recalled, allowing you to set up to four unique tones.  Want more presets?  Simply connect a MIDI controller to the EXP port on the side of the Neo Series pedal and access up to 16 presets total.\nTo load a preset, hold the bypass footswitch down or send a MIDI program change from 0-15.\nTo save a preset, hold the Select button down and then hold the bypass footswitch.  The pedal will save the current settings to the current preset.\nAny changes you make to the pedal settings will be lost when switching to a new preset unless you save the current preset first, so be careful!\nExpression and MIDI:\nThe EXP port on the left side of the pedal can function as an expression pedal, foot switch input, or a MIDI input.\nExpression Pedal:  Set the expression pedal to the heel down position, then adjust the knobs to your preferred setting.  Sweep the pedal to the toe position and set the knobs to a different setting.  Now the F.13 Neo will allow you to seamlessly morph between the two settings!\nNeo Foot Switch:  Connect our amazing Neo Footswitch to this jack to remotely trigger the Ramp, Tap Tempo, or Preset Select.  The Neo Footswitch features a multi-colour LED that shows the current status of the pedal.  This jack also supports connections using a standard tap tempo style footswitch.\nMIDI:  The Neo Series pedals can connect to a compatible MIDI controller to control all of the pedal functions plus access 12 extra presets, for a total of 16.  We recommend the Disaster Area DMC Gen3 series.  The USB port may also be used as a MIDI interface to your computer or mobile device.\nControls:\nControls in parentheses () are accessed by holding down the Select button and turning the indicated knob.\nRate:  Controls the modulation rate from glacial to gee-whiz.\nDepth:  Controls the modulation depth.\nWAVELENGTH WAVE SHAPES \nWAVELENGTH WAVE SHAPES\n(Ramp Speed): Sets the time the pedal will take moving between the two ramp settings, from instant to approximately 10 seconds.\nMix:  Controls the blend between the dry and modulated signal.  Equal mix is at 12 o'clock. Hint: Tremolo sounds deepest at full Mix settings, and phaser / vibe / flange sounds deepest with Mix near its midpoint.\n(Level):  Controls the overall output level of the pedal, from -20dB to +10dB.  Unity gain is near 1 o'clock.\nTweak:  Adjusts the a different parameter for each effect mode.  Please consult the mode descriptions for more information.\n(Shape):  Sets the modulation wave shape.  The main LED will change colour to show the current wave shape while the center button is pressed.  We've packed in the most common waveforms like Sine, Triangle, and Square, as well as some more interesting options such as Pulse, Rise, and Fall.  We've even put in a random \"sample and hold\" waveform that's super fun with the Filter mode.\nSelect Button - tap to choose a new effect mode:\nTRM  Tremolo - this effect cycles your volume up and down for a cool rhythmic texture.  Twist the Tweak control to morph between standard tremolo and harmonic vibrato.  Don't forget you can use the Level control to bump up your volume and make up for any drop you might get from the effect!\nCHO Chorus - smooth and clear chorus tones live here.  Use the Tweak control to adjust the overall delay time of the effect.  Low settings yield flange-like tones and higher settings result in a double-tracking effect.\nPHA Phaser - eight-stage phase goodness, chewy and thick.  Crank the Tweak control to add regeneration, deepening the phase shift effect.\nFLG Flanger - ranges from subtle comb filtering to insane jet whoosh.  Use the Tweak control to adjust the feedback for a sharper flange.\nVIB Vibe - photocell and lamp style vibe effect.  The Tweak knob adjusts the balance and symmetry of the shift stages and the effect gets more pronounced as you increase the control.\nFLT Filter - resonant low-pass filter effect.  Tweak controls the resonance of the filter.  Be careful, this can self-oscillate at higher settings!  Sounds killer with the Random waveform, ship ahoy!\nBypass Switching:\nThe Wavelength features a buffered bypass using a soft-touch footswitch.  The dry signal path is digital, to maintain the phase relationship between dry and modulated signals. The bypass signal is 100% analog.\nConfiguration:\nTo configure, power on while holding the center Select button and release when the program LEDs start to flash.\nTap the Select button to choose Expression (upper LED blue,) Foot Switch (upper LED violet,) or MIDI (upper LED red.)\nTurn the Rate knob to select the function for the Neo Footswitch - Counterclockwise for ramp, center for preset select, clockwise for tap tempo.\nTurn the Tweak knob to set the LED brightness.  The large center LED and the two smaller LEDs above the footswitches are controlled by this setting.  The center group of LEDs near the Select button have a fixed brightness.\nIf you wish to assign the Wavelength MIDI channel, simply send a program change message from your controller on the correct channel while the pedal is in configuration mode.  Hold the Select button to save the pedal settings.\nThe Wavelength MIDI port requires the use of either a MIDI converter box such as the Neo Link, Disaster Area / Chase Bliss MIDIBox or a MIDI controller that supports 1/4\" devices such as the Disaster Area Gen3 series.  The Wavelength defaults to using MIDI Channel 1.\nHOLD THE SELECT BUTTON TO SAVE CONFIGURATION\nPower Supply:\nThe Wavelength requires a 9V DC power supply with a 2.1mm pin, center negative, 80mA.  The Wavelength is not designed to be powered on supplies higher than 9V and does not use a battery.  The Wavelength should work fine on a multi-pedal \"daisy chain\" connector, but if you encounter excessive noise or hum try a separate power supply.",
    "hrid": "alexander-wavelength"
}