{
    "py/object": "mylib.pedal.Pedal",
    "id": "14856",
    "name": "Radical Delay II +",
    "image": "images/alexander-radical-delay-ii-+.jpg",
    "function": [
        "Delay"
    ],
    "manufacturer": "Alexander",
    "current": "? mA / ? V / AC/DC",
    "cost": "$200 Price in €",
    "width": 64,
    "height": 117,
    "details": "Digital DelayWe stuck our classic ‘80s flavored delay in the Betamax and fast-forwarded to the good part. But instead of an eyeful of Phoebe Cates, we discovered the Radical Delay II+.\nThe sound you love with more reasons to love it, like updated cosmetics and built-in tap tempo.\nControls:\nTime (8 D. Q) — Changes the delay time from 0-920ms. In Tap mode, this knob sets the tap tempo subdivision. Left for 8th notes, center for dotted 8ths or right for quarters.\nRepeat — Controls the feedback of the delay. The Radical Delay II+does not self-oscillate, because that does not compute.\nTweak — Adjusts a different parameter in each mode. See the mode descriptions for full details.   \nMix — Controls the blend between fully dry (clean) to fully wet (repeat only). \nMode Toggle:\nMod — Super-clean digital delay with adjustable modulation. The Tweak knob adds a luscious modulation to the delay. At 12 o’clock there is no modulation. Clockwise adds a slow chorus and counter-clockwise adds a fast vibrato.  \nGlitch — Pristine digital delay that you can mangle in unusual and interesting ways.  With the Tweak knob fully counter-clockwise, the Radical Delay will echo exactly what you play. Turn the Tweak knob clockwise to add some “ghost in the machine” style glitches and odd pitch modulation. And with the Tweak knob fully clockwise, the Radical Delay sounds more like a synthesizer or video game console. \nBend — Delay with pitch shifting that’s based on the earliest technology and spirals up or down with each repeat. Turn the Tweak knob counter clockwise to shift the pitch down or clockwise to shift up.\n*Hint: Turn the delay time all the way down and the Radical Delay will take on a whole new vibe. In Mod mode, you’ll find analog-flavored chorus. Glitch mode turns into a “bleep bloop” robot machine. And in Bend mode, try blending the dry signal in for glitchy pitch-shifted harmony lines.  \nTap Tempo:\nHold the bypass footswitch to enter tap tempo mode.  The bypass LED will flash at the current tempo, tap the footswitch two or more times to set a new tempo.  Hold the bypass footswitch again to exit tap tempo mode or wait 4 seconds and the pedal will exit on its own.  Turn the Time control while in tap tempo mode to change the delay subdivisions - each division is marked by a dot.  The available divisions are eighth-note (2x tap speed,) dotted-eighth (1.5x tap speed) and quarter-note (1x tap speed.)  The pedal will remember the last tap tempo setting used.\nThe green jack on the side of the pedal allows you to connect a tap tempo footswitch.  The Radical Delay II+ requires the use of a normally-open footswitch, and is compatible with automated tap tempo controllers such as the Disaster Area SMARTClock or Gen3 MultiJack interface.  Tapping the remote footswitch will cause the Radical Delay II+ to enter tap tempo mode.  We recommend the Alexander Tap II footswitch to control the Radical Delay II+.\nIf you prefer to get crazy, you can assign the green jack to act as an expression pedal input.  Hold the footswitch down at power-on to select between tap tempo (two blinks) or expression (five blinks.)  Connect a standard expression pedal (tip 0-3.3V, ring 3.3V, sleeve GND) to the green jack and you're good to go.  To set the expression pedal range, move the expression pedal to the heel-down setting and turn the Time knob.  Then move the pedal to the toe-down setting and turn the Time knob again.  The Radical Delay II+ will sweep the delay time between these two settings as you move the expression pedal, and the LED will indicate the current expression pedal position.\nBypass Switching:\nThe Radical Delay II+ features a buffered bypass with \"trails.\"  The delay will continue to repeat when the pedal is bypassed.  The Radical Delay II+ features an analog dry signal path.\nPower Supply:\nThe Radical Delay II+ requires a 9V DC / 70mA power supply with a 2.1mm pin, center negative.  The Radical Delay II+ is not designed to be powered on supplies higher than 9V and does not use a battery.  The Radical Delay II+ should work fine on a multi-pedal \"daisy chain\" connector, but if you encounter excessive noise or hum try a separate power supply.\nhttps://www.alexanderpedals.com/shop/radical-delay-ii",
    "hrid": "alexander-radical-delay-ii-+"
}