{
    "py/object": "mylib.pedal.Pedal",
    "id": "17607",
    "name": "Defender Stargate Drive",
    "image": "images/alexander-defender-stargate-drive.jpg",
    "function": [
        "Digital",
        "Distortion",
        "MIDI",
        "Pitch Shifter"
    ],
    "manufacturer": "Alexander",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 64,
    "height": 117,
    "details": "Overdrive, Distortion, Fuzz, MIDIWhy should you use a digital distortion pedal?\nNo idea.  Analog is better, right?  You should probably go buy a Tube Screamer.  But if you're interested in expanding your horizons, read on.\nOne of the things we love about making pedals is that we get to come up with things that are new and exciting.  The prospect of doing another \"me too\" overdrive pedal wasn't really that appealing.  We decided that the best way to approach a digital distortion pedal was to think of all of the things you couldn't do with analog and proceed from there.  We love this pedal, and we hope you like it too.\nNeo Series:\nThe sonic scientists at Alexander Pedals have been working overtime to cram the most pedal into the smallest box, and we now present the Neo Series!  Each Neo Series pedal incorporates an advanced 32-bit microcontroller adding presets, expression, and MIDI capability.\nThe Neo Series pedals are small but mighty!  Imagine having a single pedal on your board that can access up to 4 separate preset tones with a touch of your toe.  Connect an expression pedal to \"morph\" between two distinct settings for each preset for dynamic real-time effects.  Or connect the Neo Footswitch to enable your choice of preset select, tap tempo, or start / stop the sequence in real time.\nPresets:\nAll Neo Series pedals feature a simple yet powerful preset functionality.  Hold the bypass footswitch to move the pedal to the next available preset, and the pedal will reconfigure itself on the fly.  All knob values and the effect mode settings are recalled, allowing you to set up to four unique tones.  Want more presets?  Simply connect a MIDI controller to the EXP port on the side of the Neo Series pedal and access up to 16 presets total.\nTo load a preset, hold the bypass footswitch down or send a MIDI program change from 0-15.\nTo save a preset, hold the Select button down and then hold the bypass footswitch.  The pedal will save the current settings to the current preset.\nAny changes you make to the pedal settings will be lost when switching to a new preset unless you save the current preset first, so be careful!\nExpression and MIDI:\nThe EXP port on the left side of the pedal can function as an expression pedal, foot switch input, or a MIDI input.\nExpression Pedal:  Set the expression pedal to the heel down position, then adjust the knobs to your preferred setting.  Sweep the pedal to the toe position and set the knobs to a different setting.  Defender allows the user to sweep any or all of its knobs with a connected expression pedal.\nFoot Switch:  The Neo Footswitch (sold separately) allows for preset select or WARP - all with LED indication.  The Defender will also work with a standard tap tempo footswitch.\nMIDI:  The Neo Series pedals can connect to a compatible MIDI controller to control all of the pedal functions plus access 12 extra presets, for a total of 16.  The USB port may also be used as a MIDI interface to your computer or mobile device.\nControls:\nPress and hold the center button while turning the knobs to activate the alternate controls (shown in parentheses.)\nLEVEL - Adjusts the overall output level of the Defender.  The pedal has quite a bit of volume on tap, enough to overdrive your amp.\nDRIVE - Controls the amount of drive, saturation, and distortion of the effect.\n(WARP) - Adjusts the speed of the WARP control.  With this control at minimum the Defender will warp between the red and blue settings instantly.  With the control at maximum the pedal will take approximately 10 seconds to warp.\nLIGHT - Controls the treble or brightness of the distortion effect or the cutoff frequency of the filter if FLT is selected.\n(BLEND) - Mixes the clean signal (fully counter-clockwise) with the distorted signal (fully clockwise.)  This is a really crucial control for using the Defender with bass or low-tuned guitars, allowing you to dial in some clean signal to increase the articulation.\nMATTER - Controls the bass or depth of the distorted tone or the resonance / feedback of the filter if FLT is selected.\n(TWEAK) - Adjusts the special effect for each distortion mode.  Varies for each effect, check out the descriptions below!\nSelect Button - tap to choose a new effect mode or hold to engage the ALT controls:\nThe upper LED shows the distortion effect selection.\nOD - Overdrive with a clear midrange character.  This mode ranges from transparent to gritty with a sweep of the Drive knob.  Try this mode with the Blend control near noon for a great soft-clipping boost.\nDST - Distortion with a darker, smoother tone.  Gets hairy really quickly and loves to party.\nFZ - Splattery, sizzly fuzz tone.  Don't even bother trying to get this one to clean up, sounds kind of like a toy robot being fed into a garbage disposal.\nOnce you've selected your distortion, you can choose from one of three special effects.  Any distortion effect may be combined with any special effect.  Please note that the special effects only work on the distorted sound, and not on the clean blend signal.\nPIT - Polyphonic octave shifting, applied to the distortion signal only.  The Tweak control adjusts the blend between octave down, distortion, and octave up.  This effect is killer for sub-octave riffing or screaming fuzz freakouts.\nSPC - Space modulation using a short time delay on the distortion signal.  Tweak controls the delay time from zero to a short slap-back.  Try using the Warp function to sweep the delay time for manual flanger sounds.\nFLT - Super-tweakable resonant lowpass filter, ideal for synth or wah textures.  Light controls the cutoff frequency, Matter controls the resonance or sharpness of the filter.  Tweak mixes between the filtered sound and the unfiltered sound.\nWant to get a distortion effect without the special effects?  Just select the distortion sound you like (OD, DST, FZ) and select PIT as your special effect.  Hold the Select button and turn the MATTER / TWEAK knob to its midpoint.  The pitch effect will be bypassed and you'll just have dirt.\nWARP Switch:\nTap this footswitch to accelerate the Defender into warp drive!  While Warp is active, the Defender will move to a second unique setting of your choice.  Just turn the pedal knobs while Warp is active to set the Warp tone.  Tap the footswitch again to return to the regular sound.  ALL knob settings may be changed as part of the Warp mode, but the distortion and effect selections must stay the same. \nThe Warp speed may be adjusted by holding the Select button and turning the Drive knob.  Low settings of Warp will cause the pedal to move into and out of Warp mode instantly, while higher settings will accelerate into and out of Warp mode more gradually. \nYou can also hold the Warp footswitch to activate Impulse mode, which will enter and exit Warp mode only as long as you hold the footswitch down.  Try using Warp to set two different distorted sounds for rhythm and lead, or using the Impulse function to add some filtering or space delay to the climax of a solo!  The possibilities are endless, and if you engage it while flying backwards around the sun you may end up saving some whales...\nBypass Switching:\nThe Defender features a buffered bypass using a soft-touch footswitch.  The dry signal path is digital to maintain the phase relationship between distortion and clean. The bypass signal is 100% analog.\nConfiguration:\nTo configure, power on while holding the center Select button and release when the program LEDs start to flash.\nTap the Select button to choose Expression (upper LED blue,) Foot Switch (upper LED violet,) or MIDI (upper LED red.)\nTurn the Rate knob to select the function for the Neo Footswitch - Counterclockwise for sequence start / restart, center for preset select, clockwise for tap tempo.\nTurn the Matter / Tweak knob to set the main LED brightness.\nIf you wish to assign the Defender MIDI channel, simply send a program change message from your controller on the correct channel while the pedal is in configuration mode.  Hold the Select button to save the pedal settings.\nThe Defender MIDI port requires the use of either a MIDI converter box such as the Disaster Area / Chase Bliss MIDIBox or a MIDI controller that supports 1/4\" devices such as the Disaster Area Gen3 series.  The Defender defaults to using MIDI Channel 1.\nHOLD THE SELECT BUTTON TO SAVE CONFIGURATION\nPower Supply:\nThe Defender requires a 9V DC power supply with a 2.1mm pin, center negative, 80mA.  The Defender is not designed to be powered on supplies higher than 9V and does not use a battery.  The Defender should work fine on a multi-pedal \"daisy chain\" connector, but if you encounter excessive noise or hum try a separate power supply.\nhttps://www.alexanderpedals.com/shop/defender",
    "hrid": "alexander-defender-stargate-drive"
}