{
    "py/object": "mylib.pedal.Pedal",
    "id": "17787",
    "name": "Quadrant",
    "image": "images/alexander-quadrant.jpg",
    "function": [
        "Delay"
    ],
    "manufacturer": "Alexander",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 64,
    "height": 117,
    "details": "Audio MirrorJourney with us into the Quadrant - four unique effects hailing from a distant delay dimension.  We hold a mirror up to your music, and reflect the echoes from a parallel universe.\nMagnetic, analog, digital, and lo-fi delays await within, coupled with the power of our Neo Series platform to provide a unique but familiar echo experience.\nNeo Series:\nThe sonic scientists at Alexander Pedals have been working overtime to cram the most pedal into the smallest box, and we now present the Neo Series!  Each Neo Series pedal incorporates an advanced 32-bit microcontroller adding presets, expression, and MIDI capability.\nThe Neo Series pedals are small but mighty!  Imagine having a single pedal on your board that can access up to 4 separate preset tones with a touch of your toe.  Connect an expression pedal to \"morph\" between two distinct settings for each preset for dynamic real-time effects.  Or connect the Neo Footswitch to enable your choice of preset select, tap tempo, or an automatic ramp \"morph!\"\nPresets:\nAll Neo Series pedals feature a simple yet powerful preset functionality.  Hold the bypass footswitch to move the pedal to the next available preset, and the pedal will reconfigure itself on the fly.  All knob values and the effect mode settings are recalled, allowing you to set up to four unique tones.  Want more presets?  Simply connect a MIDI controller to the EXP port on the side of the Neo Series pedal and access up to 16 presets total.\nTo load a preset, hold the bypass footswitch down or send a MIDI program change from 0-15.\nTo save a preset, hold the Select button down and then hold the bypass footswitch.  The pedal will save the current settings to the current preset.\nAny changes you make to the pedal settings will be lost when switching to a new preset unless you save the current preset first, so be careful!\nExpression and MIDI:\nThe EXP port on the left side of the pedal can function as an expression pedal, foot switch input, or a MIDI input.\nExpression Pedal:  Set the expression pedal to the heel down position, then adjust the knobs to your preferred setting.  Sweep the pedal to the toe position and set the knobs to a different setting.  Now the Quadrant will allow you to seamlessly morph between the two settings!\nFoot Switch:  The Neo Footswitch (sold separately) allows for preset select, tap tempo, or ramp morph control - all with LED indication.  The Quadrant will also work with a standard tap tempo footswitch.\nMIDI:  The Neo Series pedals can connect to a compatible MIDI controller to control all of the pedal functions plus access 12 extra presets, for a total of 16.  The USB port may also be used as a MIDI interface to your computer or mobile device.\nControls:\nControls in parentheses () are accessed by holding down the Select button and turning the indicated knob.\nRate:  Controls the delay time from 0-915ms.  If Glide is disabled, the time will adjust seamlessly.  If Glide is enabled, the time will pitch-shift and get all \"rubber-bandy\" (technical term.)\n(Tone):  Controls the tone of the delay engine.  Controls the grunge and grit of the LOFI mode.\nFeedback:  Controls the repeat level of the delay.  The BBD and LOFI modes will go into infinite / runaway feedback.\n(Glide): Controls the delay time change method.  If Glide is set to less than 12 o'clock, the delay time will adjust seamlessly when tapped or adjusted with the Time knob.  If Glide is set to greater than 12 o'clock, the delay time will pitch shift when adjusted.\nMix:  Controls the blend between the dry and delay signal.  Equal mix is at 12 o'clock.\n(Level):  Controls the overall output level of the pedal, from -20dB to +10dB.  Unity gain is near 1 o'clock.\nMod:  Adjusts the depth of the delay modulation.\n(Rate):  Adjusts the rate of the delay modulation.\nSelect Button - tap to choose a new effect mode:\nMAG - Magnetic tape echo, warm and rich.  The MAG mode captures the frequency response of the tape heads and preamp of a vintage tape delay.  The Mod knob controls the \"wow\" or \"flutter\" of the tape.  Each delay repeat loses both treble and bass, for a warm and compressed sound.  The Tone knob controls the age of the tape, making the echo brighter or darker.\nBBD - Analog delay, murky and wet.  The BBD mode is based on a classic solid-state analog echo.  This mode is capable of infinite repeats for the classic analog delay \"spaceship\" tone.  The Mod knob adds analog chorus or vibrato.  The Tone knob controls the analog delay filter.\nDIG - Digital delay, bright and present.  The DIG mode captures the sheen and clarity of the early digital delays.  Each repeat sounds just like what you put in, with the classic digital \"clang\" you will either love or hate.  The Mod knob adds wide-ranging pitch modulation, be careful!  The Tone control sweeps the delay between low-pass and high-pass filtering for a wide range of delay tones.\nLOFI - How can we put this?  This mode sounds terrible.  Don't use it.  It's all dirty and grungy and sounds like you're playing through a payphone or an AM radio.  Roll the Tone control down to clean things up a little, or crank it for minimum fidelity.\nBypass Switching and AutoTrails:\nThe Quadrant features a buffered bypass using a soft-touch footswitch.  The dry signal path is analog, to maintain your tone no matter how much delay you add!  The bypass signal is 100% analog.\nThe Quadrant features an innovative new feature - AutoTrails.  Some delay pedals cut the delay signal off as soon as you hit the footswitch - that sounds odd and unnatural.  Some leave the delay signal on all the time - that's better but you still get the noise from the delay signal even when you're not playing.  We give you the best of all worlds by letting you choose how long the delay trails persist, from instant-off to always-on.  When you bypass the Quadrant, the delay signal persists and then fades out smoothly after a time you set.  You want no trails?  Trails all the time?  No problem.  Set it any way that fits your playing style.\nConfiguration:\nTo configure, power on while holding the center Select button and release when the program LEDs start to flash.\nTap the Select button to choose Expression (upper LED green,) Foot Switch (upper LED orange,) or MIDI (upper LED red.)\nTurn the Delay knob to select the function for the Neo Footswitch - Counterclockwise for ramp, center for preset select, clockwise for tap tempo.\nTurn the Feedback knob to set AutoTrails - counterclockwise for no trails, clockwise for longer trails settings.  Fully clockwise will leave the trails on at all times.\nTurn the Mix knob to select the Foot Switch Ramp speed - Lower LED green slow, lower LED orange medium, lower LED red fast.\nTurn the Tweak knob to set the main LED brightness.\nIf you wish to assign the Quadrant MIDI channel, simply send a program change message from your controller on the correct channel while the pedal is in configuration mode.  Hold the Select button to save the pedal settings.\nThe Quadrant MIDI port requires the use of either a MIDI converter box such as the Disaster Area / Chase Bliss MIDIBox or a MIDI controller that supports 1/4\" devices such as the Disaster Area Gen3 series.  The Quadrant defaults to using MIDI Channel 1.\nHOLD THE SELECT BUTTON TO SAVE CONFIGURATION\nPower Supply:\nThe Quadrant requires a 9V DC power supply with a 2.1mm pin, center negative, 80mA.  The Quadrant is not designed to be powered on supplies higher than 9V and does not use a battery.  The Quadrant should work fine on a multi-pedal \"daisy chain\" connector, but if you encounter excessive noise or hum try a separate power supply.",
    "hrid": "alexander-quadrant"
}