{
    "py/object": "mylib.pedal.Pedal",
    "id": "15702",
    "name": "Sun Face Red Dot NKT",
    "image": "images/analogman-sun-face-red-dot-nkt.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Analogman",
    "current": "? mA / ? V / AC/DC",
    "cost": "$295 Price in €",
    "width": 64,
    "height": 114,
    "details": "Sun Face Fuzz Red Dot NKT Top Jack VersionUnlike a pedal like a Tube Screamer, which will always sound good if the right chip and other parts are installed correctly, a fuzzface is a very finicky circuit. The transistors used in a fuzzface make all the difference in tone, feel, and amount of fuzz/cleanliness. Germanium transistors were the first type of transistors generally available, starting in the early 1960s. They are not very stable or easy to manufacture consistently. Since silicon transistors took over from germanium in about 1970, almost nobody makes germaniums anymore, and the few that are made just don't do the trick in a fuzzface circuit. Each transistor used in a fuzzface needs to be tested for several parameters including gain, leakage, noise, and tone to make a great sounding fuzz. These transistors are just not available in any decent quantity. For these reasons, it's really tough for a large company to mass produce a classic germanium fuzzface that sounds good. It's too much of a hassle so most do not even try.\nWe can build our SUNFACE pedal for you, or modify your existing Fuzz Face, either a Dunlop reissue or Arbiter UK reissues to make them sound GREAT, just like Clapton in Cream or early Hendrix. The sound is nice and smooth, singing bluesy tone, not harsh noisy fuzz.\nThese pedals are VERY SENSITIVE to your guitar volume : with germanium, if you turn down a Strat's volume to about 7, there is very little distortion. At 9, it is a nice smooth bluesy tone, like Clapton in Cream. At 10, it is quite fuzzy, especially if you have hot pickups or humbuckers. Also, if you use another effect before the fuzz face, it can make it get a nastier distortion. You may try running a Distortion or compressor into the fuzz face, or vice versa, with varying volume settings on the guitar and/or effects. But for the purest tone, there should be no effects between the guitar and the fuzz. However, effects with true bypass that are turned OFF are OK before the fuzz (for example, an RMC wah). Vintage style wah pedals have some issues when used with a vintage style fuzz face (though Jimi did not seem to mind!). To cure that, the Foxrox Wah Retrofit is available. The Z Vex Wah Probe seems to work fine with our sunface, for a cool alternative.\nAll fuzz faces (and our sunface) have true bypass, so we don't need to modify them for true bypass.\nRed Dot NKT transistors\nIn mid 2017 we got some red dot NKT transistors which are not the NKT275 model, from The Netherlands. These are definitely made at the Newmarket factory, and look and sound almost identical to the old red dot NKT275 we used to have. They all test in the same range, medium low gain. I think they came from the same manufacturing line as the NKT275, but were sorted for this narrower gain range. They have a different part number on them after the \"NKT\", probably a house number for the specific customer who requested these parts (maybe a radio company in the Netherlands).\nhttp://www.analogman.com/fuzzface.htm",
    "hrid": "analogman-sun-face-red-dot-nkt"
}