{
    "py/object": "mylib.pedal.Pedal",
    "id": "14807",
    "name": "OD-9 Silver",
    "image": "images/analogman-od-9-silver.jpg",
    "function": [
        "PreAmp",
        "Distortion"
    ],
    "manufacturer": "Analogman",
    "current": "? mA / ? V / AC/DC",
    "cost": "$215 Price in €",
    "width": 65,
    "height": 120,
    "details": "OD-9 Overdrive with Silver optionThe Classic TS-808 sound is well known and loved by thousands of players and millions of music fans. It cuts through the mix in live situations very well and sounds full and warm, with a vocal frequency spectrum. However some guitar players feel it is a bit too heavy in the midrange and loses a bit too much bottom end, especially people who play fairly clean or alone or in a small combo. The TS-808 EFFECTS your sound, but in a good way. The SILVER option allows it to add the drive and warmth without EFFECTING your sound quite as much- it is more transparent, it does not sound like you are using an effect pedal as much.\nIn 2002 we came up with a new TS9/808/silver option to meet the requirements of those few super discriminating players. This modification is done in addition to our normal TS-808/Brown mod. It uses many expensive components to make the TS-808 circuit really come alive. \nThe silver option has less of a mid range hump than a normal tube screamer. While I love the classic TS-808 sound, this mod takes it a step further, making the pedal even more transparent, with less of an effect sound. It has improved low end without the tone-degrading qualities that come with the common low-end enhancement mods you can find on the web, which are simply adding a larger capacitor (the other modes on the TS9DX are like this). Our silver mod does not have nearly as much low end as the + (2nd) setting on the DX.\nIf increasing the value on a capacitor would improve the sound with no additional cost, Ibanez would have built them that way in the first place. Mass produced products like a TS9 are built to a price point, and made to perform as well as possible at the lowest manufacturing cost. The parts we use in the silver option would cost Ibanez millions of dollars a year if they were standard in the pedal, more than doubling the cost of the components. Only the small and high end manufacturers can afford to use these high quality components, which only the discriminating guitarist will notice.\nThe SILVER option sounds clearer and truer- even the bypassed tone is improved a bit. If you have ever dropped a pure silver coin onto a wooden table, and compared it to the sound of a regular nickle/zinc coin, you will have an idea of what we were going for. If you use two tube screamers together or your tube screamer in combination with other pedals the silver option will help quite a bit, as more of your tone gets through the TS9/808/silver, so the next pedal has more to work with.\nIn addition to several capacitors in the signal path, we also use special high end audio power supply filter capacitors. This lets your hard overdriven attacks (especially on the low strings) come through without mushing out, while soft, clean notes will still come out smoothly with no alterations. There is less compression to the sound, more note articulation. The entire sound is fuller and richer, with an emphasis on picking attack. Ohbayashi san has made his TS-808 clones using six 1.5V AAA batteries inside (see the RE-J on his web site!) to get this type of tone, but we found that these special power capacitors will give the same benefit in tone without having to lug around a box of batteries! These power capacitors work and sound best after they are \"formed\" at working voltage, so the tone of the pedal may improve with use. The spec sheets for the power caps we use state that the characteristics are stabilized after 100 hours of running. Or simply leave it connected to a power adaptor overnight to get all the caps happy, and use it often, for best tone! These capacitors are specifically designed to work well at the high frequencies of digital switching power supplies like the Power-All and One Spot. These power supplies can cause some noise with some pedals, but our silver mod should filter any noise out. We don't recommend these cheap digital switching power supplies if you don't already have one, but if you do they should be ok if you are careful.\nThere is another benefit of these power capacitors - they last a long time unlike the stock 47uF caps. We have replaced probably 100 original capacitors over the years that have blown up or died, causing the pedal to stop working. The caps we use don't have electrolyte inside, so they can't leak or bubble, which was a huge problem in the mid 2000's.\nhttp://www.buyanalogman.com/Maxon_OD_9_808_Mods_p/am-maxon-od-9-mods.htm",
    "hrid": "analogman-od-9-silver"
}