{
    "py/object": "mylib.pedal.Pedal",
    "id": "16240",
    "name": "V-TONE GUITAR DRIVER DI GDI21",
    "image": "images/behringer-v-tone-guitar-driver-di-gdi21.jpg",
    "function": [
        "Modeling/Simulation",
        "Multieffect"
    ],
    "manufacturer": "Behringer",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 99,
    "height": 127,
    "details": "Guitar Amp Modeler/Direct Recording Preamp/DI BoxBEHRINGER V-TONE GUITAR DRIVER DI GDI21\nGuitar Amp Modeler/Direct Recording Preamp/DI Box\nAnalog guitar modeling preamp/stompbox with DI recording output\nThis BEHRINGER product has been designed to compete head to head with leading products on the market\nAuthentic V-TONE modeling technology for 3 classic guitar amps, 3 gain modes and 3 mic placements for a total of 27 configurations. Easily achieve the most sought-after tube amp sounds from clean, crunch to super-fat distortion\nProvides a truckload of great amps in a single stomp box - simply choose your favourite sounds with a flick of a switch\nPrecise level and drive control plus musical 2-band EQ for ultimate sound\nDual DI mode for either direct recording output with speaker simulation or standard active direct injection box in bypass mode\nOutput available on1/4'' TS or balanced, gold-plated XLR connectors\nGround lift switch eliminates typical ground loop problems\nRuns on 9 V battery or the BEHRINGER PSU-SB DC power supply (not included)\nHigh-quality components and exceptionally rugged construction ensure long life\nConceived and designed by BEHRINGER Germany\nOur authentic V-TONE modeling technology recreates three of the most sought-after classic guitar amps, with three gain modes and three mic placements for a total of 27 possible configurations. You get a truckload of great amps in one convenient stomp box, allowing you to go from clean or crunch to super-fat distortion in a flash.\nExtremely User-Friendly\nOperation is simple; just choose the type of amp, from the smooth Calif (Californian), the bright, punchy TWED (Tweed), or the BRIT (British) with its incredible sustain and aggressive mids. Then select the gain mode, CLN (clean), HOT or HI G (high gain). Lastly, choose the mic placement from the three available selections. This feature is a BEHRINGER exclusive, allowing you to place the \"virtual mic\" in any of three positions:\n(OFF X) - At the edge of the speaker cone, producing a smoother, softer sound with less midrange content\n(CNTR) - Positioned at the center of the cone, for more upper mids and beefy low-end\n(CLSIC) - Slightly in front of the cabinet, for high midrange content with tons of definition\nIt's a Tone Thing\nWe've also included a dedicated Drive control, for adjusting the amount of gain. This control effectively mimics the amount of push applied to the output stage of a tube amplifier, from a gentle nudge to full-out, tube-melting overdrive. Further tone shaping is provided by a highly musical 2-band EQ.\nVersatility\nThe GDI21 can be used for direct recording output, with speaker simulation or, when used in bypass mode, as a superb active DI box. A 1/4\" output jack is provided for connecting to your amp and the gold-plated, balanced XLR connector will link you cleanly to the front of house console. Ground loop problems are nonexistent, thanks to the onboard ground lift switch.\nValue\nWhether you use it on the stage or for recording, the BEHRINGER V-Tone Guitar GDI21 is the ultimate choice for musicians seeking an extremely versatile array of time-tested, classic tones. With the GDI21, you get the sound of three classic guitar amps and a superb DI box, all for the price of a single stomp box! Try one at your local BEHRINGER dealer today.\nhttps://images-na.ssl-images-amazon.com/images/I/91DqHVcsHqS.pdf",
    "hrid": "behringer-v-tone-guitar-driver-di-gdi21"
}