{
    "py/object": "mylib.pedal.Pedal",
    "id": "13779",
    "name": "V-Tone Bass Driver DI BDI21",
    "image": "images/behringer-v-tone-bass-driver-di-bdi21.jpg",
    "function": [
        "Bass",
        "Utility"
    ],
    "manufacturer": "Behringer",
    "current": "? mA / ? V / AC/DC",
    "cost": "$30 Price in €",
    "width": 99,
    "height": 127,
    "details": "Bass Amp Modeler/Direct Recording Preamp/DI Box\nAnalog modeling bass preamp/stompbox with DI recording output\nThis BEHRINGER product has been designed to compete head to head with leading products on the market\nAuthentic V-TONE modeling technology capable of dialing up big vintage tube tones, funky slap sounds, crunchy distortions and all in between\nProvides a truckload of great amps in a single stomp box-from traditional bass amps to modern overdriven amp tones that would typically require a multitude of effects units\nAuthentic tube emulation circuitry can be mixed with the direct bass signal via blend control\nPresence control for definition and upper harmonics plus ultra-musical 2-band EQ specifically tuned for bass guitars\nDual DI mode for either direct recording output with tube emulation or standard active direct injection box in bypass mode\nOutput available on 1/4'' TS or balanced, gold-plated XLR connectors\nGround lift switch eliminates typical ground loop problems\nRuns on 9 V battery or the BEHRINGER PSU-SB DC power supply (not included)\nHigh-quality components and exceptionally rugged construction ensure long life\nConceived and designed by BEHRINGER Germany\n\nThere are DI boxes...and then there's the V-TONE BASS BDI21 - the feature-packed analog DI box built especially for bass.\nNot Your Average DI Box\nThe BDI21 combines the features of an active DI (direct injection) box with our proprietary tube emulation circuitry. It's like having a truckload of vintage tube amps right at your toes! The Blend control allows you to mix the amount of tube emulation you want with your direct bass signal. And if you don't want to use the tube emulation feature, just step on the switch and the ADI21 functions as a superb active DI box.\nSo Easy to Use\nWith its dedicated DRIVE, TREBLE, BASS, LEVEL, and PRESENCE dials, the BDI21 DI box goes above and beyond, giving you vintage tube tones for some funked-up slap, gonzo overdrive and everything in-between. You can use the BDI21 as a recording output DI, with tube emulation, or as a standard active DI box, when running in bypass mode. The output is laid out on 1/4\" TS or balanced, gold-plated XLR connectors. There's also a ground lift switch that eliminates typical ground loop hum problems. You can power this bad boy with a 9V battery or our PSU-SB DC power supply (not included).\nValue\nWhen it comes to DI boxes, you can go with simple injection, or plug into the BDI21 to add some badass tube-like fuel injection to your bass. Try the V-TONE BASS BDI21 at your local BEHRINGER dealer and find out just how great your bass can sound.\nhttps://www.amazon.com/BEHRINGER-V-TONE-BASS-DRIVER-BDI21/dp/B000KIPUQG",
    "hrid": "behringer-v-tone-bass-driver-di-bdi21"
}