{
    "py/object": "mylib.pedal.Pedal",
    "id": "12621",
    "name": "Special Twosome Deluxe (Blackout Effectors)",
    "image": "images/blackout-effectors-special-twosome-deluxe-(blackout-effectors).jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Blackout Effectors",
    "current": "? mA / ? V / AC/DC",
    "cost": "$325 Price in €",
    "width": 143,
    "height": 117,
    "details": "AKA the STD.\nThe damask is back! First came the limited edition “A Very Special Twosome” sold exclusively through ProGuitarShop . It sold out faster than anyone could have anticipated leaving a lot of people left out of the fun. Then came the limited edition Seriously Special Twosome (gold version – which introduced the Blunderbuss Fuzz to the mix) and then the Seriously Special Twosome (color of money version). Both runs were practically sold out by the time we could get them into PGS’s hands. What a great problem to have! Unless you missed the boat again on snagging one. Hordes of you have emailed us over the past few years asking when we’d be doing another run of the VST/SST and we just didn’t have a good answer for that. Well it’s time to put a nail in that coffin.\nThe STD is the final fruition and it promises to be the Cadillac of the special Twosome lineage. We’ve created a limited edition run in two versions: one using the Musket fuzz circuit and one using the Blunderbuss. We’ve done away with the order switcher toggle in favor of a 3rd foot switch (hierarchy) and a color changing LED to indicate which circuit is first in the stack. Instead of having to bend over to change the stack order now you can just stomp and go.\nSTANDOUT FEATURES |\n2 killer classic Blackout fuzz circuits in one box\n2 limited edition versions: Blunderbuss or Musket\nIndependent in-series circuit operation ideal for stacking one circuit into the other for even crazier fuzzmelts\nChange the order of the stacked circuits with the new middle Hierarchy foot switch\nStock Twosome version is the only version with A/B switching, unlike the VST-modded Twosome and the actual VSTs, SSTs, and STDs.\nDamask and an owl?!?",
    "hrid": "blackout-effectors-special-twosome-deluxe-(blackout-effectors)"
}