{
    "py/object": "mylib.pedal.Pedal",
    "id": "12057",
    "name": "Boomerang III Phrase Sampler",
    "image": "images/boomerang-musical-products-boomerang-iii-phrase-sampler.jpg",
    "function": [
        "Looper",
        "Sampling"
    ],
    "manufacturer": "Boomerang Musical Products",
    "current": "? mA / ? V / AC/DC",
    "cost": "$569 Price in €",
    "width": 229,
    "height": 152,
    "details": "Live performance looper*Features *\n Top of Page \n•  Easily syncs to an external MIDI clock source. The MIDI Start and Stop commands are supported as well.\n•  Flexibility provided by 4 distinct Play Styles.\n      Serial Play Style - loops play one after the other for building a song in verse/chorus/bridge fashion.\n      Serial Master Play Style - For serial style loopers it's nice to have a rhythmic background behind the melodic loops. Mute \n          the strings and record a short \"chika-chika\" or beat on the sides of your acoustic axe. This rhythmic master loop can \n          then play along with any other loop.\n      Sync Play Style - all loops can play simultaneously and are synced so they stay together.\n      Free Play Style - all loops can play simultaneously and are NOT synced; this is great for creating ambient soundscapes.\n•  3 or 4 loops - your choice.\n•  Maximum recording time varies but can be as long as 35 minutes.\n      48KHz true stereo recording yields about 4 1/2 minutes\n      48KHz mono recording yields almost 9 minutes\n      24KHz true stereo recording yields almost 9 minutes\n      24KHz mono recording yields over 17 1/2 minutes\n      12KHz mono recording yields over 35 minutes\n•  Stacking - \"stacking\" is adding a part to a loop (There is no limit to the number of parts you can stack.)\n•  Undo/Redo - the last part stacked can be muted, then played again or rerecorded.\n•  Erase - loops can be erased one at a time or all at once; some loops can be erased while others plays.\n•  Copy Loop - a complete loop can be copied whether it is playing or not.\n•  Copy Live - this enables \"re-sampling\" and is very powerful; the pedal's output is routed to a new loop.\n•  Octave - plays loop an octave lower - your choice of original tempo (instant bass part) or playing at half speed.\n•  Reverse - loop plays backwards.\n•  Once - loop plays one time through then stops or if already playing, it stops at its end.\n•  Stutter - enables repeatedly starting a loop over before it plays all the way through, sort of like record scratching.\n•  Fade - loop(s) fades in or out with one button press; fade time can be 3 to 43 seconds.\n•  Reverse Solo - this is a built-in effect and enables you to create reverse leads live.\n•  Two Sample Rates - 48KHz or 24KHz, both use 20 bit samples; through signal is always 48KHz / 24 bits.\n•  Thru Mute Function - turns off through signal.\n•  Expression Pedal Jack - connect an expression pedal for foot control of overall playback volume or Decay Rate.\n•  Volume Knobs\n      Serial & Serial-Sync Play Styles\n          Volume controls playback level. Vol 2 - Vol 4 do nothing in these Play Styles.\n      Sync & Free Play Styles\n          Volume controls playback level of loop 1\n          Vol 2 controls playback level of loop 2\n          Vol 3 controls playback level of loop 3\n          Vol 4 controls playback level of loop 4\n•  Decay Rate Knob - sets the rate at which earlier parts fade when new ones are added; continuously variable from 0-100%.\n•  Stereo or Mono - recording and playback will be stereo or mono depending on which of the Smart Jacks you use.\n•  Smart Jacks - the Rang™ III senses which jacks are being used and provides different signal routing options.\n•  Rugged 9\" x 6\" x 2\" steel chassis. It's much smaller than the other loopers that approach the III's power.\nhttp://www.boomerangmusic.com/E156.shtml",
    "hrid": "boomerang-musical-products-boomerang-iii-phrase-sampler"
}