{
    "py/object": "mylib.pedal.Pedal",
    "id": "18386",
    "name": "Transmutron",
    "image": "images/boredbrain-music-transmutron.jpg",
    "function": [
        "Controller",
        "Filter",
        "Utility"
    ],
    "manufacturer": "Boredbrain Music",
    "current": "? mA / ? V / AC/DC",
    "cost": "$320 Price in €",
    "width": 149,
    "height": 98,
    "details": "Dual FX Loop Crossover FilterFeatures:\n\nsplit signal into two frequency bands \nprocess with pedals, eurorack and other effects \ncrossover, crossfader and resonant notch modes \ncontrol splitpoint with CV and expression pedal \nselect between 12, 24 or 48 db/oct filter slopes \nlimit bandwidths with hi & low cut filters\n\nModes:\nFISSION: The Splitpoint parameter controls the crossover frequency to define the bands for each FX channel. \nFUSION: The Splitpoint parameter adjusts the pre-FX level balance between the two channels like a crossfader. \nFALLOUT: The Splitpoint parameter moves a wide, resonant notch filter across both pre-FX channel signals.\nDescription:\nAre your effects chains suffering from radioactive decay? The Transmutron allows you to combine pedals (and eurorack effects) within its sonic reactor to create new and exciting compounds! Different results can be achieved using one of three modes: Fission (crossover filter), Fusion (crossfader), and Fallout (resonant wide-notch filter). \nIn the primary mode, Fission, the signal from your guitar, bass, synth, or drum machine is split into separate frequency bands, sent simultaneously to different effects, and then recombined to a single output (or two separate outputs). The Splitpoint parameter can be controlled manually or with an expression pedal, and simultaneously injected with a control voltage (CV) source for extremely dynamic reactions! \nIn Fusion mode, the Splitpoint instead acts as a pre-FX level crossfader, rather than splitting the signal into separate bands. This allows for less extreme blends, especially when modulating. In the third mode, Fallout, a resonant wide-notch filter is applied to both pre-FX channel signals, cutting a hole and creating a phasing-wah effect when using an expression pedal or LFO to sweep the Splitpoint back and forth. \nTo further shape the signals sent to your effects, the Transmutron is equipped with dedicated hi and low cut filters. In Fission and Fallout modes, the cutoff frequencies of these filters also define the end-to-end sweepable range of the Splitpoint parameter and its center frequency. The filters have selectable slopes of 12, 24, or 48 db/oct, which also affects the crossover filter, and greatly enhances the resonance of the wide-notch filter. If further separation of the parallel FX channels is needed, a dedicated phase switch is on-hand. \nBoth FX channels have two sets of sends and returns: 1/4-in for guitar pedals and line-level effects, and 3.5mm for eurorack level processing. For each channel, the 1/4-in and 3.5mm FX loops can be used simultaneously, as they are in series (3.5mm then 1/4-in). The FX sends are half-normalled so they can be used as buffered copies without affecting the returns. Additionally, the 3.5mm FX loops for each channel can be independently switched to pedal/line-level using internal dip switches, which allows for seamless integration with the Boredbrain Patchulator 8000. \nHow complex the reaction is up to you! From simple tone shaping using only a couple effects, to interconnected combinations of pedals and eurorack modulation madness, the Transmutron is just the tool you need to reactivate your effects! \nAdditional Features:\n\n+10dB pre-FX gain per channel \nMix output or individual output of each FX channel \nSolo cycle footswitch for channel isolation \nPhase inversion switch to reduce phasing and enhance stereo output \nHalf-normalled FX sends for buffered copies \n3.5mm FX loops switchable between pedal and eurorack levels\n\nTechnical Specs:\n\nPower: 9VDC negative center 2.1mm (psu not included)\nInput and FX Returns Impedance (1/4-in): 1Mohms\nOutput and FX Sends Impedance (1/4-in): 1kohms\nControl Voltage Input: -5V to 5V (10VPP)\nDimensions: 5.875 x 3.875 x 2.125 in\nWeight: 15.5 oz (440 g)\n\nwww.boredbrainmusic.com/transmutron",
    "hrid": "boredbrain-music-transmutron"
}