{
    "py/object": "mylib.pedal.Pedal",
    "id": "11461",
    "name": "Csidman",
    "image": "11461.b.jpg",
    "function": [
        "Delay",
        "Digital"
    ],
    "manufacturer": "Catalinbread",
    "current": "60 mA / 9 V / DC / Negative Center",
    "cost": "$199 Price in €",
    "width": 63,
    "height": 114,
    "details": "Delay - StutterINTRODUCTION\nyes, it’s digital. did I stutter?\nTHE STORY\nI see technology as the optimistic push through the limitations of existing paradigms: limitations in materials, processes, functionality, cost, and foresight. With each spearhead of technology, the limitations of incumbents are resolved. All too often, a slew of new issues are introduced that the marketplace is willing to overlook, at least for a short period of time. It isn’t too long before the marketplace demands better, and is willing to abandon the past and pay for the next-generation solution. Within a period of 125 years we’ve seen the evolution of recorded media go from wax cylinder phonograph, to tape, to digital.\nSomewhere along the way, creatives exploit and embrace the way that limitations of technologies impose themselves. Imposing their ways much like a collaborator would, a creative will often find themselves in a love/hate relationship that they can’t imagine living without. What is the reason that musicians still use tape-based echo devices in an age where digital is nearly technically “perfect”? Wow and flutter, limited fidelity, and distortion are the hallmarks of tape technology that were engineered out over time, but musicians still often prefer tape because it adds “character” to their sound. So I got to thinking, “What are the artifacts of other antiquated technologies that have merit in a musical context? If David Byrne can find a way to use Powerpoint in an artistic way, why can’t we create a pedal that intentionally embraces technological limitations that musicians haven’t widely utilized?”\nI was first introduced to glitch/stutter effects through that ridiculous Jonny Greenwood video a number of years ago.  For years in the back of my head I puzzled over an application for such musical cacophony. I mean it is an over the top freakout for peak climactic moments in a performance where the music seems that it cannot rave-up any further.\nCool, that’s a one trick pony, right? Well, not at all. It came together when I realized the potential for this sort of effect to dice up familiar gentle sounds, in an uncomfortable yet beautiful way. I was reminded of an effect my friend and guitarist Paul Rigby (Neko Case, Garth Hudson) asked me for, something that sounded and intermittent like broken cable. Having spent time listening to Paul play. The economy, restraint and subtlety that he plays with fits almost within the subconscious of music in such a way that when he’s not playing everything sounds naked and vacant. There’s  also something here for these applications…\nOK, glitch. I wondered if there was a cultural context for this sort of effect, something in history that would do this unintentionally… Something from the human experience, like the echo effect humans have experienced for eons when shouting in a canyon… Yup! One of the most frustrating experiences you may remember if you are old enough to have had one of those portable CD players that do not have pre-read buffers!!\nThe Portable CD player! There was a magical period of my youth where I could take select parts of my CD collection with me while I drove for hours around Japan. It was particularly profound because my soundtracks were carefully curated selections. All it required: a portable CD player, a stockpile of AA batteries, and a ⅛” to cassette rig. The problem was that my portable CD player didn’t have read-forward buffering; if I hit a bump, so did the seamless experience of my soundtrack. At the time, it was very frustrating to be interrupted right when the music was about to rock, but in hindsight, that frustration was of the sort that I would never experience again. I began to explore the possibilities of putting this frustration in a pedal. I put some Alva Noto & Ryuichi Sakamoto on and wrote the software for what would become the CSIDMAN.\nOVERVIEW\nThe first thing to keep in mind about the CSIDMAN is that it completely embraces and makes no apologies for the fact that it is digital (though it does have a 100% analog dry path). Digital is the CSIDMAN’s aesthetic: as a delay pedal, it strives to reproduce echoes as true to the input as possible without filtering. When you utilize its scratched disc, stuttery, and glitchy behaviors, it is pseudo-random, yet gives you a certain amount of “control” over the randomness.\nControls:\nTIME Controls the echo delay line’s delay time up to 725mS, as well as the rate of the glitch.\nMIX Gives you control over the wet/dry balance from 100% wet to 100% dry.\nFEED Controls the amount of feedback going back into the unit.\nCUTS (used in conjunction with the LATCH knob) controls the buffer memory length.\nLATCH controls the relative time in a cycle that the CSIDMAN is in a latching skipping state. When full counterclockwise, it doesn’t skip, allowing you to use the pedal as a traditional digital delay. When full clockwise, the unit is stuck repeating whatever is in the buffer memory. At noon, this knob is a 50/50 balance (though random) between a skip-playback state and non-skip sample state.\nEXPERIENCE\nFor skipping CD behaviors:\nMIX full clockwise\nFEED full counter-clockwise, though turning it up creates cool overloading effects that responds to playing dynamics.\nTIME to taste\nCUTS above noon\nLATCH above noon\nFor an “ambient collaborator” behavior:\nMIX Noon or to taste.\nFEED anywhere turning it up creates cool overloading effects that responds to playing dynamics, but can run away regardless of MIX setting.\nTIME to taste, but I like starting from 9 to 12 O’clock\nCUTS just below noon\nLATCH noonish\nFor a traditional digital delay set up:\nSet your LATCH knob full counter-clockwise, ignore the CUTS knob, and use your TIME, MIX, FEED knobs for the desired sound as you would a traditional delay.\nCREDITS\nCircuit Design/Audio Engineer – Howard Gee\nDSP Engineer/Concept – Nicholas Harris\nPhotography/Videography – Jessica Liu\nArtwork – David Medel Weirdbeard72\nhttps://catalinbread.com/products/csidman",
    "hrid": "catalinbread-csidman"
}