{
    "py/object": "mylib.pedal.Pedal",
    "id": "11738",
    "name": "Bicycle Delay",
    "image": "11738.b.jpg",
    "function": [
        "Delay"
    ],
    "manufacturer": "Catalinbread",
    "current": "50 mA / 9 V / DC / Negative Center",
    "cost": "$199 Price in €",
    "width": 63,
    "height": 114,
    "details": "Acid DelayINTRODUCTION\nThe nature of the experience depends almost entirely on set and setting\nTHE STORY\nThe Bicycle Delay was something like an “Albert Hoffman moment” (to quote a good friend and guitarist Neal Casal). I sat down with no plan of where I was going but to allow myself the freedom to be open to wherever the journey took me and just document the experience. Really a strange path to travel when it involves something as cerebral as programming software. Or maybe it’s not. Maybe that’s a pure form of creativity, to use the boundaries something so matter of fact as programming as a medium for art? The result was a pedal as autobiographical as any I have been involved in. The Bicycle Delay is a physical manifestation of the experience of consciousness, letting go of the desire to control everything, and maintaining a positive attitude to leave room for a positive experience.\nThe more time I spent with the Bicycle Delay the more it unfolded its complexities to me. The harder I thought about what it was doing, the more difficult it was to put my finger on it. The more that I surrendered to what it was showing me, the more it set me free to be musically creative. In much the same way it took a computer to visualize a Mandelbrot Set, it took the Bicycle Delay for me to find the organic beauty in disharmony.\nOVERVIEW\nThe way pedal behaves is also metaphoric to how I’ve been looking at life. Approach it from a negative perspective, go ahead, make it spiral downward. There is beauty in it, like there is enjoyment in picking at a scab. It’ll take you to darker musical places fitting for the vampires at night. It all depends on your mood. Bring it up, it wants to take off. Happiness in a madhouse. The most difficult and interesting stuff begins to happen when you keep it balanced. Edges of notes brighten radiantly to prominence, like the flora and fauna do when I walk Clemma in the early morning sun.\nThe Bicycle Delay is as organic as a computer growing from a tree. Sonically the pedal is ever changing, even turning the knobs has an amorphous behavior. Go with it.\nEXPERIENCE\nPlug your instrument into the Bicycle Delay and directly into your amplifier. Set all knobs to noon, clear yourself mentally and, for a time, destroy all notions of control. Listen to what the Bicycle Delay has to say. Approach each knob with an open mind. Take note of how they interact with each other and you. One knob at a time, be mindful of where the Bicycle Delay is taking you.\nLUCIDITY\nYin and Yang. There is a balance. The weight of each side is symbiotic and ever changing.\nREFLECT\nAmplifies the reflections of sounds being generated.\nMOOD\nTailspin or ascending a thermal? Sometimes it’s hard to tell. Even at the center there is chaos in the tranquility. Embrace it.\nEXPANSE\nWhere is the focus? Inward, close at hand? Or gazing outward at a far away horizon in the mind’s eye? Somewhere in between? Your journey can be as short or as long as you care to make it. Take your time\nSpeak and listen. There is opportunity and consequence to what you bring to the conversation. The quiet voice brings calm, reasoned responses; the bombastic can incite a strong reaction you did not anticipate. Many voices create a cacophony, the lone voice is heard clearly. Each can foster harmony or discord depending on what is being communicated. But always listen…\nCREDITS\nCircuit Design/Audio Engineer – Howard Gee\nDSP Engineer/Concept – Nicholas Harris\nPhotography/Videography – Jessica Liu\nArtwork – David Medel Weirdbeard72\nhttps://catalinbread.com/products/bicycle-delay",
    "hrid": "catalinbread-bicycle-delay"
}