{
    "py/object": "mylib.pedal.Pedal",
    "id": "11458",
    "name": "Belle Epoch",
    "image": "images/catalinbread-belle-epoch.jpg",
    "function": [
        "Delay"
    ],
    "manufacturer": "Catalinbread",
    "current": "60 mA / 9 V / DC / Negative Center",
    "cost": "$199 Price in €",
    "width": 63,
    "height": 114,
    "details": "Tape echoINTRODUCTION\nFaithful sonic recreation of the EP-3 tape echo. Yes, including the preamp.\n“The Catalinbread Belle Epoch is the closest thing to a real EP-3 that I’ve ever played.”– Eric Johnson\nTHE STORY\nThe Catalinbread Belle Epoch Tape Echo, has tape echo sounds so authentic you’d swear there was tape inside the pedal! Inspired by the Maestro Echoplex, EP-3 model, perhaps the most famous tape delay ever, the Belle Epoch features everything we love about the EP-3 in a small, maintenance free pedal format. We felt that a “tape echo” pedal was much more than just a standard digital delay with some “filtering” on the repeats. There are a lot of subtle and not-so-subtle traits of the Echoplex that needed to be implemented in order to be authentic. The preamp, the self-oscillation character, the ability to control the “record level” of the signal hitting “tape”, the wow and flutter, the way the repeats decay, the way the circuit interfaces with the amp and other pedals – all these things were important to get right. The original unit was used as a musical instrument unto itself and this is what we captured with the Belle Epoch.\nOVERVIEW\nPreamp – Famous for making your guitar sound better even when the echoes are turned off.\nQuality of repeats – The Echoplex was not necessarily “hi-fi”. As the echoes repeated, the signal got progressively degraded, losing low end and gaining a shiny, percussive top end with a bit of grit. The first repeat is strong and then it gets more and more diffused as it repeats. And in a well-tuned unit, you could dial in the repeats “Echo Sustain” so that it would float almost indefinitely, or cross the threshold to self-oscillation\nRecord level –  There’s a control on the EP-3 that sets how hard the tape gets hit. While this control was ostensibly used to optimize signal-to-noise ratio, set low it would give light and airy repeats and set high it would saturate the tape hard and give an awesome fat and grungy repeat tone.\nWow and flutter – We designed the Belle Epoch’s modulation control to simulate the daily mechanical irregularities inherent in original Echoplex units. This would typically include bumpy capstan wheels, uneven tape tension, uneven motor speed, humidity, and actual ghosts?\nHead drag – The original unit had a unique quality that when moving the delay time slider it took a moment to catch up to the adjustment, creating a Doppler like effect. The Belle Epoch reproduces this behavior while you turn the echo delay knob.\nEXPERIENCE\nTo get acquainted with your new Belle Epoch, let’s first plug it in by itself, without your other pedals. Start out with a clean sound from your amp. Set the Mix to noon, the Echo Sustain and Sway/Mod at minimum, and the delay time, Echo Delay, anywhere you like. Now play and try various settings on the Tone/Record Level knob. Notice when set low the repeat is very wispy and quiet and when set high it is very dense and loud with a bit of gritty distortion. You’ll come to appreciate this control the more you get to know your Belle Epoch. You can set your echoes for background ambience or you can set them to be loud, punchy, and in your face. This is much more effective than a simple traditional “tone” knob and is exclusive to the Belle Epoch. Now explore the Echo Sustain knob. In the rst half of its rotation, you’ll get a xed number of repeats with a perfect decay. Then around 1:00 to 2:00 you can dial it in so that the repeats go on almost indefinitely without building up. Beyond that point and you’ve entered the self-oscillation zone! Now start twisting the Echo Delay knob to really start having some fun. But beware! It might get loud! Turn the Mix control down to avoid exploding your amp or to avoid getting an eviction notice! Now dial in a bit of Sway/Mod and listen to the random tape warble on the echoes. A little dab will do ya with this control! Try setting the Mix control all the way down so you only hear the dry signal and compare the sound and touch-sensitivity with the pedal on and o. You may decide you always want it on! You can turn the Mix control all the way up to hear the echo signal only too. This may be all you need to get up and running but do come back and read the rest of this guide to get more insight into the fabulous Belle Epoch!\nCREDITS\nCircuit Design/Concept/Audio Engineer – Howard Gee\nDSP Engineer – Boris Lutskovsky\nPhotography – Evrim Icoz Evrim Icoz Photography\nPCB Layout – Jack Pineda Mr. Black Pedals\nVideography – Jessica Liu\nArtwork – David Medel Weirdbeard72\nhttps://catalinbread.com/products/belle-epoch",
    "hrid": "catalinbread-belle-epoch"
}