{
    "py/object": "mylib.pedal.Pedal",
    "id": "32982",
    "name": "Viberator",
    "image": "images/dawner-prince-electronics-viberator.jpg",
    "function": [
        "Phase Shifter",
        "Rotary"
    ],
    "manufacturer": "Dawner Prince Electronics",
    "current": "75 mA / 9 V / DC / Negative Center",
    "cost": "$299 Price in €",
    "width": 58,
    "height": 112,
    "details": "Premium, stereo version of the vintage, Uni-Vibe® type phase shifter with a number of modern options.Intensity\nControl adjusts the thickness and throb of the vibe (chorus) effect from subtle waving all the way to a deep and strong «heart-beat» like warble. In vibrato mode it adjusts the amount of pitch de-tuning effect.\nSpeed\nControl adjusts the rate of the pulsations of the vibe (chorus) or vibrato effect. Viberator has an extended speed range in comparison with the original Uni-Vibe and is customized to deliver balanced rotary tones even on maximum speed setting.\nShape\nControl modifies the waveform that drives internal light bulb. From perfectly symmetrical sine wave in middle pot position to distorted waveforms in either end positions, this controls is unique and provides various sound effects from true vintage vibe to a new and interesting phaser sounds.\nChorus / Vibrato switch\nSelects between classic Uni-Vibe chorus and de-tuning pitch bend vibrato mode.\nVintage / Modern switch & Bright trimmer\nVintage mode engages original Uni-Vibe input circuitry resulting in a warm and slightly darker tone, while Modern mode engages input FET buffer, resulting in a more brighter overral tone. The brightness in Modern mode can be further adjusted with Bright side trimmer. This control is very useful as it allows the pedal to be matched with any amplifier and /or guitar pickups.\nMono/Stereo outputs\nViberator is the most compact vibe pedal with true stereo outputs for real 3D, rotating speaker sound. When in Chorus mode, signal at stereo output is a 'mirror image' of the signal at mono output.\nVolume controls\nWe have added separate volume controls on output channels for even more versatility. Output volume levels are slightly above unity gain with controls set fully clockwise.\nExp In\nThis input allows the speed of the effect to be controlled with an expression pedal. Viberator accepts any standard expression or volume pedals with 10K pot (e.g. Roland EV-5). Plugging in an expression pedal automatically disengages Viberator's Speed control potentiometer.\nGain & Offset\nGain and Offset control operation of the internal light bulb that illuminatates photocells and are used to set the right sweep and throb sound of the effect. Gain sets intensity range and Offset sets the balance of the sweep of the effect. These controls are factory preset.\nTrue Bypass / Bi-colour LED indicator\nViberator utilizes True Bypass switching system on both mono and stereo channel. Status LED flashes in time with the speed setting and lights yellow when the effect is bypassed or blue when the effect is engaged.\nPower\nViberator accepts standard 9V DC on the input which is internally converted and regulated to 15V DC (Uni-Vibe operating voltage) to assure plenty of headroom and dead silent operation. Viberator also utilizes internal reverse power polarity protection circuitry.\nTECHNICAL SPECIFICATIONS:\nPower Input Voltage: 9V DC\nPower input connector: 5.5mm / 2.1mm barrel connector (Center Negative)\nPower Consumption: ~ 75mA\nSize: 4.4” x 2.3”\nhttps://dawnerprince.com/products/viberator",
    "hrid": "dawner-prince-electronics-viberator"
}