{
    "py/object": "mylib.pedal.Pedal",
    "id": "20413",
    "name": "Diezel Herbert Distortion Pedal",
    "image": "images/diezel-diezel-herbert-distortion-pedal.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Diezel",
    "current": "? mA / ? V / AC/DC",
    "cost": "$299 Price in €",
    "width": 177,
    "height": 212,
    "details": "The Power of the Herbert on Your BoardPower, articulation, and gain are all words that define Diezel Amplification's flagship all-tube amp head, the Herbert. Today you can have all of that performance in the pedalboard-friendly enclosure of the Diezel Herbert Pedal. Crafted after the exact preamp section found in the amp, the Herbert pedal puts the same tone and response in a much more manageable package. Not only will you find the controls and tone are replicated with precision, but you're even able to control the pedal's trademark Midcut circuit with the tap of your toe. Whether you use it as a preamp or distortion pedal, it's never been easier to get Diezel tones than it is with the Herbert Pedal.\nIconic metal amp in a pedal\nThe Diezel Herbert is the most powerful and potent amplifier in the Diezel line up. Its punch, savage gain, and ability to remain tight throughout the range of its controls have made it the go-to high-gain amp for players and studios all over the world. While the Herbert is capable of crystal cleans, it's the amp's more aggressive personality that is covered in the Herbert Pedal. Gravitating somewhere between channels two and three on the amp, this pedal delivers the same startling high-gain intensity and grinding detail of its namesake amplifier.\nAmp-like control over your tone\nAt the heart of the Herbert pedal's character is its Deep (resonance) control. Active in the final output stage of the pedal, the Deep knob allows you to fine-tune your tone's low-end punch in a way you can't achieve with traditional EQ or tone controls. The Presence control helps you find just the right amount of bite to cut through a mix without making your signal too harsh. But the real magic lies in the pedal's footswitchable Midcut circuit — just like the amp — that allows you to switch in a variable tonal shift to your sound on the fly.\nDistortion pedal and a preamp in one\nOne way the Diezel Herbert pedal stands above other high-gain pedals is in its ability to be used as a fully independent preamp. Run your guitar into the Diezel Herbert pedal, then into either your amp's effects loop input — or even directly into a stand-alone power amp — then to a speaker cabinet. You'll be enjoying the authentic Diezel tones as they were intended. But if you decide to run a more traditional pedal setup into your amp's clean channel, you'll find the Herbert pedal works equally well for delivering it's dominating tones.\nDiezel Herbert Distortion Pedal Features:\nDistortion pedal for electric guitar, based on the Diezel Herbert tube amplifier\nHard-rock to searing high-gain tones\nFootswitchable Midcut circuit taken directly from the Herbert amplifier head\nShape your tone with Bass, Middle, Treble, and Gain controls\nFine-tune low-end girth and resonance with the Deep knob\nPower Amp Output offers a line-level signal for direct connection to your power amp input (effects loop return)\nDial in just the right amount of bite with the Presence control\nPremium construction with lightweight metal chassis and discrete circuitry\nIncludes universal 12-volt DC power supply with international adapters\nhttps://www.sweetwater.com/store/detail/HerbertPedal--diezel-herbert-distortion-pedal",
    "hrid": "diezel-diezel-herbert-distortion-pedal"
}