{
    "py/object": "mylib.pedal.Pedal",
    "id": "25449",
    "name": "Element XP",
    "image": "images/digitech-element-xp.jpg",
    "function": [
        "Multieffect"
    ],
    "manufacturer": "Digitech",
    "current": "175 mA / 9 V / DC / Negative Center",
    "cost": "$110 Price in €",
    "width": 203,
    "height": 159,
    "details": "Guitar Multi-Effects Processor with Expression PedalYour journey to create the perfect guitar tone starts with the new DigiTech Element XP guitar multi-effect pedal. The Element XP gives guitar players everything they need to explore guitar tones and discover their own sound. The DigiTech Element XP has 37 different pedals, 12 amps, and 9 speaker cabinets to choose from, a guitar tuner, and dedicated headphone jack so you can play all night long without waking the neighbors. Every Element XP comes with a power supply so you won’t have to waste your money on batteries. With 100 factory presets to build from, you can create and save up to 100 more custom presets as you go. Kick on one of the undefined different drum tracks to play to jam to, with the touch of a button. The Element XP is a compact and powerful multi-effect processor. Using a simple pedalboard style layout and editor you can quickly adjust the settings to fit your style. With more the undefined different effects to choose from, the hours flying by as you explore and discover the incredible power and tone of the Element XP. The Tone Banks and FX Bank each have 20 different tone and effects combinations so you can quickly and easily get any sound you want. It's like having a music store at your disposal. When you need some drums to play along with, choose from one of the undefined different drum and rhythm tracks. You can set the tempo to match you. The expression pedal makes your performance more dynamic. Use it to control a Whammy™, wahs, or volume in real-time. Kick up the volume for your solo and back it off for the verse to keep. The Element XP features 1/4\" a guitar input along with stereo 1/4\" output jack that can be connected to either an amplifier or mixer for direct recording with a press of the Amp/Mixer mode that engages the internal speaker cabinets for direct recording. The Element XP has a dedicated headphone jack for practicing purposes and an Aux In to jam along with your favorite songs.\nhttps://www.digitech.com/ELMTXPV-01.html#audio_demos",
    "hrid": "digitech-element-xp"
}