{
    "py/object": "mylib.pedal.Pedal",
    "id": "17733",
    "name": "RP500",
    "image": "images/digitech-rp500.jpg",
    "function": [
        "Modeling/Simulation",
        "Multieffect"
    ],
    "manufacturer": "Digitech",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 495,
    "height": 222,
    "details": "Multi-FX Amp/Cab Modeler and USB InterfacePowerful Modeling FX for Your Guitar Rig or Studio\nDigiTech's RP500 is the newest member of DigiTech's acclaimed RP Modeling Pedal line, boasting even more models, effects, and performance-friendly features sure to make it the center of your guitar rig! A new Pedalboard mode makes the RP500 act like 5 separate stompboxes and effects, and a bypass mode lets you easily turn off all amp and cabinet sounds so you can focus on effects only. Built like a tank with 9 vaccum-style switches, and a convenient 10-character LED display, you also get a built-in expression pedal to take control of your sound. Packed with pro-rig sounds in one portable, affordable box, you won't believe how you ever played without your DigiTech RP500!\nDigiTech RP500 at a Glance:\nEven more models and effects\nNew Pedalboard Mode\nAmp/Cabinet Bypass Mode\nReady-to-record via USB\nEven more models and effects\nBoasting even more effects, as well as a host of new amp and cabinet models - including acoustic guitar models - the RP500 is a palette loaded with sonic colors designed expressly to inspire your creativity.\nNew \"Pedalboard\" Mode\nDigiTech's RP500 includes a new Pedalboard mode. When activated, you can turn five effects on and off via the RP500's convenient footswitches. Acting like a complete pedalboard in one convenient unit (with only one AC adapter!), you can get your signature sound in a pinch with the RP500 - no more need to haul all of your gear to and from rehearsals.\nAmp/Cabinet Bypass Mode\nIf you're content with the sound of your amp, but want a ton of effects to boost your current pedal setup, the RP500 now features an amp/cabinet bypass mode. When used in tandem with Pedalboard mode, you can focus only on turning effects on and off, using the built-in expression pedal for dynamic, real-time control.\nReady-to-record via USB\nWhether you have a home studio setup already, or you're a guitarist who would love to capture your riffs and song ideas - without having to spend a ton on studio gear - the RP500 is ideal for you. All you need is a computer with an available USB connection and a USB cable, and you can start recording and editing your songideas right away using the RP500's included Cubase LE software. Plus, the RP500 also comes with X-Edit Editor/Librarian software for both Mac and PC. Via that same handy USB connection, you can actually program and archive all of your presets via the software's intuitive user interface and load them onto your RP500 whenever you want. With this versatile pedal's host of software options, you'll never have to worry about forgetting a riff or losing your favorite presets again!\nDigiTech RP500 Features:\nTons of amp and cabinet models, stompbox models and effects\n9 vacuum-style switches\nlarge, 10-charecter LED display\nBuilt-in Expression Pedal\nPedalboard mode for switching between 5 effects\nAmp/Cabinet Bypass Mode\nUSB Connectivity\nComes with Cubase LE Software\nIncludes X-Edit Editor/Librarian Software for programming/archiving presets\nTap Tempo\nTuner\n24-bit A/D and D/A Converter / 44.1kHz\n1 Audio DNA2 DSP Processors\n99 User presets / 99 Factory presets\nUSB 2.0 - requires USB cable, not included\nHeadphone outputs\n19.5\" W x 2.25\" H x 8.75\" D\nMinimum Windows Requirements: Vista Home/Premium XP Home/Professional (SP2 Installed, .Net 2.0 installed), Pentium/Athlon 1.4GHz or later, 512MB RAM (1GB recommended), 180MB hard disk space, DVD-ROM drive, USB port, Internet connection for Cubase activation\nMinimum Mac Requirements: OS 10.4x or later, PowerPC G4/G5 1GHz or later, 512MB RAM (1GB recommended), 180MB hard disk space, DVD-ROM drive, USB port, Internet connection for Cubase activation\nhttps://digitech.com/en/products/rp500",
    "hrid": "digitech-rp500"
}