{
    "py/object": "mylib.pedal.Pedal",
    "id": "17266",
    "name": "micro.clock",
    "image": "images/disaster-area-micro.clock.jpg",
    "function": [
        "MIDI",
        "Utility"
    ],
    "manufacturer": "Disaster Area",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 45,
    "height": 98,
    "details": "Tap Tempo ControllerThe Disaster Area micro.clock is an intelligent tap tempo and clock source for your pedalboard.  Synchronize two tap-tempo compatible pedals plus control one additional device with tap tempo, MIDI, or control voltage.\nThe micro.clock leverages our advanced SMARTClock technology in a tiny package – just 3.6″ x 1.5″ x 1.6″ (93 x 38 x 42mm.)\nTap the footswitch to set the master clock tempo.  The micro.clock will then send taps to your devices to lock them in to your music.\nSelectable subdivisions let you tap in quarter-notes and set your devices to dotted-eighths, eight-notes, or triplets!\nTap the knob to view or change the subdivisions or output settings for each output, then hold the knob to save the current settings to a preset.\nHold the footswitch down to advance to the next preset.  You can even set the number of accessible presets so that you only use what you need.\nEach tempo preset allows you to specify a tempo in BPM or milliseconds, as well as subdivisions or toggle settings for each of the three outputs.  You can also set the micro.clock to send a MIDI Program Change to an external MIDI device.\nHave a pedal that needs an odd or unusual configuration for tempo control?  The micro.clock works with devices that accept a normally-open or normally-closed footswitch, and can even send 0-3.3V control voltage that works with pedals with expression control of delay / tempo.  Check with your pedal builder for details on their expression options!\nFeatures\nBlue LED display shows tempo in Beats Per Minute or milliseconds.\nTwo (2) isolated optical relay powered Tempo Outputs or Function Switch Outputs.\nOne MultiJack connectors can function as Tempo Outputs, Function Switch Outputs, Control Voltage Output (0-3.3V,) Footswitch Inputs, or MIDI Outputs.\nMIDI Clock output synchronizes a connected MIDI device\nMulti-Jack functions as tap tempo input, Control Voltage Output, third Tempo Output, or additional MIDI output (requires adaptor cables.)\nInternal DIP switches to customize each output.\nTap Tempo mode with selectable tap subdivisions for each output.\nUp to 99 user-accessible presets.\nReceives external MIDI clock from a computer or other device, Tempo Outputs sync to incoming clock.\nSends tap signals and clock from 30-240 beats per minute.\nAvailable subdivisions include Quarter, Dotted Eighth, Quarter Triplet, and Eighth Notes\nRuns on standard 9V power, 60mA minimum.\nCompatibility – Tap Outputs\nThe SMARTClock Gen3 is compatible with virtually every pedal or effects unit equipped with a remote tap tempo input jack.  In toggle mode, the SMARTClock outputs can work as a “fixed expression” control with many devices.  Please note that some devices may require the use of a TRS / stereo cable or to have the SMARTClock’s pull-up resistors enabled for certain functions.\nAlexander – Tap:  History Lesson, Super Radical, Oblivion, Radical Delay ][+, Chesapeake, Equilibrium DLX\nAlexander – *Favorite:  Super Radical, Oblivion, Radical Delay ][+, History Lesson, F.13 Neo, Syntax Error\nBOSS  – Tap DD-500, RV-500, MD-500, SY-300, DD-5, DD-7, DD-20, PH-3, AW-3 (requires connected output set to normally closed.)\nCatalinbread – Semaphore, Belle Epoch Deluxe (uses Control Voltage mode)\nChase Bliss – Tap All pedals except Brothers\nChase Bliss – Favorite All pedals\nCusack – Tap-A-Whirl, Tap-A-Delay, Tap-A-Phase, Tap-A-Scream, more.  (requires 1/4″ to RCA cable)\nDisaster Area – Gen2 (DMC-3XL, DMC-4, DMC-6D, DMC-8D, DMC-7, DMC-6L, DPC-5) and Gen3 (DMC-3XL, DMC-4, DMC-6, DMC-8, DPC-5, NNB)\nElectro-Harmonix – Tap: Deluxe Memory Man with Tap 1100 / 550, Super Pulsar\nElectro-Harmonix – Expression:  HOG2, Pitch Fork, Cock Fight, more\nEventide – H9, Timefactor, Modfactor, Pitchfactor, Space\nJHS – Panther, Panther Cub, Emperor, Unicorn, Pink Panther\nLine 6 – *Favorite / Expression:  AM-4, DL-4, DM-4, MM-4, M5, M9, M13.  Not compatible for tap tempo with Line 6.\nMatthews Effects – Conductor\nMXR – Echoplex Delay, Carbon Copy Deluxe\nStrymon  – Tap:  Timeline, Mobius, BigSky, Flint*, Deco*, Dig*\nStrymon  – *Favorite:   Brigadier, Deco, DIG, El Capistan, Flint, Lex, Riverside, Sunset\nWalrus Audio – Tap:  Bellwether, ARP-87\nWalrus Audio – *Favorite:  Vanguard, Descent (use expression pedal input)\n*Most pedals require TRS cable and pull-up resistor enabled for favorite or expression control.  Some Strymon products require TRS cable and pull-up resistor for tap tempo.\nCompatibility – MIDI Clock\nAlexander – Oblivion, Super Radical, Quadrant\nBoss – DD-500, SL-20 Slicer\nChase Bliss – All pedals except Brothers\nEventide – H9, Timefactor, Modfactor, Pitchfactor, Space\nElectro-Harmonix – 8-Step Program\nLine 6 – M5, M9, M13, more\nMeris – OttoBit Jr., Polymoon\nMoog – MF-104M Delay, MF-104MSD Super Delay, MF-105M MIDI MurF, MF-108M Cluster Flux\nPigtronix – Echolution 2 (including Deluxe and Filter / Filter Pro,) Infinity\nSource Audio – Orbital, Manta, Stingray, Gemini, Lunar, Mercury (All require use of Soundblox or Neuro Hub,) Nemesis Delay, Reflex\nStrymon – Timeline, Mobius, BigSky\nTC Electronic – Flashback X4, Alter Ego X4, Flashback Triple Delay, Ditto X4,\nZ-Vex – Super Seek-Trem, Super Ringtone, Super Seek-Wah",
    "hrid": "disaster-area-micro.clock"
}