{
    "py/object": "mylib.pedal.Pedal",
    "id": "28256",
    "name": "MIDI Box 4",
    "image": "images/disaster-area-midi-box-4.jpg",
    "function": [
        "MIDI",
        "Utility"
    ],
    "manufacturer": "Disaster Area",
    "current": "50 mA / 9 V / DC / Negative Center",
    "cost": "$69 Price in €",
    "width": 112,
    "height": 75,
    "details": "5 pin DIN to TRS MIDI ConverterUpdated and more powerful than ever, the MIDI Box 4 converts standard 5-pin (DIN) MIDI communications to a variety of 1/4″ formats.\nFour independent control ports interface to your devices, and new user-accessible configuration switches make setup easier than ever.\nEach control port may be set to one of four output modes, selectable using the DIP switches on the face of the MIDI Box 4.\nTip Active:. Suits Alexander, Meris, Empress, Bondi, and other devices using voltage mode on the jack tip\nRing Active:  Suits Chase Bliss Audio and other devices using voltage mode on the jack ring\nTip and Ring Active:  Provides separate outputs on tip and ring of the control port, enabling two MIDI outputs using our TRS Insert Cable\nTRS MIDI:  Sets the tip active and pulls the ring terminal high, for use with Boss, Jackson, Cooper, Swindler and other devices that conform to the MIDI TRS specification.  Also works with our MJ-5P MultiJack to MIDI cable to provide additional standard MIDI outputs from the MIDI Box 4.\nPower:  Requires 9-12v DC input, 50mA maximum.\nStatus LED:  Lights blue when powered, blinks red when MIDI data is received.  Constant high-speed MIDI data such as MIDI Clock may cause the LED to remain violet.\nMIDI THRU:  Dedicated hardware MIDI Thru, repeats any MIDI data received to send to your other MIDI devices.  You can chain multiple MIDI Box 4 units by linking the MIDI THRU from the first box to the MIDI IN of the next and so on.\nDimensions: 4.4 in x 2.38 in x 1.06 in (112 mm x 60 mm x 27 mm) not including jack nuts.\nSupported Devices:\nChase Bliss Audio:  All current pedals.  Connect with TRS cable, set port to RING ACTIVE.\nBlooper\nBrothers\nCondor\nDark World\nGravitas\nMOOD\nSpectre (all versions)\nThermae\nTonal Recall (blue and RKM)\nWarped Vinyl Mk1 (supports MIDI clock only)\nWarped Vinyl Mk2 and HiFi\nWombtone Mk1 (supports MIDI clock only)\nWombtone Mk2\nAlexander Pedals:  All Neo Series pedals.  Connect with mono / TS cable.  Set port to TIP ACTIVE.\nColour Theory\nDefender\nF.13 Neo\nMarshmallow\nQuadrant\nRadical Delay DX\nSky 5000\nSpace Race\nSuper Neo-Matic\nSuperball\nSyntax Error\nWavelength\nEmpress Effects:  Connect with mono / TS cable.  Set port to TIP ACTIVE.\nEchosystem\nPhaser\nTremolo 2\nReverb\nZOIA\nMeris: All current pedals.  Connect with mono / TS cable.  Set port to TIP ACTIVE.\nEnzo\nHedra\nMercury 7\nOttobit Jr\nPolymoon\nBondi Effects:  Connect with mono / TS cable.  Set port to TIP ACTIVE.\nArt Van Delay\nBoss:  All 200-series pedals with 1/8″ MIDI jacks.  Use TRS / stereo cable.  Set port to TRS MIDI.\nDD-200\nOD-200\nEQ-200\nMD-200\nJackson Audio:  All MIDI-compatible pedals.  Use TRS / stereo cable.  Set port to TRS MIDI.\nGolden Boy\nBroken Arrow v2\nBloom v2\nSwindler Effects:  All MIDI-compatible pedals.  Use TRS / stereo cable.  Set port to TRS MIDI.\nThe Gulf v2\nRed Mountain v2\nCooper FX:  All MIDI-compatible pedals.  Use TRS / stereo cable.  Set port to TRS MIDI.\nOutward v2\nArcades\nNeunaber Effects:  MIDI-compatible pedals with 1/8″ TRS jacks.  Use  TRS / stereo cable.  Set port to TRS MIDI.\nNeuron\nPlease note that device support also requires a compatible MIDI controller.  The MIDIBox is a data converter only, and won’t magically make your controller work with these devices.  If you’re not sure about controller support, contact your controller manufacturer!\nhttps://www.disasterareaamps.com/shop/midi-box-4",
    "hrid": "disaster-area-midi-box-4"
}