{
    "py/object": "mylib.pedal.Pedal",
    "id": "13666",
    "name": "Sunny Day Delay",
    "image": "images/dr-scientist-sunny-day-delay.jpg",
    "function": [
        "Chorus",
        "Delay"
    ],
    "manufacturer": "Dr Scientist",
    "current": "? mA / ? V / AC/DC",
    "cost": "$249 Price in €",
    "width": 90,
    "height": 120,
    "details": "Delay and ChorusDR SCIENTIST SUNNY DAY DELAY.\nOh those sunny days... you know the ones... you wish they could go on... and on... and on... and on... and on... andonandonandonandon...and on and on and on... well, you know, you wish they could repeat in lots of cool ways!\nIt's a good thing for you that Dr. Scientist Sounds has had a team of Time-Space Engineeronauts locked away in a neat time-space... facility... studying, harnessing, and mastering, the power of delay... delay... delay... delay... special for you! And because those guys we've got sealed up miss the outdoors so much, Dr. Scientist thought it would be nice to call it... the SUNNY DAY DELAY!\nFirst things first, the Sunny Day Delay is an analog-sounding delay. That means it uses a digital processor but in a way that sounds warm and interesting and dynamic! Each repeat is sonically different from the one before it, with less treble and bass and more noise or grit... but good noise or grit... the kind that sounds pleasantly analog!\nSecond things second, the Sunny Day Delay has some pretty cool tricks up its sleeve. How about endless repeats? How about just one, single repeat? Maybe a chorus effect on the repeats? Howsabout a half second (500ms)of warm, dreamy repeats? Maybe you prefer super fast, warbly chorus repeats? Well, yeah, it can do all that stuff... and it won't alter your guitar tone in any while doing that stuff... but now consider the fact that it doesn't even have arms or sleeves at all and we think you'll be pretty impressed.\nWith controls for delay rate (0 milliseconds to 500 milliseconds), number of repeats (1 single repeat to all the repeats ever, infinite repeats), volume of repeats (no repeats audible to repeats same level as dry guitar), and a switch-able chorus effect with rate control (very slow warble to very fast warble) for the repeats only, the Dr. Scientist Delaygents guarantee the SUNNY DAY DELAY to offer a near endless variety of wildly cool delay sounds! Sounds! Sounds! Sounds! Sounds!\nMore, more, more, more, more... interesting info:\nSDDs sound big... super big... fill up your whole world with sound kinda big... but they measure only 9cm wide by 12cm long by 5cm tall, depending on the knobs. Are you safe from high pressure sonic 'splosions due to all that confined sound if you take the back off to change a battery or something? Nope, not really.\nSDDs weigh only a pound but their sweet delay tones can put a smile on the face of anyone, no matter how heavy they might be. (Up to 2500kg.)\nCreating delays makes for a hearty appetite... SDDs require regulated 9VDC using the standard BOSS style 2.1mm center negative plug or a 9Volt battery. As SDDs contain complicated digital processors with complicated digital appetites for batteries, we recommend using a power supply.\nSDDs are true bypass, truly sweet and pleasant sounding, and truly hand finished and hand assembled.\nSPECIAL NOTE ABOUT DR. SCIENTIST PEDALS:\nDr. Scientist randomly designs the graphics of each pedal on an individual basis. Each batch of pedals and shipment we get contain different designs. Therefore the pedal you order may differ in graphics from the one shown above. Click HERE to see examples of the Sunny Day Delay.",
    "hrid": "dr-scientist-sunny-day-delay"
}