{
    "py/object": "mylib.pedal.Pedal",
    "id": "18282",
    "name": "Joe Bonamassa Fuzz Face Mini",
    "image": "images/dunlop-joe-bonamassa-fuzz-face-mini.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Dunlop",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 89,
    "height": 89,
    "details": "Do you want Joe's tone without have to break the bank for a new amp stack and signature guitar? Well now you can get one step closer to achieving that world-renowned Bonamassa tone with the Dunlop Joe Bonamassa Fuzz Face Mini Pedal!\nWe all recognise the sheer intensity, yet simple elegance of Joe Bonamassa's signature tone. Full of punch and response, with an electrifying energy, it's no wonder so many have tried to copy and clone his sound for so long. The Joe Bonamassa Mini Fuzz Face Pedal from Dunlop takes you to the next level of creating Joe's awesome tone, giving you plenty of rich, full-sounding fuzz, thicker than any drummer you'll meet! (Dsiclaimer: Andertons would like to add that we love all drummers and that none were hurt in the writing of this product page.. not that they can read this anyway!)\nDeveloped specifically to produce the sought-after voicings of Joe Bonamassa's humbucker-driven tone, you'll be blown away by how this True Bypass pedal can transform your tone into something instantly recognisable! Rich, creamy fuzz is ready at the tap of your toe, full of incredible depth and sustain, all working in perfect harmony to produce a unique guitar tone that has been copied for years!\nSmall pedal... MASSIVE sound!\nThis pedal really does sound massive, which actually contradicts its teeny tiny dimensions. Not only does this help you when it comes to using it live, there's no confusing dials or multiple buttons to distract you, it's simple press down and GO, but it also means that your guitar rig is being kept to a minimal size, making transportation and set-up a much easier experience for you or if you're lucky.. your roadie!\nGo on, plug it in and see for yourself, just don't be surprised if people rush over to your gig venue expecting to see a bloke with a cool side parting and sunglasses, we warned you!\nKey Features:\nVoiced specifically for Joe's humbucker-driven tone\nFull of sustain rich, creamy fuzz.\nTrue bypass and now ROHS compliant.\nPedalboard friendly size\nTrue Bypass\nNOS Russion Germanium Transistors",
    "hrid": "dunlop-joe-bonamassa-fuzz-face-mini"
}