{
    "py/object": "mylib.pedal.Pedal",
    "id": "13350",
    "name": "Data Corrupter",
    "image": "images/earthquaker-devices-data-corrupter.jpg",
    "function": [
        "Pitch Shifter",
        "Synth Voice"
    ],
    "manufacturer": "EarthQuaker Devices",
    "current": "26 mA / 9 V / DC / Negative Center",
    "cost": "$229 Price in €",
    "width": 118,
    "height": 144,
    "details": "Monophonic PLL-Based HarmonizerData Corrupter™\nModulated Monophonic Harmonizing PLL\nOkay Brainiac, it’s time to put down that graphing calculator and get to work decoding your brand new Data Corrupter!\nThe Data Corrupter is a monophonic analog harmonizing PLL with modulation. It takes your input signal and brutally amplifies it into a crushing square wave fuzz tone that is then multiplied, divided and modulated to create a wild, yet repeatable, three-voice guitar synthesizer.\nThe Master Oscillator is the central nervous system at the heart of the Data Corrupter’s cyberpunk hive mind. The three-position switch on the Master Oscillator control panel labeled Root feeds your input to the Data Corrupter’s signal harvester in its original octave (Unison), one octave down (-1) or two octaves down (-2). Use the Master Oscillator’s Root switch to fine tune the Data Corrupter’s tracking response for maximum compatibility with your preferred instrument and frequency register. Once you’ve chosen your input octave, the Data Corrupter will perform its calculations and spit out a synthesized frequency, the octave and/or interval of which may be selected via the Master Oscillator’s eight-position rotary switch. The Voice Mixer’s Oscillator control adjusts the Master Oscillator blend.\nThe Frequency Modulator applies pitch-bend modulation to the Master Oscillator. In Glide mode, you’ll hear a smooth portamento as each note slides into the next. In Vibrato mode the pitch modulates up and down for a retro sci-fi laser effect.\nThe Subharmonic assimilates the input signal into one of eight lower octave programs between one and three octaves below the original. For a more stable lower octave, set the Subharmonic’s Root switch to the Unison position, which divides the Square Wave input signal, and removes the Frequency Modulator from the Subharmonic signal path. To unleash the cracked machine lurking within the Data Corrupter mainframe, set the Subharmonic Root switch to Oscillator and try not to look away as the sonic malware you just installed mangles your input signal into the sum and difference of both the Master Oscillator and Subharmonic with the Frequency Modulator applied to the upper and lower octaves. If you think you’re brave enough, set the Subharmonic Root switch to Oscillator and try experimenting with different Master Oscillator and Subharmonic programs to wind up the doomsday clock and inch ever closer to the Singularity. Adjust the Voice Mixer’s Subharmonic control to set the lower octave volume.\nFinally, (or is it?) the Square control located top-left on the Voice Mixer blends in a fuzzed-out square-wave take of your input in its original octave. That’s it. These aren’t the droids we’re looking for. Move along.\nEach and every Data Corrupter is built one-at-a-time by a team of ensigns aboard the Starship Enterprise locked in orbit around the Borg Cube of Akron, Ohio, USA. Make it so. Engage.\nList Price: $229.00\nControls\nNerd Talk\nThe heart of this pedal is based around a CMOS Phase Locked Loop (PLL) IC. In a nutshell, the PLL takes your input signal and compares its phase and frequency against an oscillator, generates an output proportional to their difference then feeds it back to the oscillator. This then causes the oscillator to lock onto the input signal and generate a synthesized frequency. Pretty cool, right? This synthesized frequency is referred to as the Master Oscillator on the Data Corrupter.\nMaster Oscillator\nThe Master Oscillator takes it’s input from one of three sources: Unison, one octave down and two octaves down. Some frequencies are too high for the Master Oscillator to divide, therefore, shifting them down one or two octaves brings them back into the proper range (it also happens to sound super cool). These sources are referred to as “Root” and can be selected via a three-position switch. The Root is then fed into the PLL and multiplied to create one of eight different intervals over three octaves that are selected by the rotary switch to create your harmony! This harmony can then be manipulated via the Frequency Modulator section.\nFrequency Modulator\nThe Frequency Modulator has two modes, Glide and Vibrato. In Glide mode, the pitch will glide from note to note and the speed of the glide can be adjusted by the Rate control. At faster settings, this takes on a very cool phase shifting effect. In Vibrato mode, the pitch varies up and down to create a laser-like effect. The Frequency Modulator only affects the Master Oscillator, unless the Subharmonic Root switch is in the Oscillator position.\nSubharmonic\nThe Subharmonic section of the Data Corrupter creates a sub octave of the Root and then divides it up into eight intervals over three octaves which are selected by the rotary switch to create your subharmonic harmony. The Root comes from one of two sources, Unison or the Master Oscillator. When Unison is selected, the Subharmonic will be a division of the square wave fuzz tone and the Frequency Modulator will have no effect. When Oscillator is selected, the Subharmonic will be a division of the Master Oscillator and the Frequency Modulator will be applied to the Subharmonic harmony.\nVoice Mixer and Level\nThe Master Oscillator, Subharmonic and Square wave fuzz tone all have volume controls under the voice mixer section. Use these to blend the three voices together to taste. The Level is a master volume and determines the overall output level of the effect.\nTracking\nThis pedal should be placed close to front of your signal chain and before any delay, reverb or modulation effect. While it will work with most bridge pickups, the neck pickup will provide the best tracking results. Precise picking and single notes will track quickly and cleanly. Chords and sloppy playing will result in chaos. There is no control over the amount of gain because it really needs to be fine-tuned to properly track. Weak signals (like backing off on the guitar volume) will lead to poor tracking and gating.\nDesign Notes\nThis Device takes its inspiration from the Electrax Synthax and the “Basic Frequency Synthesizer” by Ray Marston. Neither of these were really intended to be guitar effect pedals and a lot of work went into creating the Data Corrupter to provide excellent tracking and long sustain. We think you’ll find it more expressive and accurate than pretty much any other PLL based effect pedal around.\nhttps://www.earthquakerdevices.com/data-corrupter",
    "hrid": "earthquaker-devices-data-corrupter"
}