{
    "py/object": "mylib.pedal.Pedal",
    "id": "25640",
    "name": "Life Pedal V2",
    "image": "images/earthquaker-devices-life-pedal-v2.jpg",
    "function": [
        "PreAmp",
        "Distortion",
        "Pitch Shifter"
    ],
    "manufacturer": "EarthQuaker Devices",
    "current": "15 mA / 9 V / DC / Negative Center",
    "cost": "$333 Price in €",
    "width": 93,
    "height": 118,
    "details": "Octave Distortion + BoostSunn O))) and EarthQuaker Devices are pleased to bring you the compact, pedalboard-friendly version of the Life Pedal distortion. Limited to 2500 units worldwide, this is the same exact circuit as the WILDLY popular version that was released in early 2019 but with the addition of expression pedal control over the octave blend and Flexi-Switch® Technology on the relay-based true bypass footswitches.\nBirth of a Life Pedal\nIn the writing sessions for Life Metal, Stephen & Greg worked extensively shearing their tones toward a broader energy spectrum over high-powered saturation and across planes of sonic character, with the ambition to take full advantage of Steve Albini’s (the recording engineer for the album) exacting capture skills.\nThe results are astounding: there is breadth and luminosity of color, vast sonic cosmoses, flashes of abstract color (synthetic and objective) through resulting themes which emerged from the mastered depths of saturation and circuits between the two players and their mountains of gear.\nThe Life Pedal is designed to represent the core front end chain used in those sessions, to drive the tubes of the band’s multiple vintage Sunn O))) Model T amplifiers (or take your fancy) into overload ecstasy. This is a 100w tube amp full stack’s holy dream, or its apostate nightmare.\nAn octave fuzz inspired by the Shin-Ei FY2 & FY6 units leads the circuit into a LM308 chipped and brutal rodent big box distortion, recreated with the best components, and including a three-way clipping switch (op Amp, Asymmetric & Symmetric). Second stage is a purely clean boost to further overdrive the preamp tubes of your vintage system into -scaped harmonics, and feedback overtone bliss.\nChasms are cleared, mountains sheared, glaciers calved, novæ birthed. Vintage valve amplifiers recommended. We hope you transcend.\nDesigned and manufactured by EarthQuaker Devices in the dark corridors of Akron, Ohio.\nWhat is it?\nLife Pedal is a distortion with a blendable analog octave up and a booster combined in one compact package. The “Amplitude” side is faithfully modeled after the classic “White Face” distortion unit, right down to the LM308 IC and tantalum caps. The only modifications made to the original circuit are in the clipping section. The traditional circuit uses a single pair of silicon diodes for a tight, compressed crunch. The Life Pedal introduces two additional clipping options to better adapt to different rigs. The first position is no diodes to allow for full, grinding Op Amp assault at maximum volume. The second position utilizes two silicon diodes and one LED in an asymmetrical clipping configuration. This delivers a slightly compressed and smooth crunch, similar to a valve amplifier. The last position is the stock double silicon diode configuration which provides that classic tone you know and love.\nThe Octave in Life Pedal is an all-discrete, analog full-wave rectifier circuit built around a pair of Russian Germanium diodes. Located at the input of the circuit, the Octave control slowly blends in the octave effects as you turn it clockwise. This feature can also be used via expression control allowing for wild, hands-free octave swells mid-riff. Because this is an analog octave effect, it is monophonic and works best playing single notes above the twelfth fret while using the neck pickup. Playing chords with the analog octave will sound clanging and chaotic. Using the bridge pickup and playing below the twelfth fret will produce a very subtle octave effect. Going full Octave transforms Life Pedal from a simple distortion device into a swelling, raging fuzz similar to the classic Super Fuzz!\nThe “Magnitude” section of Life Pedal is a simple all-discrete MOSFET booster designed to blast your preamp tubes and drive them wild. It is a 100% clean, no-nonsense, high impedance booster that adds very little color to your tone. It does not add distortion on its own but has plenty of output to push your amp into saturation.\nThe signal path goes Octave>Distortion>Boost. The octave distortion and booster can be used independently with their own respective footswitches. The Petrine Cross is the octave distortion and the Christian Cross is the booster.\nControls\nOctave: This blends in the analog octave as your turn it clockwise.\nDistortion: Turn clockwise for more distortion, counterclockwise for less. This provides about +60dB of gain.\nFilter: This is a low pass filter with a frequency response from around 500Hz to 30kHz. Turn counterclockwise for more high end, clockwise for less.\nAmplitude: Output volume for the octave distortion side. Clockwise for more hearing loss, counterclockwise for a healthy life in old age.\nClipping Switch:\n• OpAmp- No diodes to allow for full, grinding Op Amp assault at maximum volume.\n• Asymm- Utilizes two silicon diodes and one LED in an asymmetrical clipping configuration. This delivers a slightly compressed and smooth crunch, similar to a valve amplifier.\n• Symm- This is the stock double silicon diode configuration which provides that classic tone you know and love.\nMagnitude: This is the output volume for the booster. Clockwise to blow up your amp, counterclockwise if you are a baby. Unity is somewhere right around noon on the dial.\nAmplitude Footswitch: Octave Distortion Activator\nMagnitude Footswitch: Boost Activator\nOctave EXP: Connect any expression pedal to this input to control the analog octave blend. Before inserting the expression pedal, make sure the pedal is powered off.\nPower\nThis device takes a standard 9 volt DC power supply with a 2.1mm negative center barrel. We always recommend pedal-specific, transformer-isolated wall-wart power supplies or multiple isolated-output supplies. Pedals will make extra noise if there is ripple or unclean power. Switching-type power supplies, daisy chains and non-pedal specific power supplies do not filter dirty power as well and let through unwanted noise. DO NOT RUN AT HIGHER VOLTAGES!\nCurrent Draw: 15 mA\nOctave Distortion: Input impedance: 1M ohm / Output impedance\nhttps://www.earthquakerdevices.com/life-pedal",
    "hrid": "earthquaker-devices-life-pedal-v2"
}