{
    "py/object": "mylib.pedal.Pedal",
    "id": "25769",
    "name": "Afterneath (Enhanced)",
    "image": "images/earthquaker-devices-afterneath-(enhanced).jpg",
    "function": [
        "Reverb"
    ],
    "manufacturer": "EarthQuaker Devices",
    "current": "100 mA / 9 V / DC / Negative Center",
    "cost": "$199 Price in €",
    "width": 68,
    "height": 133,
    "details": "Enhanced Otherworldly ReverberatorThe Afterneath sounds a lot like it looks – a wizard bursting forth from ethereal cave and ready for the ambient battle. You are the wizard – or sorceress, if you prefer – and the cave is your instrument’s signal, vast, expansive, and magical. Do you go inside? Roll a D20 to proceed! \nOnce inside, a reflection of light from an unknown source catches your eye, and you notice a bizarre sheen on the walls of the cave. You timidly inch closer to the walls of the cave. Placing your hand gently on the cavern wall, you feel the rock move. The cave is alive! Alarmed, you emit a loud gasp, which reverberates throughout the subterranean landscape. Upon further listening, it appears as though the reverberations of your voice are in fact a swarm of short digital delays which may be used to create wild and cavernous reverbs, or scattered, short, rhythmic delays with bizarre characteristics. \nTake a moment to consider your Intelligence and Wisdom scores, as well as your spell inventory before proceeding further. You have seven spells at your disposal… \nWill you cast “Length,” which controls the decay length of the reverb? \nWhat about “Diffuse,” which adjusts the spread of the reverb? With your wand (or just the knob) turned counterclockwise, the reverb is sharper with more attack, resulting in a stuttering sputter of individual early reflections. Clockwise casts a washy, more ambient-sounding hex. \nOverwhelmed by fear, you hastily cast “Dampen!” As you shout the incantation, you notice that a counterclockwise variation of this spell results in brighter tones, while as you rotate your wand clockwise; you hear darker tones with a mellower top-end. It’s almost as if your magic changes the hardness of the cavern walls, and thus the tonal characteristics of the reverb! \nElsewhere in your book of magic is “Drag,” which separates the individual digital delay lines, literally dragging them through the very fabric of time and space towards an unknown event horizon from which they may never return. Clockwise “Drag” positions will gather the delay lines close together for a more reverb-like effect. Turn the “Drag” counterclockwise, and the delay lines will begin to pull apart for a scattered ping-pong delay effect. \nThe Drag can be put under voltage or expression control using the “EXP” jack located on the side and operates in 9 different modes which are selected by the small “Mode” control. These modes are: Unquantized, Unquantized with slew, Unquantized volt/octave,\nChromatic scale, Major scale, Minor scale, Pentatonic scale, Octaves & fifths and Octaves. These modes drastically change the way the Drag control functions, especially while using an expression control or CV.\nThe “Reflect” alters the depth of the cave, and with it the regeneration of the reverb. This acts as a feedback control and will self-oscillate if cast by a high-level user. Turn clockwise for more wash and echoes, counterclockwise for less. \nFinally, the “Mix” alters the alchemical balance between the input signal and the effect. The Afterneath does not go fully wet but does lower the level of the input signal as you raise this control to create the appearance of a fully wet reverb.\nModes\nThe Modes control changes the way the Drag control functions. The LED will change colors indicating which mode you are in.\n\n\u0007Unquantized: Smooth, unquantized response over the operating range \n\u0007Unquantized with Slew: Smooth, unquantized response over the entire operating range, but with a musical slew that is reminiscent of turning the varispeed knob on a vintage British tape delay. The “Drag” will lag behind the knob or cv changes, but then quickly catch up.\n\u0007Unquantized Volt/Octave: Smooth and unquantized, yet scaled to align with the 1v/octave curve to allow melodic modulation of audio in the buffer, or control the frequency of self-oscillation like a voltage controlled oscillator. \n\u0007Chromatic Scale: Quantized 1v/octave to the chromatic scale \n\u0007Minor Scale: Quantized 1v/octave to the minor scale \n\u0007Major Scale (Lydian): Quantized 1v/octave to the major scale (Lydian) \n\u0007Pentatonic Scale: Quantized 1v/octave to the pentatonic scale \n\u0007Octaves & Fifths: Quantized 1v/octave to omit all but octaves and fifths \n\u0007Octaves: Quantized 1v/octave to omit all but octaves \n\nhttps://www.earthquakerdevices.com/afterneath",
    "hrid": "earthquaker-devices-afterneath-(enhanced)"
}