{
    "py/object": "mylib.pedal.Pedal",
    "id": "33479",
    "name": "Iron Pig",
    "image": "images/earthbound-audio-iron-pig.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Earthbound Audio",
    "current": "? mA / 9 V / DC / Negative Center",
    "cost": "$180 Price in €",
    "width": 94,
    "height": 120,
    "details": "Op-amp distortionThe IRON PIG is an op-amp based distortion / overdrive featuring a slew of options to create many shades of dirt. Perfect for all electric instruments & capable of blending in the original signal via the CLEAN knob. As of May 2019 all IRON PIGS come equipped with a ua308 HC metal can opamp.\nControls:\nLEVEL : Effect output level.\nDRIVE : Distortion intensity. CCW (counter-clockwise) settings will be lower gain while extreme CW (clockwise) settings verge into fuzz territory. Very interactive with the ATTACK control.\nATTACK : Fine tunes the available gain in the mid-high frequencies. Fully CW is the highest gain with plenty of bite & attack. Turning this knob CCW both lowers the overall available gain and warms up the tone. Very interactive with the DRIVE control.\nTONE : Low-pass filter to control the high frequencies. Turn CCW to decrease highs, CW to increase highs.\nCLEAN : Blends between the distorted signal and clean signal. Keep it fully CCW for a totally dirty signal or turn it CW to add clean signal. Crucial for preserving low end when used with bass guitar. For best results start fully CCW to find the desired dirty sound then turn CW to add clean signal- around noon is a good initial setting- and adjust the LEVEL to balance the sound. Too much clean and too little dirt sounds weird so we recommend setting the distortion as the dominant sound with the clean signal filling out the low frequencies.\nCLIPPING ROTARY SWITCH: This knob selects between 6 different flavors of distortion by selecting different types of diodes to clip the signal. The options are arranged from lowest output (GE) to highest output (N/C). When switching from a lower output to higher output setting be sure to adjust the LEVEL to prevent blasting your eardrums into oblivion.\nGE : Germanium diodes\nSI : Silicon diodes\nLS : Mix of silicon diodes and an LED\nLED : LEDs\nMOS : Mix of MOSFETS & Germanium diodes\nN/C : No diodes, all distortion generated by driving the ua308 opamp\nThe IRON PIG is wired for true bypass and can be powered by a standard 2.1mm negative tip power supply set from 9v up to 18v. No battery option.\nhttps://earthboundaudio.bigcartel.com/product/iron-pig-distortion",
    "hrid": "earthbound-audio-iron-pig"
}