{
    "py/object": "mylib.pedal.Pedal",
    "id": "33053",
    "name": "SOVTEK Big Muff π “Black Russian” Bubble Font (7D)",
    "image": "images/electro-harmonix-sovtek-big-muff-π-“black-russian”-bubble-font-(7d).jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Electro-Harmonix",
    "current": "? mA / 9 V / AC/DC",
    "cost": "$486 Price in €",
    "width": 120,
    "height": 165,
    "details": "Big Muff from Saint PetersburgCirca 1998-2000\nCircuit Board Number: BM-1-01.00.001\nCircuit Designer: Based on Bob Myer's original circuit\nEditions: 2. Graphics changed for the second edition\nTrue Bypass: No\nPower: 9V battery only. To connect to a standard Boss type AC power supply, use a 9V 100mA battery adaptor like the 1 Spot CBAT . See POWER section below.\nEnclosure Size: 6 1/2\" long x 4 3/4\" wide x 2 3/4\" tall / 165mm long x 118mm wide x 70mm tall (not including rubber feet)\nPackaging: Wood crate box with Russian lettering\nPlace of Manufacture: St Petersburg, Russia\nGRAPHICS AND COLORS - These transition models are fairly rare. The military green colored heet metal box from the previous version changed to all black with yellow graphics. Otherwise, this was identical to the green, six-screw version. This solved the problem of inconsistent green color from the Russian paint suppliers for the previous version. Both editions were made with both large and small foot switches. A second edition production model changed graphics to the ITC Pioneer BIG MUFF font, the same font used on the vintage USA V3 Muffs and later USA Muffs. The words INPUT and OUTPUT and DISTORTION-SUSTAINER were also added to the box top graphics. The word DISTORTION was changed to SUSTAIN below the center knob. The word SOVTEK was also removed from the graphics and never appeared again on a Russian made Big Muff. The black color varied from shiny black to dull black. The yellow ink shade also varied during the production runs.\nCONTROLS / KNOBS - Russian made foot switch supply had started to become a problem at this time so smaller foot switches had to be imported to St. Petersburg from the USA and Mexico. That is the reason you see some of these with the smaller switch. Eventually the Russian foot switch factory went out of business. Knobs were the black dimple topped type with ridged sides like the previous version, though later production switched to a chicken-head style knob.\nCIRCUIT - Same circuit and PCB trace as the third edition Bubble Font Green Russian. PCB #BM-1-01.00.001. Transistors were unmarked Russian Silicon, in black plastic T092 cases, some with white and green dots painted on. The input and output jacks remained in the reverse position like the previous third edition Green Russian Big Muffs, due to the pcb being mounted upside down.\nPOWER - Power was from a 9V battery only. A red LED light shows when the circuit is on. To connect to a standard Boss type AC power supply, use a 9V 100mA battery adaptor like the 1 Spot CBAT. If you intend to add a standard 9V power jack that works with standard negative tip power supplies, you can find out where to wire the + and - wires by looking at the wiring diagram for your version, or simply follow the red (+) and black (-) wires from the battery snap.\nENCLOSURE BOX - Identical to the green, six-screw sheet metal box from the previous Bubble Font Green Russian Muff, though some second edition boxes have longer metal ridges welded inside the box bottom than others. Jacks had plastic nuts to secure them to the box back. These had four rubber feet screwed to the bottom. Some of these boxes have four digit date stickers inside the box lids. The first two digits are the week of the year and second two are the year. It is unknown if these are final build dates or dates the lids were made or coated. Regardless, the date indicates the pedal could not have been built any earlier than this date.\nCLONES OR SIMILAR PEDALS - The USA Bass Big Muff is very close to the Russian Big Muff tone. Stomp Under Foot GRM Fuzz, Blackout Effectors Musket, Earthquaker Devices Hoof, Absolutely Analog Green Russian. See DiscoFreq's Effects Database for a thorough listing of all the Big Muff clones and variants throughout the years.\nTHE SOUND - The tone is the same as the last V7C Bubble Font Green Russian Big Muffs. Just different box color and graphics. The bass and treble of the tone varies slightly from unit to unit for each edition, but the differences are usually minor.\nhttp://www.kitrae.net/music/big_muff_history2B.html",
    "hrid": "electro-harmonix-sovtek-big-muff-π-“black-russian”-bubble-font-(7d)"
}