{
    "py/object": "mylib.pedal.Pedal",
    "id": "19656",
    "name": "Holier Grail",
    "image": "images/electro-harmonix-holier-grail.jpg",
    "function": [
        "Reverb"
    ],
    "manufacturer": "Electro-Harmonix",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 200,
    "height": 160,
    "details": "The Holier Grail effects pedal expands on the capabilities of the Holy Grail pedal from Electro-Harmonix. It contains 8 different reverb presets: SPRING, HALL, ROOM, and FLERB each at a LONG and SHORT reverb length. In addition to reverb, there is a GATE that ends the reverb tail early for an unnatural yet often pleasing reverb sound.\nHolier Grail Controls:\nTYPE Switch—Selects the type of reverb sound that the Holier Grail will produce: SPRING, HALL, FLERB or ROOM.\nLENGTH Switch—Selects between a LONG or SHORT reverb length. A LONG reverb length is attributed to making a bigger sound, such as a large hall, room, or reverb tank. A SHORT reverb length will yield a smaller sound, such as a small room, hall, or reverb tank.\nBLEND Knob—Is a Wet/Dry control for the reverb signal. As you turn the BLEND knob clockwise you will hear more reverb and less of your instrument. The Holier Grail is designed so that as you turn the BLEND knob from its minimum position to the 12 o'clock position you will hear a subtle amount of reverb added to the output. As you turn the BLEND knob from 12 o'clock to its maximum position the amount of reverb you hear will increase dramatically. It is designed this way so musicians can hone in on just the right amount of subtle reverb.\nGATE Switch—The GATE switch determines how the gate circuit will affect the audio path. The 3 positions are OFF, REVERB ONLY, and REVERB + DIRECT. When the GATE switch is in the OFF position, the gate is completely bypassed and the gate has no effect on the audio path. In the REVERB ONLY position, the output of the reverb generator will be fed into the gate before it goes to the BLEND knob. The output of the gate will then go to the wet side of the BLEND knob to mix with the dry signal. In the REVERB + DIRECT position, the signal after the BLEND knob goes into the gate so that both the wet and dry signals are gated. The output of the gate is then sent to the MAIN OUTPUT of the Holier Grail. In this last position, it is possible to gate only the dry signal by turning the BLEND knob to its counter-clockwise (minimum) position.\nGATE THRESHOLD Knob—This knob determines when the gate should actually be opened or closed. When the GATE THRESHOLD knob is in the counter-clockwise (minimum) position, the threshold is set to high; it will take a very loud signal to open the gate. When the GATE THRESHOLD knob is in the clockwise (maximum) position, the threshold is set to low; the gate will only need a small signal to open up.\nGATE REVERSE Switch—This slide switch enables you to reverse the normal operation of the gate. When the GATE REVERSE switch is off (left position), the gate will act normally; the gate is open when the signal is above the gate threshold and the gate is closed when the signal is below the threshold. When the GATE REVERSE switch is on (right position), the gate will act opposite to how it normally works; the gate is closed when the signal is above the gate threshold and the gate is open when the signal is below the threshold. This feature can be used to obtain a delayed reverb tail or to create swelling effects. To achieve a swell effect, fade in your instrument, as it reaches its maximum loudness, the gate will close.\nGATE SPEED Switch—This slide switch changes the speed at which the gate opens or closes. When the GATE SPEED switch is in the FAST position (right position), the gate opens and closes immediately after the audio signal has exceeded or fallen below the threshold setting. When the switch is in the SLOW position (left position), the gate opens and closes more gradually.\nGATE LED—This LED gives you a visual indication of the state that the gate is in at all times. When the gate is closed, the GATE LED is red. When the gate is open, the GATE LED is green. If the gate is in the act of opening or closing, it is possible that the LED will not be lit at all. This usually happens when the GATE SPEED is set to SLOW. If the GATE is set to OFF, the GATE LED will continue to display the gate's current state. STATUS LED—This LED, located in the top-left corner of the Holier Grail, indicates if the unit is in effect mode or bypass mode. When the LED is lit up, the box is in EFFECT mode, when the LED is off, the box is in TRUE BYPASS mode. INPUT Jack—This 1/4\" jack is the audio input to the Holier Grail.\nMAIN OUTPUT Jack—This 1/4\" jack is the main audio output. When the Holier Grail is in EFFECT mode, the MAIN OUTPUT jack will output the signal after the BLEND knob. This is a mix of the reverb signal and the dry signal. When the unit is in TRUE BYPASS mode, the MAIN OUTPUT jack is connected directly to the INPUT jack.\nREVERB ONLY OUTPUT Jack—This 1/4\" jack sends out just the reverb signal. The REVERB ONLY OUTPUT jack is connected directly to output of the reverb generator. When the Holier Grail is in effect mode, this jack sends out the reverb signal and is not affected by the BLEND knob or any of the gate functions. When the unit is in bypass mode, this jack is muted; it does not output a signal.\nOPERATION NOTES - Getting the most from the GATE: The gate is a volume-sensitive effect so it works particularly well on instruments that do not exhibit volume changes with each note. Such instruments include: keyboards, drums, samplers, or prerecorded audio in a studio. Traditional guitarists may have a hard time obtaining predictable results from the gate without changing their playing style. This results from gates having a small threshold range where they work well. Often users of gates will find themselves twiddling the threshold knob to obtain the ideal timing for when the gate opens and closes. Since most guitarists require two hands to play, they will not have a free hand to twiddle the threshold knob. Knowing this, a guitarist that wants to make full use of the gate should be able to. It might take a little practice but once you have command of the gate, you will be able to shape your sound in new ways. In addition, putting a compressor before the Holier Grail may help yield more predictable results when using the gate. If a super-fast gate closure is required, try putting the gate into reverse mode and the speed on fast. This will allow just the beginning of the instrument's attack to pass through the gate before it has a chance to close. This works particularly well on drum machines.\nWARNING: Use only the 18VDC/500mA AC adapter that is supplied with the Holier Grail. Do not use any other AC adapters. Using other AC adapters, even those made by Electro-Harmonix, could cause harm to the unit, the adapter or you. The Holier Grail does not use batteries.",
    "hrid": "electro-harmonix-holier-grail"
}