{
    "py/object": "mylib.pedal.Pedal",
    "id": "31730",
    "name": "Machinedrum SPS-1UW MKI",
    "image": "images/elektron-machinedrum-sps-1uw-mki.jpg",
    "function": [
        "Drum"
    ],
    "manufacturer": "Elektron",
    "current": "? mA / ? V / AC/DC",
    "cost": "$1,599 Price in €",
    "width": 340,
    "height": 176,
    "details": "Drum MachineThe Elektron Machinedrum SPS-1UW MKII drum synth/sequencer puts you in command of sounds, patterns, and effects that will spark your creativity - onstage or off. The compact Machinedrum SPS-1 MKII is much more than just a great drum machine; it packs comprehensive drum synth and sequencing functionality into its chassis, while boasting great-sounding effects, onboard sample memory, and even full MIDI support for external control. If you crave those classic-sounding beats but enjoy shaping sounds, the Machinedrum SPS-1UW MKII is your dream machine! This monster beat-engine now comes with the +Drive expansion pre-installed, which lets the Machinedrum SPS-1UW MKII host over 6000 ROM samples and store 128 memory snapshots, each containing up to 128 patterns, 64 kits, 32 songs and 8 globals. That's a ton of creative power in one little box!\nThe Machinedrum SPS-1 MKII doesn't simply let you shape, tweak, and mangle great drum sounds. Its onboard sequencer lets you put together incredible patterns that can be tweaked on the fly. The secret lies in the way it operates, offering complete control of the sound engine while at the same time being a creative tool in itself. All synthesis, track effect, routing and global effect parameters can be controlled using the sequencer. Of course, all parameter changes can be recorded in real time. With a few button-pushes and some encoder tweaking, a bland 4/4 loop can be turned into a rhythmical assault.\nThe Machinedrum SPS-1UW MKII is equipped with 2.5MB ultra-fast sample memory. This is not your ordinary drum sampler, however; the dynamic 12-bit sample engine onboard the SPS-1UW MKII will add punch, grit and character to your samples. The SPS-1UW MKII makes an incredible tool for the modern DJ. Use the RAM machines to capture loops from a turntable and remix them on the fly. The RAM machines can also resample the internal sound of the Machinedrum, entering yet unknown and potentially hazardous audio territory. Play your beats backwards or make them sound like they were processed by a rusty grinder. It's up to you! The Machinedrum SPS-1UW MKII gives you all the great features found in its sibling, the SPS-1 MKII, including world-class drum synthesis and the extensive MIDI sequencer.\nThe Machinedrum SPS-1UW MKII features the kind of easy-to-use interface that inspires creativity in any environment. Despite the depth of its onboard sequencer, the Machinedrum is designed to be as user friendly as possible. Everything is close at hand and ready for action. In addition, individual drums and patterns can be trigged externally. All track parameters can also be controlled externally using the over three hundred available CC commands. Of course, the Machinedrum can control external synthesizers as well. The MIDI sequencing capabilities are immense since it is possible to parameter lock CC messages.\nThe 64 step pattern sequencer controls both the internal sound engine as well as offering control over external MIDI gear. Up to 128 patterns and 64 kits can be stored internally. The sequencer can also use slide, accent and swing functions to further spice things up. The song sequencer is ideal for arranging a live performance. Use it to chain patterns, create loops, set mutes and even manipulate pattern lengths. With clever use of the song sequencer a pattern can be rearranged in infinite ways.\nWant to apply effects to your tweaked-out beats? This box lets you add effects independently to each of its tracks! Choose between a 1-band EQ, an amplitude modulator, a flexible resonant multi-mode filter and distortion. Use them to add subtle nuances to a sound - or to destroy it completely! The effect parameters can be controlled with the sequencer or with the LFO's, making it possible to easily create ever-evolving rhythmic sounds. The Machinedrum SPS-1UW MKII's stereo master effects system is composed of the Rhythm echo delay, the Gate box reverb, the Dynamix dynamic processor and the Master EQ. These effects can affect all sound routed through the stereo output.\nInject even more of your own expression into the Machinedrum SPS-1UW MKII with parameter locking. This feature makes it possible to add subtle nuances or extreme variations to the sounds in a pattern. A parameter lock basically saves a snapshot of a parameter. For example, all the kick drum note triggers in a pattern could have different decay lengths or different filter settings. Since almost all parameters of the Machinedrum can be parameter locked, this allows for some serious audio experimentation.\nElektron Machinedrum SPS-1UW MKII Drum Synth/Sequencer Features at a Glance:\nIncludes +Drive expansion for 128 snapshots and over 6000 ROM samples\n5 x MD synths\n2.5MB sample memory\n130 MD machines\n64-step sequencer\n16-track sequencer\n16-part effect system\nStereo master effects\n16 x LFOs\n6 audio outputs\n2 audio inputs\nFull real-time control\n12-bit dynamic sampling\nCompact high-quality design\nLarge backlit LCD",
    "hrid": "elektron-machinedrum-sps-1uw-mki"
}