{
    "py/object": "mylib.pedal.Pedal",
    "id": "26306",
    "name": "Snazzy LV - Tracer City",
    "image": "images/erica-synths-snazzy-lv---tracer-city.jpg",
    "function": [
        "Filter"
    ],
    "manufacturer": "Erica Synths",
    "current": "? mA / ? V / AC/DC",
    "cost": "$367 Price in €",
    "width": 140,
    "height": 178,
    "details": "Analog Multi-mode Resonant FilterSnazzyFX and Erica Synths teams up as Snazzy LV to bring back the experimental cult effect pedals Wow and Flutter, The Mini-Ark and Tracer City which we believe may expand minds and put musicians in touch with psychedelic music and creative impulses of the world. Manufactured in Latvia by Erica Synths now pedals are put in more compact heavy duty boxes with solid build quality keeping the authentic sound of the SnazzyFX pedals from the original run and will not only stand the test of time but will turn heads wherever you take them.\nIf you are a DJ, producer, sound designer, keyboard player, bassist, or a guitarist in a band; if you are looking for one piece of original analog hardware to transform your creative setup - the TRACER CITY is the box.\nSNAZZY FX designed the TRACER CITY to provide a whole range of new textures, from envelope follower effects to filtered tremolo, from aggressive filter sweeps and subtle coloration, all the way on through completely bizarre tones which have little to do with the incoming signal. This box is made to suit your musical personality with enormous room to grow.\nFeaturing a true analog multi-mode resonant filter and powered by Synth level power rails, the TRACER CITY is perfect for tweaking drum loops or live drums, synths, bass, field recordings, or anything else you feel like putting through it.\nTRACER CITY has the ability to handle line or guitar levels and enough gain to drive the signal into smooth overdrive. With control of cutoff, resonance, linear or Exponential modulation, this is a box you can get great sounds with - even if you have never used an analog synth before. There are two, yes two, modulation sources; an envelope follower with up and down modes, and two external CV or Audio (FM) inputs, each with their own Depth and Expo/Lin switches.\nThere is very little that the TRACER CITY can’t do, be it beautiful, weird or wild, you will always have truly unique sounds. This is a hands on device offering a wealth of possibilities with enormous potential for sound shaping.\nYou can plug in a drum loop, set the filter, start turning up the modulation, and if you really want to have some fun, you can plug in two more sources! One could be a CV source from your modular or analog synth, and one could be another drum loop or guitar part. The CV source will modulate the signal just like the built in modulation sources, and the external audio will cause Frequency Modulation of the signal.\nThe TRACER CITY features +/- 15 volt rails (similar to the rails found in analog synthesizers) powered by a standard barrel connector 9 volt DC adapter. This means greater head-room, which translates into a better tone. And like all SNAZZY FX products, it features True Bypass and a Seriously Heavy Duty Box with SNAZZY Graphics that will not only stand the test of time, but will turn heads wherever you take them.\nhttps://www.ericasynths.lv/shop/snazzy-fx/tracer-city/",
    "hrid": "erica-synths-snazzy-lv---tracer-city"
}