{
    "py/object": "mylib.pedal.Pedal",
    "id": "33124",
    "name": "Aquavibe",
    "image": "images/foxrox-aquavibe.jpg",
    "function": [
        "Chorus",
        "Phase Shifter",
        "Rotary"
    ],
    "manufacturer": "Foxrox",
    "current": "250 mA / 9 V / DC / Negative Center",
    "cost": "$299 Price in €",
    "width": 98,
    "height": 131,
    "details": "Compact analog vibeAquaVibe runs on 9 Volts DC (external). Power input is protected and filtered and is internally converted to 24 Volts DC. Speed of effect can be controlled with a standard Expression pedal and no special wiring is needed. Includes Center control for altering the balance of the sweep.\nWe'll skip all the hype about Hendrix, Trower, lush vibe swirling \"Machine Gun\" psychedelic Uni-Vibe sounds. Let's just say, it's all in there...and much more.\nControls\nSpeed Big knob for easy adjustment. You can use your foot but don't stand on it! When using an expression pedal, set Speed at max. You can control the range of the expression pedal by using the Speed knob to set the fastest setting.\nWidth Knob sets the amount of sweep. Control known as \"Intensity\" on other similar pedals. Low settings produce a watery \"swish\", extreme settings produce an exaggerated warble.\nCenter Sets the balance of the sweep. Dial in the exact type of warble you want. You can make it dead even or offset in either direction, high or low. This adjustment produces vibe sounds unique to the Aquavibe. Also, it is the key to nailing various sounds from old recordings made using vintage equipment that varied from unit to unit. Standard setting is 11:00-1:00. Center can also be used to manually sweep through the phase shift by turning the Width all the way down.\nCh/Vb switch This switch selects between Chorus and Vibrato modes. Chorus is a watery phasing sound and Vibrato is a warm pitch vibrato.\nInput/Output Switchcraft jacks for Input and Output (stereo jacks used for uniform tension)\nSpeed control jack Standard expression pedal can be used. When using expression pedal, the Speed knob is used to set the maximum speed.\nPower Standard power 9 Volts DC, 300mA, 2.1mm Center-negative. Current rating is very important, Aquavibe will not work properly with a lower current (< 250 mA) power supply.\nSpeed indicator LED Green LED blinks to indicate the speed setting. It is designed to blink even when Aquavibe is bypassed so you can see the speed prior to turning it on. \nFootswitch True bypass with red LED using 3PDT switch.\nInternal adjustments (Blue TRIMMERS)\nThe internal trimmers are for people who feel the need to tweak. They are pre-set and marked. If you have the desire to tweak them you can always use the marks to return them to their original settings.\nLevel This adjusts the output volume. There is some level cut and boost which is useful for matching up the effect level to the bypass level.\nBright This adjusts the input impedance. Select from 47K (same low impedance as vintage units) up to 250K (higher impedance). Low impedance setting rolls off top end from the sound of your guitar creating a darker sound. As trimmer is turned and impedance is increased, top end is restored.This also has a slight effect on level, so Level trimmer must be adjusted.\nSpeed board trimmer Don't bother with this one, as it doesn't change the way the unit sounds. It's part of the speed circuit and is used to set the Speed knob so that when it's all the way down the sweep is at its slowest.\nVoltage 9 Volts DC (external). AquaVibe’s current draw is too high for running it on a 9 Volt battery. It would die in a mater of minutes. You can power AquaVibe with voltage ranging from 7 Volts to 15 Volts. Since the voltage is internally regulated at 5 Volts, feeding it higher voltages does not affect performance. Do not exceed 15 Volts.\nCurrent draw 250mA. To be on the safe side, make sure your power adapter can supply at least 300mA. See Owner's Manual for more information.\nhttps://www.foxroxelectronics.com/AquaVibe.html",
    "hrid": "foxrox-aquavibe"
}