{
    "py/object": "mylib.pedal.Pedal",
    "id": "13541",
    "name": "Octron3",
    "image": "images/foxrox-octron3.jpg",
    "function": [
        "Pitch Shifter"
    ],
    "manufacturer": "Foxrox",
    "current": "12 mA / 9 V / DC / Negative Center",
    "cost": "$199 Price in €",
    "width": 76,
    "height": 122,
    "details": "Analog octave up/downOctron3 is smaller and has two additional switches. These switches bring the original Octron's internal settings to the front panel. Aside from that, Octron3 uses the same circuitry as Octron. The switch selections have been fine-tuned to bring out a choice of Octron’s best sounds, previously not possible without opening the unit.\nOctron3 is an analog pedal - not to be confused with a digital octave pedal. You won't get that cheesy harmonizer sound with digital latency. Instead, it's an organic analog effect that responds to your playing style/technique. And it takes on a new life when you put it though other effects and crank it up. Octave up, down, clean with a little of each mixed...you can dial in just a hint of octave or you can make Octron3 your octave monster!\nOctave Down - It's an octave divider in the tradition of Mutron/BOSS OC2/DOD Octoplus/etc. It tracks your dynamics and has more pre-divide gain and filtering. The result is probably the best tracking you'll ever get from an analog octave divider. Ultimately, the tracking is most dependent on playing technique. Articulate playing tracks well, while sloppy playing doesn't.\nOctave DOWN Mids/Low switch:\nMids - This gives the low octave a \"woody\" type of tone, with midrange punch that will cut through when using a small amp.\nLow - This gives a deep, fat bass tone that sounds HUGE through 12\" and 15\" speakers. Frank Marino helped in shaping the fat low octave sound. (Frank Marion and Mahogany Rush)\nOctave Up - It's a high gain circuit that uses a pair of germanium diodes to get the octave doubling effect. The upper octave is present at all parts of the neck, but it becomes most prevalent as you go up the neck on the high strings. Up around the 10th fret and higher, you can get a pure upper octave.\nOctave UP Bright/Pure switch:\nBright - The octave up circuit receieves a full range signal and the output is bright and clear, and rich with harmonics. Roll your strat volume knob down and use the neck pickup for Hendrix \"Octavia\" type sounds.\nPure - The octave up circuit recieves its signal after going through a low pass filter. This results in a more pure octave-up sound, with less treble and fewer harmonics.\nTips for Octave Down Tracking\nLike other Analog Octave dividers, Octron3's lower octave will get confused by chords, open strings, harmonics, weak pickups and sloppy playing. Clean, articulate playing is rewarded with near-perfect tracking. Here are some general tips for getting the best tracking results not only with Octron3, but with any octave divider, and even many guitar synthesizers that work on the same principles:\nUse the NECK pickup - a guitar's neck pickup has the roundest and purest tone. As you move away from the neck, with middle, bridge, or any combination of pickups, you add more harmonics and less of the fundamental frequency. Lower octave tracking will become less accurate resulting in skipping and dropping out. Also, make sure your guitar is set up right. Dead spots and buzzing frets will cause poor tracking.\nLet only one note sound - The octave down circuit will warble, skip and drop out if you play multiple notes at once or let open strings sound. Palm muting will help you control your dynamics and will produce the best tracking. The more articulate your single note playing is, the better the tracking will be. You can even use the tracking as a way to improve your playing.\nLetting notes decay - As a note decays, there comes a point where the Octave down circuit can no longer determine the note you're playing. At this point it will sputter a little and drop out. The way to prevent this is to know at what point this happens, and modify your playing to prevent it. Learn just how long you can let a note hang and cut it off before the Octave down circuit gets confused. Note - with single-coil pickups the natural hum can get pretty loud. When especially bad, this can cause Octron3's lower octave to skip.\nPlay the chromatic scale on every string, up and down the neck. It seems that every guitar has one or two notes that just won't track well.\n*Higher voltage - You can run Octron3 at higher than 9VDC for increased headroom, which is most useful when using Octron3 with bass guitar. Do not exceed 18VDC.\nhttp://www.foxroxelectronics.com/Octron3.html",
    "hrid": "foxrox-octron3"
}