{
    "py/object": "mylib.pedal.Pedal",
    "id": "15598",
    "name": "Full Drive 3",
    "image": "images/fulltone-full-drive-3.jpg",
    "function": [
        "PreAmp",
        "Distortion"
    ],
    "manufacturer": "Fulltone",
    "current": "? mA / ? V / AC/DC",
    "cost": "$135 Price in €",
    "width": 122,
    "height": 38,
    "details": "OD/Boost/DistortionFull-Drive3\nUnlike its cousin the FD2, the FD3 uses both a JFET input and a JFET op-amp, giving it the most tube-like sound you can get out of a tubeless pedal. Along with great sound, these JFET’s give the FD3 an ultra-high Input impedance which allows the pedal to mate with any type/gain of pickup and react well to changes in your guitar’s volume control.\n3-way CLIPPING toggle switch:\nset to 90’s and you’ll get symmetrical clipping with ample midrange.\nSet the switch to WIDE ASYM (wide asymmetrical) and more sweet highs and lows come through, along with chimey, Class-A style even harmonic overtones.\nset to COMP-CUT mode, pure opamp-overdrive, with no diode clipping assistance. Aggressive, cutting, and capable of a huge volume boost to slam the input of your amp.\nDiscrete Channels:\nUnlike the FD2, the FD3 has completely independent OVERDRIVE and BOOST channels, and the ORDER toggle switch allows placing the BOOST channel* before* or after the OVERDRIVE channel. The BOOST channel is also an extremely transparent, high-headroom 100% JFET-powered circuit.\nBuffered Bypass:\nSerial# 2548 and higher FD3 pedals are now Buffered-Bypass instead of True-Bypass, so the FD3 will always drive long cables, be isolated from other effects, and always retain the highs and “feel” of your amplifier whether the pedal is turned ON or OFF. Do not confuse the hi-quality JFET op-amp buffer in the FD3 with the simple single transistor buffers on other pedals. The FD3's buffer sounds rich and fat, not thin.\nDYNAMICS knob:\nA Fulltone-exclusive Germanium diode Limiter circuit circuit that alters the feel of the notes being played as well as subdues transient spikes which can overload your amp’s input. This feature can make even a stiff amp feel responsive and juicy, and sweeten the treble frequencies.\nThe Icing on the cake? The housing is about 20% smaller than the traditional FD2\nSPECIFICATIONS:\nInput impedance: 1.1 mega-ohms. Output Impedance: 180 ohms.\nDimensions: 5.17\"W x 4.26\"D x 2.36\" H. Weight: 1lb 7oz.\nPower Consumption: maximum 13 ma with both channels on.\nhttps://media.sweetwater.com/images/items/750/FullDrive3Bk-large.jpg?v=0e97c912ab0baea3",
    "hrid": "fulltone-full-drive-3"
}