{
    "py/object": "mylib.pedal.Pedal",
    "id": "18645",
    "name": "Mini-Deja'Vibe MDV-1",
    "image": "images/fulltone-mini-deja'vibe-mdv-1.jpg",
    "function": [
        "Chorus"
    ],
    "manufacturer": "Fulltone",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 137,
    "height": 105,
    "details": "Fulltone was the first to put out an exact copy of the legendary Vintage'60's Univibe on a large scale, starting in 1994. Ours has that dripping Phase-Chorused tone that made Jimi's \"Machine Gun\" so epic! The Deja’Vibe has evolved over the years, and is now available in silver & Black as the Mini-Deja’Vibe (MDV-1)\nHoused in a sturdy 16 gauge steel housing that measures a mere 4\" x 5.75”, the MDV-1 is small enough to fit on the most cluttered pedalboard.\nThe new MDV-1 is not only beautiful, the price is $219… putting the street price way below $190! $190 for a hand-made in the USA piece of art.\nLately everybody’s talking about the Fulltone Custom Shop MDV-3… \"the King of the vibes!\" is what they are saying. But very few know that the MDV-1 and the MDV-3 are the same now, except for the MDV-3’s built-in foot-operable speed control treadle. Identical PCB, photocells, NOS 2SC828 transistors, and sound.\nWhat are these Photocells I hear about?\nThere are 4 photo-resistors in every real Univibe clone. If they’re not there, it’s nothing but a glorified MXR-type phase pedal with altered cap values. I spent a lot of time and money a few years ago working with John Greene (Electronic Engineer) to blueprint the resistance characteristics as well as the rise/fall times of the original ShinEi Univibe photocell... to pin point the mojo of the old Univibe cells!\nI thought you always had great photocells? What changed?\nA new international directive aimed at reducing things deemed harmful to the planet called ROHS, that’s what. And those old Univibe photocells are most definitely not ROHS approved… they contain high levels of cadmium! By the the mid-2000’s you could no longer legally ship a device containing these type of photocells to most countries, so vibe makers (the ones with ears anyway) soon discovered their vibes weren’t sounding like they used to. I did something about it.\nWhat did you do Mike? I’m half-fascinated that a grown man would get so obsessed about a silly 45 year old pedal design.\nI worked for over a year with a prominent Photocell manufacturer, developing proprietary new photocells that respond the same way old cdS cells did. See, all the off-the-shelf photocells have a super-quick 25-75 millisecond fall time. They sound boring, and one dimensional.\nI’ve tried your vibes over the years, why do the new MDV-1 and MDV-3 sound so huge and thick?\nPartly because of the newer cells, and partly because I fiddle with things sometimes, and at some point a long time ago, I changed some of the values in the Deja’Vibes. But one day was playing a particular great sounding original Univibe (I have 8 of them) and was inspired to sit down and take some notes on values and finally yank out and sacrifice its photocells so that you could have a superior vibe! I also changed all values back to the original Univibe because people want that sound, not my take on that sound. A side note: the widely available Univibe schematic which was included with original 60's & 70's Univibes (Google univibe schematic ) is wrong. There are crucial errors in 2 areas of the circuit. I checked it against 13 original Univibes. My point? There's more to it than a schematic, you have to look, listen, and probe.\nWhat does someone who knows ‘vibes (Robin Trower) say about his totally stock off-the-shelf DejáVibe?\n\"Simply Brilliant. I use it all the time. It's the best of its kind!!\"",
    "hrid": "fulltone-mini-deja'vibe-mdv-1"
}