{
    "py/object": "mylib.pedal.Pedal",
    "id": "25683",
    "name": "Mas Malo",
    "image": "images/fulltone-mas-malo.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Fulltone",
    "current": "8 mA / 9 V / DC / Negative Center",
    "cost": "$127 Price in €",
    "width": 64,
    "height": 112,
    "details": "Distortion / fuzzFeaturing 3 x hand-picked New old Stock BC184C discrete transistors, this spicy number is capable of vicious, massive sounding Distortion/Fuzz that will feedback infinitely even at bedroom levels! But here's the clincher, dial back the \"H\" (heat) knob and \"D\" (distortion) knobs and you can nail many Jimmy Page studio tones as well as your favorite Floyd sounds. Quite possibly the most versatile distortion/fuzz ever made.\nIn a tiny package (this pedal fits in the palm of your hand) with top-mounted jacks, High Impedance input ( sorry Fuzzface) , ultra Low Impedance output, (sorry fuzzface) with an ability to interface with any guitar, effect or amp. Top it off with a beautiful Midrange (sorry fuzzface) and that makes it truly \"More Bad!\n\"I love pedals with backstories—call it the curse of being a journalist. Although the flame-red finish and pepper graphic are relevant clues, the Mas Malo (“More Bad”) is actually named after one of Fulltone founder—and spicy food fanatic—Michael Fuller’s favorite Mexican restaurants. Not surprisingly, the pedal is one scorching machine that delivers white-hot fuzz tones. However, Fuller also took pity on more tender “gastronomical types” by designing the Mas Malo to offer less-piquant overdrive sounds. For example, I turned down the Heat control (which re-biases the first transistor in the circuit) to about 8 o’clock, and the Drive knob to 11 o’clock, to craft a guitar sound very close to that of Badfinger’s 1970 rocker “No Matter What.” No need for Rolaids there. Then, I got brave and dimed the Drive and Heat controls for an onslaught of harmonically rich saturation that shrieked like demons burning in hell fire. Call a doctor! If that level of mayhem is overkill, take heart that you can dowse the inferno somewhat by softening your picking attack or turning down your guitar’s Volume. The Mas Malo is a badass, but it also has a soft side.\"\nhttps://www.fulltone.com/products/mas-malo",
    "hrid": "fulltone-mas-malo"
}