{
    "py/object": "mylib.pedal.Pedal",
    "id": "31081",
    "name": "GST-UO5 Ultron",
    "image": "images/guyatone-gst-uo5-ultron.jpg",
    "function": [
        "Filter",
        "Wah"
    ],
    "manufacturer": "Guyatone",
    "current": "200 mA / 9 V / DC",
    "cost": "",
    "width": 120,
    "height": 188,
    "details": "Envelope Filter & Optical Auto-wahControls\nFilter Mode (HP/BP/LP/Notch)\n        switches between the filter types: high-pass, band-pass, low-pass, notch\n    Peak\n        controls the peak/resonance of the filter\n    Select (Waveform/Effect Mode)\n        selects waveforms or effect modes\n    Speed\n        controls the speed of the LFO in the modes where the LFO controls the filter\n    Range (M/H/L)\n        selects the frequency range in which the filter moves\n    Drive (Up/Down)\n        selects the direction in which the filter moves in response to the input signal\n    Threshold\n        controls the sensitivity of the filter\n    Frequency\n        controls the center frequency\n    Tap (x1/x2/x4) / Pdl (A/B/C)\nWith optical circuitry based upon the vintage Mutron III envelope filter, the Ultron Auto Wah takes the soul of that classic effect and adds a variety of new and useful control features that set it apart from any other unit on the market.\nWith the Ultron three types of classic wah filter effects are available – Envelope Filter (filter effect controlled by pick attack), Auto Wah (filter effect controlled by internal oscillator), or Manual Wah (filter effect controlled via external expression pedal). For all three effect types the frequency range, direction and intensity of the filter effect are completely adjustable via the Threshold, Frequency, Drive and Peak controls on the unit’s front panel.\nAt the heart of the Ultron is Guyatone’s proprietary CPU controller which allows for quick selection of the Ultron’s primary effect function. Six Effect Modes are easily accessible from the unit’s front panel, and each Effect Mode features a Sub-Mode that can be accessed with a quick press of the Control Footswitch. If that wasn’t enough, the last two Modes also feature Bonus Modes that allow for manual selection of the oscillator Waveform via an external expression pedal.\nThe Six Effect Modes are as follows:\n    MOMENTARY WAVE – Functions as an Envelope Filter or, when Control Footswitch is pressed and held, an oscillator-controlled Auto Wah.\n    WAVE TAP –Functions as an oscillator-controlled Auto Wah with rate determined by tap tempo function of Control Footswitch.\n    PEDAL WAH/TOUCH – Functions as a Manual Wah with filter position controlled by the optional external expression pedal in Main Mode. Three selectable tapers (Linear/Audio/Reverse Audio) are available for the treadle. In Sub-Mode unit functions as an Envelope Filter.\n    PEDAL DEPTH/TOUCH - Main Mode varies Frequency Depth using the optional Expression pedal or functions as Envelope Filter in Sub-Mode\n    PEDAL SPEED1/TOUCH – Main Mode varies the speed of the Wave Form oscillation with the optional Expression Pedal over a range of 70-1000 mS. In Sub Mode the unit functions as an Envelope Filter.\n    PEDAL SPEED 2/TOUCH – Main Mode varies the speed of the Wave Form oscillation with the optional Expression Pedal over a range of 70-4000 mS. In Sub Mode the unit functions as an Envelope Filter.\nVia these multiple Effect Modes, the user can achieve a limitless variety of filtering effects that can all be toggled through and tweaked in real time.\nThe Ultron’s CPU also offers six selectable waveforms when the unit is used in the oscillator-controlled Effect Modes - a variety of Triangle, Sawtooth, and Square Waves are available for quick selection via the unit’s front panel. In addition, the oscillator’s rate can be displayed in BPM or Milliseconds allowing for precise syncing to song tempo or external devices.\nLike the Mutron III, the Ultron features selectable High Pass, Band Pass and Low Pass filters, allowing for use with a wide variety of instruments and input signals. Additionally, the Ultron features a Notch Filter setting which creates a “mid-scoop” effect particularly useful for Funk and Slap Bass.\nThe Ultron’s Range control offers similar improvements over the original Mutron, featuring the standard Hi and Lo ranges as well as the new Mid frequency range, which allows for much more precise positioning of the filter effect. The Ultron’s operation ranges can be further tweaked for use with specific instruments via an array of internal DIP switches.\nWe could go on and on regarding its features and functions, but to put it simply the Ultron is the ultimate Auto Wah! Whether you are looking to replace your vintage stompboxes or create an entire new range of filtering effects, the Ultron is a one-man audio arsenal!",
    "hrid": "guyatone-gst-uo5-ultron"
}