{
    "py/object": "mylib.pedal.Pedal",
    "id": "31082",
    "name": "GST-CO4 Ultrem",
    "image": "images/guyatone-gst-co4-ultrem.jpg",
    "function": [
        "Tremolo",
        "Distortion"
    ],
    "manufacturer": "Guyatone",
    "current": "200 mA / 9 V / DC",
    "cost": "",
    "width": 120,
    "height": 188,
    "details": "Optical TremoloWith optical circuitry based on the classic amp tremolo circuits of yesteryear, the Ultrem Optical Tremolo takes the tone of those legendary units and adds a variety of new and useful control features that set it apart from any other stompbox on the market.\nWith the Ultrem several types of tremolo and volume effects are available including oscillator-controlled Tremolo and manually-controlled Volume. Rate of the Tremolo can be controlled via tap tempo, the unit's front-mounted Speed control, or an optional expression pedal. Dual outputs allow panning of the Tremolo effect between two amps or for use as an amp selector/blender in manual Volume Mode. Depth and Saturation controls allow for precise control of the degree and tonality of the effect as well as for use as a great-sounding Overdrive unit when the oscillator is disengaged.\nAt the heart of the Ultrem is Guyatone's proprietary CPU controller which allows for quick selection of the Ultrem's primary effect function. Six Effect Modes are easily accessible from the unit's front panel, and each Effect Mode features a Sub-Mode that can be accessed with a quick press of the Control Footswitch. If that wasn't enough, the last two Modes also feature Bonus Modes that allow for manual selection of the oscillator Waveform via an external expression pedal.\nThe Six Effect Modes are as follows:\n   WAVE TAP -Functions as an oscillator-controlled Tremolo with rate determined by tap tempo function of Control Footswitch.\n    MOMENTARY WAVE - Functions as an oscillator-controlled Tremolo when Control Switch is depressed and held - releasing switch disengages the effect. Rate is determined by unit's Speed control.\n    PEDAL VOLUME/WAVE - Main Mode varies output Volume using the optional Expression pedal or functions as an oscillator-controlled Tremolo in Sub-Mode. If set to Pan On, Ultrem can function as an amp selector/blender in Main Mode.\n    PEDAL DEPTH & WAVE TAP - Allows user to vary the Depth of the effect by using an optional Expression pedal, and also to adjust speed of Wave Tremolo by tapping tempo, instead of using pre-set controls.\n    PEDAL SPEED1/TOUCH - Main Mode varies the speed of the Wave Form oscillation with the optional Expression Pedal over a range of 70-1000 mS. In Sub Mode the unit functions as standard Tremolo.\n    PEDAL SPEED2/TOUCH - Main Mode varies the speed of the Wave Form oscillation with the optional Expression Pedal over a range of 70-4000 mS. In Sub Mode the unit functions as standard Tremolo. \nBy using these different Effect Modes, the user can achieve a limitless variety of Tremolo and Volume effects that can all be toggled through and tweaked in real time.\nThe Ultrem's CPU also offers six selectable waveforms when the unit is used in the oscillator-controlled Effect Modes - a variety of Triangle, Sawtooth, and Square Waves are available for quick selection via the unit's front panel, allowing the Ultrem to mimic any Tremolo type from the smooth, rolling tone of vintage amps to the tight “helicopter” chop so popular in today's music. In addition, the oscillator's rate can be displayed in BPM or Milliseconds allowing for precise syncing to song tempo or external devices.\nThe Ultrem also features an “auto-start” function that engages the Tremolo effect whenever there is an input signal and disengages when input signal returns to zero. This allows for “quick start” Tremolo that will be perfectly timed with the musical passage. The input sensitivity of this feature can be adjusted via an internal Trim Pot to allow use with a variety of different instruments and input signals.\nWe could go on and on regarding its features, functions, and sound, but to put it simply the Ultrem is the ultimate Tremolo! Whether you are looking to replace your vintage amps and stompboxes or create an entire new range of effects, the Ultrem is a one-man audio arsenal!\nMore than 25000 guitar effects pedals from 4000 brands:\nhttp://www.effectsdatabase.com/model/guyatone/gstc04",
    "hrid": "guyatone-gst-co4-ultrem"
}