{
    "py/object": "mylib.pedal.Pedal",
    "id": "28360",
    "name": "Broadcast Dual Footswitch Sand Yellow Edition",
    "image": "images/hudson-electronics-broadcast-dual-footswitch-sand-yellow-edition.jpg",
    "function": [
        "PreAmp",
        "Distortion"
    ],
    "manufacturer": "Hudson Electronics",
    "current": "20 mA / 9 V / DC / Negative Center",
    "cost": "$200 Price in €",
    "width": 120,
    "height": 90,
    "details": "Hudson Electronics x Regent Sounds Broadcast Dual F/Switch Ltd Ed Sand YellowWe’ve taken the great sound of the Broadcast and added the extra flexibility of foot-switchable gain modes and separate level controls – for those who like to switch gain modes on the fly. Exclusive to Regent Sounds and finished in sand yellow. \nWe have made the gain mode (LOW or HIGH) select-able via the right-hand footswitch (the green LED indicates when the pedal is in HIGH gain mode). Each mode its own LEVEL control and in addition, the pedal has two internal trimmers that allow you to fine-tune the amount of gain each mode has.\nThe Broadcast is a transformer-coupled, discrete Class-A germanium pre-amplifier based on the classic broadcast consoles of the 1960s. In the low-gain setting, the Broadcast can cover everything from sparkling clean boost through to transparent overdrive, all with a healthy dose of volume available to push your amp. The Broadcast features a specially selected Triad steel-core transformer and a Germanium transistor. Advancing the gain on the Broadcast starts to saturate the transformer and the pedal’s discrete circuitry, giving rise to a gentle and dynamic compression coupled with subtle thickening of the mid-range. With the gain switch in the high setting and the trim control wound up, the Broadcast starts to deliver heavier distorted sounds with a warm and fuzzy edge to them. The Broadcast covers a wide range of driven and distorted tones whilst remaining dynamic, responding well to pick attack and the subtle nuances of every player.\nSelected Germanium and Silicon transistors\nTRIAD Magnetics steel-core transformer\nBI Technologies potentiometers\nLumberg jack sockets (rated for >5000 cycles)\nHeavy-duty Alpha footswitches (rated for >30,000 cycles)\nLEFT FOOT SWITCH – Bypasses the pedal (red LED indicates the pedal is active)\nRIGHT FOOT SWITCH – Toggles between LOW and HIGH gain modes (green LED indicates HIGH gain mode is selected)\nLEVEL LOW – Controls the volume of the pedal in LOW gain mode\nLEVEL HIGH – Controls the volume of the pedal in HIGH gain mode\nGAIN TRIM – Controls the gain level (both in LOW and HIGH gain modes) of the Broadcast (at higher settings the high-end of the signal is gently rolled off)\nLOW CUT – Attenuates the low-end of the Broadcast (since this control lies at the front\nend of the Broadcast’s circuitry, it is interactive with the gain controls)\nINTERNAL TRIMMERS – Sets the total amount of gain available in each mode.\nDC SOCKET – The Broadcast requires a DC power supply unit (PSU) and can run at voltages between 9v and 24v; running the Broadcast at 18v or 24v gives it more headroom, output level and clarity. This is great for use with bass or when using the Broadcast as a clean pre-amp boost.\nThe Broadcast requires a DC power supply unit (PSU). Please ensure your PSU can supply between 9v and 24v, a minimum current of 20mA and has a 2.1mm negative centre barrel plug. Any other type may damage your pedal. If you plan on sharing the same PSU with other pedals, we recommend using a PSU with isolated outputs, e.g. Voodoo Labs ISO-5 / Pedal Power 2 Plus.\nCURRENT DRAW – 20mA",
    "hrid": "hudson-electronics-broadcast-dual-footswitch-sand-yellow-edition"
}