{
    "py/object": "mylib.pedal.Pedal",
    "id": "15960",
    "name": "Bloom",
    "image": "images/jackson-audio-bloom.jpg",
    "function": [
        "PreAmp",
        "Dynamics",
        "Equalizer"
    ],
    "manufacturer": "Jackson Audio",
    "current": "? mA / ? V / AC/DC",
    "cost": "$329 Price in €",
    "width": 70,
    "height": 125,
    "details": "Boost - Compressor - EQThe Bloom from Jackson Audio is a comprehensive dynamic engine that is designed to give guitarists maximum dynamic tonal control in ways never before possible.\nA three-fold device, the Bloom manipulates the dynamics of the instrument by way of precisely tuned compression, equalization, boost and sustain circuits which can be activated separately or in tandem with each other.\nCOMPRESSOR OVERVIEW\nAs a compressor, the Bloom features an optical limiting circuit that takes its inspiration from compressors designed during the golden age of vacuum tube circuits. Optical compressors as they are called, are known for their transparency and subtlety. While the Bloom can provide a very aggressive response at more extreme compression settings, its real strength lies in its ability to add a gentle sweetening and roundness to the tone as the optical circuit works to polish off any rough edges in the sound.\nBecause of its natural and touch responsive bloom, the Bloom is ideal for players who typically don’t use compression but want the ‘mastered’ response that optical compression gives a guitarists tone.\nThe frequency response of the compressor section is flat as a board and does not boost or cut any of your highs or lows. In fact for the demo videos we recorded, Dow Tomlin (Bass Player for Wynonna Judd) used the Bloom on his bass the entire time and loved it! Just like a well designed compressor should, the Bloom alters the dynamics of the guitar signal and not the tone. A good compressor should be felt and not heard!\nDual Compression – aka Slide Mode\nDuring the design phase of the Bloom we consulted with slide master Joey Landreth, of The Brothers Landreth fame, on what an ideal compressor for guitarists as well as slide players would be. After going back and forth with him it soon became clear that to build the ultimate compressor for guitarists we would have to include the option to run two compressors in series with each other to provide the legendary Lowell George slide tone. Lowell George, the bandleader/singer/songwriter/guitarist for the band Little Feat was famous for using two Urei 1176 compressors in series with each other to give his guitar near infinite sustain while still remaining crystal clean.\nWhen set to compression preset 5 or “Slide Mode” the aux compressor circuit is activated and placed in series ahead of the primary compressor. The tonal result of using two compressors in series is that notes will sustain almost endlessly and oftentimes break out into harmonic feedback while still remaining clear and clean! It ‘feels’ like you have an overdrive pedal on but the tone is still clean with endless sustain!\nHidden inside the Bloom, is a auxiliary compressor circuit that is identical to the main compressor circuit however without externally mounted controls. This aux compressor, which is set with a fast attack of 7.5ms, has two trimmers mounted on the right side of the pedal and are accessible when the cover is removed. These trimmers allow you to adjust the COMP and VOLUME settings of the aux compressor when using compression presets 5 and 6. More on compression presets later.\nClean Blend\nWhen more subtlety is desired from the compression circuit, we have included a BLEND control that allows the player to blend in their clean, unaffected signal back in with the compressed signal. One of the best features of the Blend control is that it allows the player to dial in a really aggressive compression setting and then blend some of their clean signal back in with it. This produces the effect of giving the note a very natural attack while slowly fading in the sustain that comes from running a high compression setting.\nCompression Presets\nIf you’re not a studio engineer, many of the more fully featured compressors on the market can be really intimidating and overwhelming with knobs for everything including attack, release, ratio, knee etc. As a guitar player I typically like to keep things as simple as possible and prefer to\nthink in terms of which settings would be the most appropriate for the style of music I’m about to play.\nNot all players are the same and not all songs require the same compression settings, that’s why we have designed the Bloom to have six compression presets that give the player six distinct options for their attack and release settings. These settings run the gamut from subtle to extreme and allow the player to quickly dial in the perfect compression setting for the next song.\nPreset 1 – WHITE: Limit Mode. Ultra fast attack (2.5ms) that clamps any signal and acts as a limiter.\nPreset 2 – GREEN: Country Mode. Fast attack (7.5ms) that is perfectly tailored for chicken picking or modern country.\nPreset 3 – MAGENTA: R&B Mode. Medium attack (50ms) that works well for staccato rhythmic parts.\nPreset 4 – BLUE: Ballad Mode. Slow attack (120ms) that is perfect for adding a gentle lift to the end of a phrase.\nPreset 5 – AQUA: Slide Mode aka ‘Joey’ Mode. Adds an additional internal compression stage in series before the primary compressor and allows for nearly endless sustain on clean guitar parts ala Lowell George from Little Feat.\nPreset 6 – ORANGE: Aux Compressor. The aux compressor is the internal compressor circuit that is used in Preset 5. There are two trimmers located on the side of the pedal that allow the user to adjust the COMP and VOLUME for this additional compression stage.\n\nNote that each compression preset has it’s own color setting on the COMP led. This led color will change as you play and will change more dramatically the harder you play and especially when higher settings on the COMP control are used. If you see the color change, that means that the compressor is ducking the level of what you are playing.\nSide Chain\nWhen Nigel and I were talking through ideas for the Bloom, it was important to him that we include the ability to trigger the compressor via an external source such as a click track or a kick drum etc. After kicking around the idea for a while, we agreed the best way to go about it was to include a Side Chain jack on the back panel of the Bloom.\nIn simple terms, if you plug a click track or an audio source into the Side Chain jack, the compressor will activate based on that signal and not the guitars signal. Take for instance, if you route audio from the kick drum into the Side Chain jack and allow the kick drum to activate the Bloom’s compressor. This will produce the effect of “ducking” the guitar whenever the bass drum is hit and will allow the bass drum to stand out more without having to adjust the mix to compensate. This technique is used to great effect on many Hillsong albums as well as EDM styles of music\nTo make the Side Chain feature even more useful, we used a stereo jack for the Side Chain that allows the player to insert another effect in the loop between the audio portion of the compressor and the detector (the portion of the compressor that detects incoming signals and adjusts the optical limiting circuit). The reason for including this loop is really to allow the player to experiment by adding different effects in the loop for different sounds. For instance, if you put an EQ in this loop, the compressor will only compress the frequencies that you have boosted and will not compress the frequencies that are cut. Experiment with this!\nCOMPRESSION CIRCUIT FEATURES:\nTransparent Optical (LA-2A style) limiting circuit with huge dynamic range.\nDual Compressors for the ultimate slide tone.\nBlend control that allows the player to blend in their clean (uncompressed) tone with their compressed tone.\nSix instant access presets with the following settings:\n    Preset 1: Limit Mode. Ultra fast attack (2.5ms) that clamps any signal and acts as a limiter.\n    Preset 2: Country Mode. Fast attack (7.5ms) that is perfectly timed for chicken picking or modern country.\n    Preset 3: R&B Mode. Medium attack (50ms)\n    Preset 4: Ballad Mode. Slow attack (120ms) setting\n    Preset 5: Slide Mode aka ‘Joey’ Mode. Adds an additional internal compression stage in series before the primary compressor. Allows for nearly endless sustain on clean guitar parts ala Lowell George from Little Feat.\n    Preset 6: Aux Compressor. The aux compressor is the internal compressor circuit that is used in Preset 5. There are two trimmers located on the side of the pedal that allow the user to adjust the COMP and VOLUME for this additional compression stage.\nSide Chain jack/loop that allows an external source (click track etc) to trigger compression. Side Chain loop can also be used with an external effect (an EQ for example) to tailor the response of the compression.\n\n3 BAND EQUALIZER OVERVIEW\nThe EQ circuit features a studio grade EQ that gives tremendous tonal flexibility to the BLOOM. Based on the legendary Baxandall EQ that is featured in countless studio EQ’s, the Bloom EQ takes this circuit and tailors it for guitarists! We spent tons of time on this EQ dialing it in so it would hit all the frequencies that guitarists need to adjust, and then sweetened it by removing the ear fatiguing highs and lows that can appear at extreme settings.\nEQUALIZER CIRCUIT FEATURES:\nStudio grade EQ with High Bandwidth and Flat Response at 12:00\n+/- 12dB Boost/Cut per control\nCenter Detents on the pots that make it easier to get back to a neutral or flat response.\n\nBLOOM OVERVIEW\nThe Bloom circuit is one of the most exciting parts of the Bloom! Designed as both a level booster and sustainer, the Bloom can work as a set boost by quickly pressing and releasing the Bloom footswitch, or by pressing and holding the Bloom footswitch, the Bloom circuit will slowly ramp up the level to the level set by the boost. This ramp up time, which is programmable, can be used to increase sustain on held notes or to match the dynamics in a song. Once the ramp up is complete, pressing and holding the Bloom footswitch again will fade the level back down to unity.\nBLOOM CIRCUIT FEATURES:\n0-20dB Boost Available (quick press on Bloom footswitch)\n0-20dB Bloom Available (long press on Bloom footswitch)\nTrue Boost Circuit. Fully counter clockwise position is unity level.\nTotally flat EQ down to sub audio frequencies.\nProgrammable Ramp Up/Down Time.\n\nEXTRA BLOOM FEATURES:\nProgrammable True Bypass or Buffered Bypass\nProgrammable Boot-Up State (which effect(s) are active at boot-up)\n\nhttp://jackson.audio/bloom/",
    "hrid": "jackson-audio-bloom"
}