{
    "py/object": "mylib.pedal.Pedal",
    "id": "13180",
    "name": "Charlie Brown V4",
    "image": "images/jhs-charlie-brown-v4.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "JHS",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 64,
    "height": 120,
    "details": "Every guitarist loves the sound and feel of a Marshall JTM45 amp head. And with the JHS Pedals Charlie Brown V4 amp-in-a-box, you can put that same thick, chewy, old-school rock tone onto your pedalboard.Every guitarist loves the sound and feel of a Marshall JTM45 amp head. And with the JHS Pedals Charlie Brown V4 amp-in-a-box, you can put that same thick, chewy, old-school rock tone onto your pedalboard. In fact, we even outfitted the pedal with a Marshall-style 3-band tone stack to achieve a tone that would please Clapton himself. Whether you’re trying to replicate the Woman Tone, the character of Hendrix’s cranked walls of Marshalls, or Gary Moore’s higher-gain sound, they’re all waiting for you in the Charlie Brown V4. Grab one today, and turn your rig into a legendary JTM45.\nVintage British crunch for your pedalboard\nMore and more, guitarists like you are leaning on pedals to supply their overdriven tones. They need stompboxes that will completely change the character of their amplifiers on a dime. For vintage crunch and British attitude, there simply isn’t a better pedal than our Charlie Brown V4.\n\nTurns any amp into a gritty JTM45 stack\nGo from ‘60s-style crunch to thick and liquid rock tones with a twist of the Drive knob\nDrive and Volume control interact the same as a master volume amp head\nBack off your guitar’s volume to control your gain levels without losing clarity\n\nMarshall-style tone stack\nTo really nail the ultimate JTM45 tone, we added Marshall-style control to the Charlie Brown V4 overdrive. Now, not only will this pedal mate perfectly with your current clean amp tone, but you’ll be able to find the exact JTM45 sound you need for your application. And because the Charlie Brown reacts just like a classic tube amp, it’s even a perfect candidate for stacking with another overdrive.\n\nFine-tune your tone with controls for Bass, Middle, and Treble\nActive controls boost and cut their selected frequencies\nStacks beautifully with overdrive pedals for even more shades of grit\n\nhttps://www.jhspedals.com/products/guitar-pedals/charlie-brown-2/",
    "hrid": "jhs-charlie-brown-v4"
}