{
    "py/object": "mylib.pedal.Pedal",
    "id": "13175",
    "name": "Bun Runner",
    "image": "images/jhs-bun-runner.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "JHS",
    "current": "? mA / ? V / AC/DC",
    "cost": "$315 Price in €",
    "width": 119,
    "height": 94,
    "details": "On the left side you will find the JHS Astro Mess Fuzz and on the right side a heavily modified Tonebender that is oozing with germanium fuzz, warmth, character and fullness that is only found in the Bunrunner.When Josh began working with Switchfoot’s Drew Shirley for his Hello Hurricane touring rig, the number one need was to have a single pedal that could do a lot of fuzz! The end result was the “Bun Runner 2-in-1”. On the left side you will find the JHS Astro Mess Fuzz and on the right side a heavily modified Tonebender that is oozing with germanium fuzz, warmth, character and fullness that is only found in the Bunrunner.\nThe Astro side gives you all the modern, gated and heavy fuzz you could ever use as well as 8 bit tones galore when needed. The Astro tilts its hat to classic high gain fuzz pedals like the Ampeg Scrambler, Kay Fuzz and Octavia due to its blistering amount of gain and volume on tap. Flip the \"Gate\" toggle up and find yourself splattering notes all over the place with style as the overal structures seem to beautifully fall apart under your pick attack. The Tonebender side is a real achievement in Tonebender style circuits, and it can do everything from Zeppelin riffs to lush natural overdrive with ease. The bias knob is very different than what is usually seen out there allowing big hefty overdrive drive tones all the way to a thick wall-of-fuzz heaven! You will also find that the tone control is actually useful and more of a tone shaping tool than a knob that removes harshness. When you add these two circuits together, you may find yourself playing things that you didn’t know your hands could play!\nThe controls for the Tonebender side are Volume, Tone, Fuzz and Bias, while the “Astro Mess” side is identical to the single unit here. The new V2 has our Order Toggle switch so you can choose what circuit comes first when they are both on at the same time. Oh yeah, the Tonebender is a true positive ground circuit, but thanks to our Voltage reversal circuitry you can run this pedal on a normal 9v supply with your other pedals instead of some funky power supply like most germanium fuzz pedals out there!\nhttps://www.jhspedals.com/products/discontinued-rare/bun-runner/#!lightbox[260]/0/",
    "hrid": "jhs-bun-runner"
}