{
    "py/object": "mylib.pedal.Pedal",
    "id": "14746",
    "name": "Unicorn",
    "image": "images/jhs-unicorn.jpg",
    "function": [
        "Chorus",
        "Phase Shifter",
        "Tremolo"
    ],
    "manufacturer": "JHS",
    "current": "? mA / ? V / AC/DC",
    "cost": "$300 Price in €",
    "width": 119,
    "height": 94,
    "details": "The Unicorn is bursting with all the lush and washy pulsations that changed what the electric guitar could sound like in the 1960s.Pink Floyd’s “Breathe,” Jimi Hendrix’s “Star Spangled Banner live at Woodstock 1969,\" and Robin Trower’s “Bridge of Sighs” cemented the sound of a photocell-based vibe effect as an electric guitar standard. The JHS Pedals Unicorn is our version of this heralded effect, continuing the inspiring modulation/phasing/rotary sounds that never fail to push musical boundaries. And just like the originals, we included a toggle for choosing between a Uni-Vibe* effect and a traditional vibrato setting. What sets Unicorn apart from all other vibe-style circuits is that it is the first-ever fully analog, photocell-based vibe with tap tempo as well as ratio, external tap control, and external rate control via expression pedal (optional). And the Unicorn does it all with only four knobs and a mini-toggle switch. In a day and age when everything has been seen and done, we bring you the first-ever, 100% analog vibe photocell modulator with onboard tap tempo. You’re welcome.\nSounds as good as you remember\nThe Unicorn is bursting with all the lush and washy pulsations that changed what the electric guitar could sound like in the 1960s. And this is no digital emulation. The Unicorn sports the real-deal, analog photocell topology of the original units.\n\nSounds like the originals because it’s built like the originals\nAll-analog signal path delivers a warm, touch-sensitive tone\nDry/Wet toggle selects between a Uni-Vibe* and vibrato effect\n\nIn-depth tempo control\nThere are other analog vibe pedals and there are pedals with tap-tempo control, but - if we’re allowed to gloat for a second - the JHS Unicorn is the first to put ‘em together. Add optional external speed control and a ratio knob that determines the rhythmic subdivisions - or as we like to say, how much fairy dust enters into the flux capacitor of the Unicorn - and you have one of the most versatile vibe pedals on the market.\n\nControl the rate of the effect with the Speed knob or onboard tap-tempo footswitch\nWant quarter note, dotted eighth, or triplet rhythms? They’re all found on the Ratio knob\nLED indicator notifies you of the effect’s tempo, even when disengaged\n\nExternal tempo and expression control\nBut wait, there’s more! One of the things that makes the vintage Shin-ei* Uni-Vibes* so desirable is your ability to control the effect’s rate in real time with an external expression pedal. How could we not include that!? And to go one step further, you can slave the pedal to other tap-controlled pedals for rhythmic consistency across all your effects.\n\nInternal Tap/Expression mini switch controls the side-mounted Tap/Exp TRS jack\nExpression pedal control of the Unicorn’s rate in the Exp setting\nUse an external source to control the rate in the Tap Out setting (Works great with our Panther Cub Delay, Emperor Chorus pedals)\n\nCouldn’t be easier to use\nOne of the things we’re most proud of with the Unicorn Uni-vibe* Photocell Modulator is how easy it is to dial up the exact pulse of a mystical Unicorn running across a field of 4-leaf clovers… but only if you dare.\n\nFour knobs and a mini toggle are all you need for a world of syrupy, modulated tones\nLeft two controls are your tone, right two controls are your speed, toggle is your effect. It’s that simple\n\nWhen everything has been done and everything has been seen, we bring you a first ever 100% analog signal path Uni-vibe* Photocell Modulator w/ Tap Tempo.\nhttps://www.jhspedals.com/products/guitar-pedals/unicorn/",
    "hrid": "jhs-unicorn"
}