{
    "py/object": "mylib.pedal.Pedal",
    "id": "12627",
    "name": "Colour Box",
    "image": "images/jhs-colour-box.jpg",
    "function": [
        "PreAmp",
        "Distortion",
        "Equalizer"
    ],
    "manufacturer": "JHS",
    "current": "? mA / ? V / AC/DC",
    "cost": "$399 Price in €",
    "width": 89,
    "height": 127,
    "details": "Console flavored Preamp/Fuzz\"Revolution\" by the Beatles, Led Zeppelin’s “Black Dog,” U2, Spoon, Pink Floyd, Motown, Quincy Jones, Nirvana, Steely Dan, Neil Young, Tears For Fears, and Tom Petty (the list is endless), all feature the unmistakable sound of plugging an electric guitar directly into a Neve* recording console. The Colour Box puts the tone of those legendary pieces of recording equipment into your guitar rig whether performing live or in the studio. By using 100% analog circuitry that is true to the design and schematic of vintage Neve* circuitry, we reproduced everything that makes the Neve preamps magical. The Colour Box’s two gain stages are in series to produce beautiful clean tones and can also be pushed hard to destroy any signal into a beautiful fuzzy mess. But of course we didn’t stop there. With ¼” and XLR inputs and outputs, the Colour Box can also cover all the ground that you would expect a high-quality studio preamp to cover. Whether you’re plugging in your microphone, bass, keyboard, electric, or even your acoustic guitar, make sure you have a Colour Box close by.\nGloriously gritty “direct in” tone\nThere’s just something magical about the buzzy goodness of a guitar plugged right into a Neve* preamp. It has powered some of the biggest rock ‘n’ roll hits of the past 50 years. And thanks to the JHS Pedals Colour Box, now you can put that sound right on your pedalboard.\n\nReplicates the tone heard on such hits as “Cinnamon Girl” and “Another Brick in the Wall Pt. 2”\nPre Volume (labeled \"Pre-Vol\") can be used the same as you would a Drive knob on an overdrive pedal.\nStep** control is a 5-position gain switch that changes the gain of each preamp stage\nOver 39dB of gain on tap for rich harmonics and body\n\nIndispensable in the studio\nFar from just another fuzz, the Colour Box is also making waves in studios around the world as a top-quality preamp. Go ahead, plug your microphone, bass, keyboard, acoustic, or any other instrument into it. You’ll be greeted with a three-dimensional sound that adds clarity and warmth to your track.\n\nNeve* console sound in a handy pedal format\nConveniently outfitted with selectable ¼” and XLR inputs and outputs\nVariable Hi Pass circuit (60Hz-800Hz) cuts low frequencies to precisely tailor your tone\nUtilizes the same topology and discrete gain stage found in the Neve* 1073\nA high-quality Lundahl transformer adds weight, heft, and a 3D quality to any input source\nIndependent outputs split your signal (extremely handy to send a direct signal to front-of-house).\n\nJHS Pedals Colour Box Notes:\n- The Colour Box runs on 18V DC negative center power. We supply an adapter, but you can also use any standard 18V DC pedal power supply or voltage doubling cable like this Voodoo Lab.\n- The Colour Box does not supply phantom power, so you will need to purchase a quality phantom power supply to run in line with your Colour Box if you intend to use a phantom powered microphone or other device.\n- The input-selector switch located above the input jack lets you choose line or microphone input. In the down position, it is in Instrument mode. In the up position, it is in XLR mode.\nSome Noteworthy \"Direct In\" Guitar Tones to Check Out:\n\"Revolution\" the Beatles\n\"Black Dog\" Led Zeppelin\n\"The Beast And Dragon, Adored\" Spoon\n\"Cinnamon Girl\" Neil Young\n\"Highway 61\" Bob Dylan\n\"Reelin’ in the Years\" Steely Dan\n\"Strange Brew\" Cream\n\"Another Brick in the Wall Part 2\" Pink Floyd\n\"Bodysnatchers\" Radiohead\n\"Engines of Creation\" Joe Satriani\n\"LA Woman\" the Doors\n\"Territorial Pissings\" Nirvana\n\"Sgt. Peppers\" the Beatles\n\"Get Lucky\" Daft Punk\n\"I’m Coming Out\" Diana Ross\n**Step control increases the gain by the following:\n1 is X 18 dB\n2 is X 23 dB\n3 is X 28 dB\n4 is X 33 dB\n5 is X 39 dB\nNever before has a guitar pedal crossed into this territory to bring the tones of pro audio to your pedal board.\n*The word/name Neve® is a registered trademark of AMS Neve ltd.\nThe JHS Colour Box pedal is in no way affiliated with AMS Neve ltd.\nhttps://www.jhspedals.com/products/bass-pedals/colourbox/",
    "hrid": "jhs-colour-box"
}