{
    "py/object": "mylib.pedal.Pedal",
    "id": "30758",
    "name": "Baatsin",
    "image": "images/joyo-baatsin.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Joyo",
    "current": "30 mA / 9 V / DC / Negative Center",
    "cost": "$60 Price in €",
    "width": 125,
    "height": 79,
    "details": "8 Mode OverdriveThere are so many classic overdrive and distortion pedals out there, we just wanted a pedal board with them all on. We selected our favourite best selling JOYO overdrive pedals that are all based on the classics.. With 8 Legendary Overdrives, we have put them together to make the Baatsin, an analog true bypass overdrive representing some vintage and modern classics.\nThe name of this pedal is taken from the Chinese legend of the 'Eight Immortals' eight Taoist warrior gods.JOYO Overdrive Pedal\nTurn the selector on the JOYO Baatsin and you instantly get 8 legendary analog overdrives that capture all the classic vintage pedals in one box. Achieve all the tones from fat and warm drives to all the gain of a distortion pedal on instant tap.\n3 controls to adjust each of the OD settings; Volume, Tone, Gain. Inside The Baatsin you will discover the 8 legends that are:\nT.OD - Timmy Overdrive a huge range of gritty, textured tones that enhance your rig's sound while preserving its fundamental voice.\nSweety - The Sweet Baby Overdrive a sweet tasting low gain overdrive pedal. It is designed to overdrive distorted amplifiers and give dynamically controlled light overdrive on clean sounds. Made by the Angry Bees.\nB Boost - The Boost Overdrive is a beautiful smooth sounding drive/boost pedal that it perfect for giving your tube amp a bit of extra grunt\nT808 - We cant do without our 808 style Classic Vintage Overdrive on our board. The pedal has a characteristic mid-boosted tone popular with blues and rock players. The \"legendary\" Tube Screamer has been used by countless guitarists to create their signature sound, and is one of the most successful, widely copied, and \"modded\" overdrive pedals in the history of the electric guitar ever !\nOverDrive 1 - This overdrive has got Bruce Springsteens nickname all over it. It was the founding yellow pedal of this classic pedal range launched in 1977, its fatter than a typical overdrive but with  gain cranked its an excellent distortion .\nCrunchy - Its a box of Crunch alright, way more than an overdrive, breaking up gradually into a giant sonic crunching tone of a big classic British amp.\nRioter - it sure is! turning into a versatile high-gain distortion pedal with the sonic characteristics and touch sensitivity of a high quality 100 watt tube\nOC Drive - It's a JOYO Ultimate classic everyone just obsesses over.\nhttps://www.joyoaudio.co.uk/baatsin-overdrive-guitar-effect",
    "hrid": "joyo-baatsin"
}