{
    "py/object": "mylib.pedal.Pedal",
    "id": "30027",
    "name": "Atmosphere",
    "image": "images/joyo-atmosphere.jpg",
    "function": [
        "Reverb"
    ],
    "manufacturer": "Joyo",
    "current": "140 mA / 9 V / DC / Negative Center",
    "cost": "$89 Price in €",
    "width": 67,
    "height": 109,
    "details": "ReverbThe JOYO digital reverb guitar effect pedal features 9 built in reverb types, including:\nSpring Reverb\n    Church Reverb\n    Plate Reverb\n    Eko-Verb Reverb\n    Shimmer Reverb\n    Comet Reverb\n    Rewind Reverb\n    Forest Reverb\n    Pulse Reverb\nOn the JOYO Reverb pedal you will find the controls of MIX, DECAY and TONE.  We also added in a Modulation effects depth control dedicated for adding in some additional time and modulation effects to a few of the reverbs available.\nA unique feature of the Atmosphere reverb pedal is the TRAIL function switch, this is for switching on, or off the Trail function. The trail allows the effect tone to fade out and sound much more natural between switching the pedal on and off. So you decide how you want it, you can opt for a natural fade, or fast cut off.\nYou can use the Reverb on more than just electric guitar, use the reverb effect on acoustic guitar, classic guitar, bass guitar, vocals, drums, keyboards & synths. You name it this pedal creates the atmosphere you want, simulating a small room to being trapped inside a trailing comet.\nWith 9 reverbs to experience in one guitar effect pedal, you can find all the reverb effects you will need\nPLATE: Studio style plate reverb  - Plate reverbs were one of the first types of artificial reverbs used in recording. They used a steel plate under tension supplied by springs at the corners where the plate was attached to an outer shell. Plate works well on vocals being bright and clean.\nCHURCH: Huge room reverb, the acoustics of a church can be huge, so expect the atmosphere to really\nSPRING: Classic spring reverb tank – perhaps one of the first uses were by Fender in their Vibroverb amp way back in 1963, so if it’s the classic vintage tones you are seeking the JOYO spring reverb is the one for you.\nEKO-VERB: Combines echo and reverb, is it a delay or a reverb? Well both are indeed time-based sound effects but delay is the repetition of the signal after a period of time and the number of repetitions depending on the feedback level. Reverb is the natural result of soundwaves bouncing off every surface, hard, soft, tall, short, etc. Put these two together and this is what we then hear and perceive as the room's acoustics the Eko-Verb. Using the Modulation dial brings in the additional delay & repeat speed.\nSHIMMER: It feels like the shimmer in a dream. Put yourself in the soundscapes of  Brian Eno, is produced by layering a tail of reverb that is pitched up an octave and sent through a feedback loop on top of the dry signal.\nCOMET: As if the comet orbits between your amp and guitar, its out of this world, swirling, graduated modulation, ethereal. Using the modulation dial brings in a sense of flanger/phaser effect.\nREWIND: It feels like you’re rewinding the tape, rewinding the reverb forward, a for-verb? Its starting to get bit trippy..\nFOREST: It feels like have a sunbath in the forest, an ambient atmosphere. Bring in the modulation for a little more chorus and hear the birds sing.\nPULSE: similar to the fluttering pulse  - the sound flutters and pulses as the reflections bounce back and forth along the length of the spring. Bring in the Modulation and the spring starts to pulse faster.\nSpecifications\n   Dimensions: 1096748mm\n    Weight:248g\n    Input Impedance:2.2M Ω\n    Output Impedance:100 Ω\n    Rated current consumption:140mA\n    Working Voltage: DC 9V (centre negative)\nhttps://www.joyoaudio.co.uk/joyo-atmosphere-digital-reverb-9-modes-r-14",
    "hrid": "joyo-atmosphere"
}