{
    "py/object": "mylib.pedal.Pedal",
    "id": "11604",
    "name": "JF-02 Ultimate Drive",
    "image": "images/joyo-jf-02-ultimate-drive.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Joyo",
    "current": "6 mA / 9 V / DC / Negative Center",
    "cost": "$40 Price in €",
    "width": 72,
    "height": 120,
    "details": "Joyo JF-02 Ultimate DriveThe overdrive between distortion and overdrive is different from the usual diode clipping circuit. It can create more headroom, tube amplifier sound quality effects, subtle changes in volume, and complex harmonic space effects. Ture bypass design minimizes sound loss.\nA pedal for everyone! Surprisingly subtle at low 'drive' settings but turn it up and it becomes a monster and like the vintage overdrive, it's easy to use and has no discernible background noise. This pedal is great for feedback, picking out your guitar's natural harmonics effortlessly and the high/low switch will give you that extra kick without having to change your settings\nThe JOYO Ultimate Drive pedal nails the timeless tones of the classic rock era. The \"ocd pedal,\" as it has become known and well reviewed. The pedal has two settings - high and low - which allow for plenty of flexibility. The tone it creates is soothing and sweet when just a little bit of gain is dialled in. And then you start to lay into the pedal (either with another pedal up front or by turning up the drive and volume) and the ultimate drive really begins to shine.\nDesigned with the goal of recreating the tone of a tube amplifier at volume, the ocd's distortion is somewhat of a hybrid when it comes to solid state or vacuum tube tone. The real deal when it comes to aesthetics, sound and construction - JOYO's ultimate drive pedal features a metal shell-casing, quality connectors and sturdy controls.\nThe JF-02 is true-bypass, has an led on/off indicator light, and a hi/low tone switch. This pedal will provide years of service and will turn heads as the midrange cuts through the crowd. JOYO's ocd or ultimate drive distortion/overdrive pedal comes with a 9V battery, so its ready for action right out of the box.\n1.Ultimate drive(OCD) is a cross between a distortion and overdrive, different from the regular diode clipping circuits.\n2.High / Low tone switch.\n3.True bypass design to minimize tone loss.\n4.LED power indicator.\n5.Gain, Level and Tone controls.\n6.Powered by 6F22 9V battery( not included).\nSpecifications:\n1.Input impedance: 1 Mω\n2.Output impedance: 1 kω\n3.Running current: 6 mA\n4.Voltage: 9V battery/adapter\n5.Dimension: 120 x 72 x 55 mm\n6.Net weight: 290g\n7.Color: black with red\nPackage including:\n1 x JOYO JF-02 Guitar Ultimate Overdrive Effect Pedal\n1 x user manual\nhttps://www.joyoaudio.com/product/51.html",
    "hrid": "joyo-jf-02-ultimate-drive"
}