{
    "py/object": "mylib.pedal.Pedal",
    "id": "26156",
    "name": "XVI",
    "image": "images/joyo-xvi.jpg",
    "function": [
        "Chorus",
        "Pitch Shifter"
    ],
    "manufacturer": "Joyo",
    "current": "90 mA / 9 V / DC / Negative Center",
    "cost": "$90 Price in €",
    "width": 67,
    "height": 109,
    "details": "Polyphonic Octave GeneratorJOYO XVI Polyphonic Octave Guitar Effect Pedal\nOf all the wonderful developments in JOYO Technology the XV1 Polyphonic Octave guitar effect pedal is one of the most exciting.\nEveryone loves a good octave, until now we have had our OCHO monophonic pedal which allowed 2 octaves down, both  add some meat to any solo, or to make a big riff sound even bigger. However, while often sounding awesome in the right context, the monophonic analog octave effects are only good for single monophonic notes.\nSometimes something more than the monophonic octave is needed, this is where the JOYO XV1 polyphonic pedal comes into full force, the pitch and modulated effect will allow anything from dry pitch shifting, sub down or up high and introducing the MODulation control to create some impressive polyphonic organ sounds.\nThe pedals Mod control is the thing you twiddle to get the big room filling organ tones, mixing the octave up and down to create some really fat sounding choir effect. Add a little tremolo, delay or reverb and you have a cool fake organ that will sound like a sweeping synth. Playing around with this pedal will take your guitar from its clean tone to another dimension, people will wonder where the synth is hidden.\nThe amount of functionality in this new pedal from JOYO is guaranteed to fatten up your tone, add some rich texture and introduce some polyphonic goodness.\nThe JOYO XVI polyphonic guitar effect pedal is part of the R Series of effects. The Revolution series pedals all feature metal housed stompbox. The R Series are the 4th generation and all feature some very cool ambient LED lighting.\nThe lights can be toggled from a switch on the rear of the pedal.3 modes of lighting are available to adjust when the ambient lighting comes on.\n'Sync' to the foot switch - The LED ambient lighting on the front and rear of the pedal with shine bright when the foot switch is pressed, also illuminating the LED effect indicator on the top of the pedal.\n'Always' - The lights are always on, but the pedal is only activated when you press the foot switch and the LED effect indicator comes on.\n'Off' - Okay, so Tron may not be your favourite and you want to stick to something a little less futuristic. The lights are off, the LED effect indicator comes on when you stomp on it and activate the pedal..\nThe pedal features controls for mixing Sub Octave Control, Up Octave Control to adjust pitch. Dry control increases the input dry volume.\nModulation Control to unleash the organ tones.\nLED Effect indicator - On when the foot switch & pedal are active\nFoot switch\nDC input on the rear.\nDimensions : 109mm x 67mm x 48mm\nWeight : 248g\nInput Impedance :2.2 M\nOutput Impedance : 100\nRated current : 90mA\nVoltage : 9v Centre Negative power supply\nhttps://www.joyoaudio.co.uk/joyo-xvi-polyphonic-octave-guitar-effect-pedal",
    "hrid": "joyo-xvi"
}