{
    "py/object": "mylib.pedal.Pedal",
    "id": "19988",
    "name": "Memphis Sun",
    "image": "images/keeley-memphis-sun.jpg",
    "function": [
        "Delay",
        "Reverb"
    ],
    "manufacturer": "Keeley",
    "current": "? mA / ? V / AC/DC",
    "cost": "$179 Price in €",
    "width": 60,
    "height": 112,
    "details": "Lo-fi Reverb, Echo, and Double Tracker Effects PedalKeeley Memphis Sun – Lo-Fi Reverb, Echo and Double-Tracker\nHead into the Memphis Sun and bask in the tones of the 1950s!  Studio sounds of the 1950s and more.  Small Room Reverb, Slapback Echo, Futuristic Double Tracking.\nAh, the sounds of Rock and Roll….\nClickety Clack,\nnoun:\nA rhythmic, swiftly paced succession of alternating clicks and clacks, as the sound produced by the wheels of a train moving over tracks. I hear that train a comin’\nMemphis Sun!\nThe new Memphis Sun – Lo-Fi Reverb, Echo and Double-Tracker is our second studio themed pedal.  Like the Keeley 30ms ADT this pedal gives you a wealth of tones for capturing that classic Rock-and-Roll sound as well as sounds you’ve not heard before.  It’s NeoVintage. It’s an Echo and Reverb pedal.\nToggle through the different effects presets:\nSLAPBACK 600 – Echo for long delays\nSUN MODE – Auto Track-Doubling and slapback with short delays\nROOM   –    Studio simulation reverb\nBoth of the ECHO 600 and SUN MODE effects have a Room Reverb.\nIt’s a one-knob, rock and roll type of room reverb.\nSLAPBACK 600\nRock and Roll is the Devil’s music, right? So of course we made the delay time up to 666ms to simulate some unearthly echo machine that never really existed. Filtering in the Slackback mode is done in stages. First, we heavily filter the response at 1 kHz then compress the thing. Remember the concept: pack a bunch of sound in a small room and it compresses. Next, we filter it again at 1 kHz !  Sounds like Rock and Roll, right? Aaron Tackett is our Rock and Roll Doctor of DSP here at Keeley. Not only is he devilishly good looking, he has a way of making waves look good — adding curves so to speak. He has added 2nd and 3rd order harmonics to this mix to simulate tape response and equipment distortions. Waves folded back on themselves.  You’re gonna love his curves.\nTime 30-666ms m/ m/\nRegen  As Jack White says: “Three.”  Up to three repeats. Or sometimes six….\nReverb Old Rock-and-Roll Room Reverb.\nSun Mode\nLet’s Do it Twice Mama, It’s Alright!  Automatic Double Tracking (ADT) was not available in the 1950s, but we sneak it in here because it makes a wonderful sound. And, if you lengthen the time, it goes right into slapback territory which is at the heart of Country and Rock and Roll guitar sounds.  Like our Keeley 30ms, this pedal will do ADT.  The Memphis Sun creates a vintage-voiced double-track in mono.  Your guitar-playin’ “Gemini-Twin” has a very warmed-up tone.  Adjusting the Time Control lets you easily create anything from Double Tracking to Slapback with up to 180ms of delay time.\nTime   Delay Time is 0-180ms.  For Automatic Double-Tracking set this control at the second mark or lower, 0-30ms. For slapback echo 30-180ms sounds great. The knob markers notate 0,30,60, 90, 120, 150, and 180ms\nRegen Modulation for the ADT. Set to OFF for NO Rate or Depth.  Increasing this control increases both the Rate and Depth of “Tape” modulation.\nReverb It’s Still Rock-and-Roll Room Reverb to Me\nRoom\nThe Room Reverb simulates a small 33′ by 18′ asbestos-tiled room so filled with music the sounds actually get compressed.  We take into account the frequency response of the mics used back then. The RCA 77 is loosely simulated by a group of filters including a HPF = 300 Hz and LPF = 8 kHz. Many artifacts are incorporated in our room reverb. And second and third order harmonics are added to make sure it sounds just right.\nTime is the Pre-Delay amount: 0-150ms of pre-delay. This allows for a slapback sound as the first reflections come into focus.\nRegen is the Tone control: this is an active filter +/- 10 dB and is centered around 1.1 kHz.\nReverb is the Depth control for the reverberations.",
    "hrid": "keeley-memphis-sun"
}