{
    "py/object": "mylib.pedal.Pedal",
    "id": "11490",
    "name": "Compressor Pro",
    "image": "images/keeley-compressor-pro.jpg",
    "function": [
        "Dynamics",
        "PreAmp"
    ],
    "manufacturer": "Keeley",
    "current": "50 mA / 9 V / DC / Negative Center",
    "cost": "$328 Price in €",
    "width": 119,
    "height": 94,
    "details": "Powerful, with Attack, Release, Auto Mode, Hard/Soft KneeKeeley Compressor Pro.  The stomp-box sized compressor/limiter is made in Oklahoma, USA and engineered to be an indispensable tool for your musical endeavors.  It is in no way limited to be used with only guitar.  It has been designed to work as a studio compressor accepting any range of inputs and a frequency response and noise level matching the finest compressors made.\nIntroduction of Features\nCompression LED Display – 7 Segment LED display for fast and accurate metering of compression and gain reduction.  Gain Reduction Levels of -1dB to -20dB are indicated.\nThreshold LED Indicator – Bi-Color LED to indicate when compression is initiated and released.\nExact RMS Analysis (ERA) – Senses the true RMS value of the input program material such as your guitar, bass or drum machine.\nHard/Soft Knee Compression – Hard Compression for limiting or adding sustain, soft knee or Komfort Kompression for gentle compression, keeping performances lively and natural sounding without potential phase issues in parallel, or blending style compression.\nAuto Mode – Program dependent Attack and Release times.  Set to Auto ON for worry-free performance and automatic Attack and Release times.\nTrue-Bypass – No tone or signal loss when OFF\n\nGeneral Compressor Usage\nThe Keeley Compressor Pro is designed to be used at home or in the studio for creating full sounding recordings of any instrument.  In live situations, the Compressor Pro can be used to achieve full sounding, polished performances as well as protect amplifiers and speakers from overload.  The Comp Pro is designed to work with any instrument from voice and guitar to keyboard, bass, or drums.  Use it when creating a podcast or YouTube videos to maintain professional performance levels.  Use it around the home to create tons of sustain while at low volumes or low gain settings!\nDevice Controls\nTHRESHOLD, RATIO, ATTACK, RELEASE, GAIN, KNEE, & AUTO\nTHRESHOLD Control and LED – This is probably the most important control on the Comp Pro.  It is adjusted to determine when the compressor is working or when sound is being passed through unaffected.  The Threshold control is turned down or CCW until the THRESHOLD LED turns Red as you play your instrument.  When the THRESHOLD LED turns Red the Comp Pro is actively compressing your signal.  If the LED is Green, the Comp Pro is not compressing and sound is passed through unchanged.\nRange of Adjustment is from -50dBu to +10dBu.  2.45mVRMS to 2.45VRMS – Pro Audio (studio) Levels are +4dBu Consumer Audio Levels are -10dBu.  Passive guitar or bass pickups are typically about -25dBu to 2.5dBu.\nRATIO Control – “the Compression Knob”, Ratio is the amount of compression you set the Comp Pro for.  You can set it from No Compression (1:1) when all of the way off or CCW.  You can set it as high as Infinite Compression (∞:1) which means that the output level will never increase in output level no matter how loud the input.  This type of setting can be used for hard-limiting to protect recording or speakers or in some cases for guitar effects like chicken-pickin’.\nATTACK Control – Attack Times between 0.15ms and 150ms.  Controls the time it takes for the Comp Pro to start compressing.\nRELEASE Control – Release Times between 0.1s to 3s.  Controls the time before the Comp Pro releases or stops compression .\nGAIN Control – This is the output level of the compressor.  It does not affect the compression controls like THRESHOLD, RATIO, ATTACK or RELEASE.  It is for make-up gain if you set for heavy compression gain reduction.  +20dB of boost is possible.\nKNEE Switch – Hard Knee/Soft Knee.  Hard Knee Compression follows a hard fast rule: If THRESHOLD is met, then Compress at this RATIO.  Soft Knee is Komfort Kompression.  It’s a way to keep compressed guitar or instrument parts sounding lively and dynamic, without the “blanket” of compression found in many types of compressors.\nAUTO Switch – OFF/ON – Set to ON in most cases for automatic setting of Attack and Release Times.  This will sound natural and work in a very large number of cases.  The Comp Pro looks at the input signals like guitar, bass, vocals or drums and determines the correct attack and release times depending on what you’re playing and what signal levels are being detected.\nGood Compression Settings\nSMOOTHING – Changes in signal level happen when the singer moves away from the microphone or when a guitar player may not use perfect technique in controlling their dynamics, i.e. less than perfect picking hand technique.  To smooth changes in dynamics use the Comp Pro for low to medium compression.  Set AUTO Switch to ON.  Adjust the Compression RATIO Control to 2:1 to 4:1 for example.  Set the Gain Reduction LEDS by adjusting the THRESHOLD Control to indicate 3-9 dB of gain reduction on the 7 Segment LED Bar.  Adjust GAIN Control if needed.  Set KNEE Switch to SOFT.  Now play slow and steady chord work, list to how toggling the KNEE switch back and forth Hard/Soft affects your tone and the attack or punch of the notes as well as the release.\nSUSTAIN – To add sustain to guitars or keyboards start with a higher Compression RATIO setting for example 10:1 to ∞:1,  Set THRESHOLD Control so that THRESHOLD LED turns Red for average level of your guitar or performance, the LED stays red about half the time.  You can set the KNEE Switch to HARD or SOFT, SOFT may seem more transparent.\nCHICKEN PICKING COMPRESSION – Set RATIO Control to 5:1 to 10:1, a quick RELEASE Time of .5s to 1s. ATTACK Time for quick attack 10-50ms and THRESHOLD Control set to give you 9-12dB of Gain Reduction/Compression on the 7-Segment COMPRESSION LED Array.  This will typically give you compression artifacts or effects like a breathing or pumping sound.\nBASS BOOM AND SLAP – For a punchy bass guitar sound set the Comp Pro for a medium to high Compression RATIO (6:1 to 10:1) and adjust the THRESHOLD so that the -12dB and sometimes -20dB COMPRESSION LEDs are lit while playing.  Set KNEE to Hard mode.  That will make the bass punchy and slap a bit harder, reducing boominess.  Try Soft KNEE for a a different feel.  Set AUTO On.\nPREVENT DIGITAL DISTORTION – Set Keeley Compressor Pro as a Hard Limiter by turning RATIO control all of the way up to Infinity to One compression ratio.  Set KNEE for Hard. By adjusting the final Gain level to your clipping lights on the digital recorder, you can insure you won’t ruin recordings or get unwanted distortions.\nSPEAKER PROTECT (Concerts, Churches, Sound Systems and P.A.s) – You can use the compressor as above as a Hard Limiter.  If when playing you hear distortions from your sound reinforcement equipment you can reduce the THRESHOLD, increase RATIO, and reduce GAIN to achieve perfect results.  This is where it might be nice to use your Keeley Compressor Pro as the last effect in your signal chain as it can prevent different effects from getting too loud or being added together to drastically increase output volume.\nNEVER LEAVE HOME WITHOUT YOUR KEELEY COMP PRO – The Compressor Pro makes the perfect booster or driver for your rig!  You can always set the RATIO control for 1:1 compression (otherwise known as No Compression) and use the GAIN to push your amp, pedals, speakers, or other guy out of the way!  Once you have learned your new Comp Pro there will never be a reason not to use it.\nhttps://robertkeeley.com/product/keeley-compressor-pro-namm-2015/",
    "hrid": "keeley-compressor-pro"
}