{
    "py/object": "mylib.pedal.Pedal",
    "id": "19984",
    "name": "Keeley VoT – Eddie Heinzelman Verb o Trem",
    "image": "images/keeley-keeley-vot-–-eddie-heinzelman-verb-o-trem.jpg",
    "function": [
        "Reverb",
        "Tremolo"
    ],
    "manufacturer": "Keeley",
    "current": "? mA / ? V / AC/DC",
    "cost": "$149 Price in €",
    "width": 60,
    "height": 112,
    "details": "Reverb Tremolo ComboKeeley and Eddie H. teamed up to produce the Verb o Trem, the Keeley VoT!!\nThe Keeley VoT reverb and tremolo combo gives players a simple and beautiful sounding way to end their pedal boards.  Reverb and Tremolo often sound best at the end of your guitar rig, after effects like compression, fuzz or overdrive.  The Keeley VoT gives you famous Keeley spring and plate reverbs as well as modulated tube amp tremolos.  This immaculate pairing provides you with everything you need for a small, compact pedal board.\nWhen you go minimalist, you still consider Reverb and Tremolo.  Even the guys that say they just plug their guitar cord into the amp…still admit they love verb and trem!\nSo if you’re doing a small gig with a compact board or you just want the captivating power of tremolo and reverb at the same time, the Keeley VoT is a simple and beautiful sounding combo.\nReverbs\nKeeley 2 Spring Reverb is the real deal, it’s so good sounding, they install it in The Amp now.  The Keeley Spring Reverb allows you to get that splashy spring sound that instantly fattens your guitar tone.\nIf you want something super smooth, however, you flip it over to switch in our Plate Reverb.  Get that huge plate reverb sheen by simply flipping a switch!\nTremolos\nA Lotus Flower of Tremolos.\nI don’t know what that means, but it sounded good.  You have three blooming tremolos in the Keeley VoT.\nR+T – is an organic tube bias type tremolo.  This means you hear the tube amp bias change enough to modulate the volume.  A very personal and haunting tremolo.  Very moody.\nMack – This mode is a MagnaAmp style pitch vibrato.  Done by carefully changing the phase to illicit silky smooth pitch shift.  Sounds like you have your finger on the pulse of life.  Sometimes a walk on the wild side is the way to go.\nHAR – Harmonically Amplified Resonator.  I made that up too.  Harmonic Tremolo -two filters that we vine around, back and forth, creating a notch filter that gives you that Tower of Flower sound.\nVoT – Lotus\nHere’s where the flowering magic occurs: you can set the VoT to be either Reverb OR Tremolo OR Both if you want.  Let’s say you just need some ‘verb for the night, simply reduce the Depth control!  Reverb Purity.\nWhat if you want to use the tremolo only?  Simply roll off the Reverb control.\nThis pedal can simply and easily be reborn into any combination of tones you need.\nThe Artist\nEddie Heinzelman is an in-demand session musician/sideman who currently plays guitar, mandolin, and sings background vocals with hit songwriter and Country/Americana artist, Radney Foster.  He is also an active member and admin for the Keeley Sound Check – Open Guitar Effects Forum.\nhttps://robertkeeley.com/product/keeley-vot-reverb-and-tremolo-guitar-effects-pedal/",
    "hrid": "keeley-keeley-vot-–-eddie-heinzelman-verb-o-trem"
}