{
    "py/object": "mylib.pedal.Pedal",
    "id": "26340",
    "name": "Aurora Reverb",
    "image": "images/keeley-aurora-reverb.jpg",
    "function": [
        "Reverb"
    ],
    "manufacturer": "Keeley",
    "current": "? mA / 9 V / DC / Negative Center",
    "cost": "$179 Price in €",
    "width": 60,
    "height": 112,
    "details": "Digital ReverbTurn down the lights, turn up the spectrum…\nJoin Keeley Electronics’ grand entrance into the hallowed halls of psycho-acoustic processing – the Aurora Reverb. Few effects complement a guitar better than reverb; from spring reverb coils in a tank to the distant echo of cathedrals to 600 pound sheet-metal plate vibrations. Reverb captures our imaginations and plunges us deeply into our musical psyches.  Reverb IS the key to the highway.\nAt Keeley Electronics, the Aurora Reverb had to meet certain specific criteria. It had to be affordable with no compromise to audio quality. It had to be easy for guitarists to use and be inspiring. And it had to offer the essentials for tailoring your tone without a dozen knobs to learn. Now achieved, we are proud to offer a true bypass, 100% dry analog path, low noise, 24 bit, high-fidelity reverb processor.\nAND IT SOUNDS GREAT!\nIn fact, when asked if it offered ‘trails’ I couldn’t help but think, “Why would you need trails for a pedal you won’t want to turn off?”\nThe following controls offer everything from pristine, fast reflections to ethereal spaces to deep, dark and endless caverns.\nThe Toggle Switch   The three most popular reverb styles that don’t come built into your amplifier are Room, Plate and Hall. In the smallest footprint possible, we offer what used to take up a recording studio room or an entire city block.  You can achieve cathedral resonance, enormous surface areas of sheet-metal plate sounds or convincing room decays. Room sizes range from something like a broom closet to that of a barn. (And I also want to add that careful adjustments to the Room settings yield a signal bordering on the verge of spring reverb, so if your amp doesn’t already have a tank, we’ve got you covered.)\nDecay controls the amount of time it takes for the reverberated sound to disappear. Ours provides a range from a realistic, close-quarters reverberated dimension to a “walk-away-and-come- back in a while” signal of complex, still-ringing musical reflections.\nSlapback is what we call pre-delay. Pre-delay creates distance. How soon or late you hear the first reflection is crucial to crafting the reverberated space. Sometimes you do not want any delay between your note and the reverb. And sometimes, for clarity’s sake, you want the reverb to wait a moment before joining the dry signal.  Such a setting enables  short, staccato, single-syllable type expressions to finish articulating before being suffused AND joined by the tail-end of previously reverberated sounds.  The Slapback setting adjusts from zero to 100 milliseconds. When the illusion of infinite space is required, set your Slapback to zero and you’ll streak vividly away like Dr. David Bowman breaking free of Jupiter’s gravitational pull.\nDial up the warmth. Unlike most tone controls, ours is a dampening control and increases the warmth, as it is rolled up. Its brightest setting is when completely dialed down.\nBlend will take your 100% analog dry signal and blend in the reverb, from just the slightest mix of wet to much more. We suggest you place it at the end of your pedal chain and use the Blend Knob to tailor your sound.\nThe Keeley Aurora Reverb provides the essentials guitarists are looking for when they need reverb on their pedal boards. Like that ethereal glow to the mighty Earth herself, Aurora creates a natural halo of sound in the atmosphere of your magnificent core tone.\nhttps://robertkeeley.com/product/aurora-digital-reverb-shirt-namm-special",
    "hrid": "keeley-aurora-reverb"
}