{
    "py/object": "mylib.pedal.Pedal",
    "id": "24020",
    "name": "Cirrus",
    "image": "images/kma-audio-machines-cirrus.jpg",
    "function": [
        "Delay",
        "Reverb"
    ],
    "manufacturer": "KMA Audio Machines",
    "current": "220 mA / 9 V / DC / Negative Center",
    "cost": "$223 Price in €",
    "width": 90,
    "height": 120,
    "details": "Delay/ReverbMade up of a Delay side and a Reverb side, both sides of Cirrus sport the most important basic controls such as Time (up to 1.5 sec). Repeats for the Delay and Decay and Damp for the Reverb. Plus, each side has its own mix control as well. So far so good, but now it’s time to jump down the sonic wormhole! This little Spatial-Temporal Modifier gives you three different Delay AND Reverb modes, which all sport a special dynamic feature that is controlled by your picking attack. This enables you to create sounds that are certifiably out of this world! To set the sensitivity of how the sound reacts, every section has its own sensitivity control\nThe different Delay and Reverb modes cover vastly different modulated areas. \nModulated Delay Mode (MOD) ﬂuctuates the Delay signal for a dynamic dancing tape echo-inspired modulation that’ll deliver everything from subtle sways, to crazy pitch-bends. The Sample & Hold Mode (S/H) adds a sequencer-like filter in front of the Delay line, perfect for synthy textures. Play softly for subtle filter action or hit it hard for more pronounced electro-vibes. The third Delay Mode (OCT) blends in a high octave as your notes decay for unique shimmery dimensions, shining through like tiny stars in the cloudy night sky.\nOver to the Reverb section, Modulated Reverb Mode (MOD) will decorate your trails with silky smooth movement, whereas the two other Modes deliver either an opening Low-pass Filter (LP) or a closing High-pass Filter (HP). The harder you pick the more the Low-pass will open up and bring in those shimmering highs, as if you’re opening and closing portals to far away galaxies simply through your playing. Contrary to that, the closing High-pass will cut your lower frequencies when picking harder which will create cool lo-f textures. However, the ambient party doesn’t stop here! \nA big part of creating a signature sound comes from your pedal order and we know that a lot of you like to get creative there. Well, the Cirrus obliges! Set the Order Toggle to “Reverb” to run the Delay into the Reverb or ﬂip it to “Delay” to switch it the other way - either direction will give you worlds of inspired soundscapes. You even get another Toggle Switch to set the Delay Tap subdivision, so you can get the right rhythms rolling fast. Toggles are awesome! \nNow, on to the footswitches - Tap-Tempo on the left (neat!) and the much-needed Bypass Switch on the right (classic!). But wait, we actually made these stompers cool - the humble Bypass and Tap-Tempo Switches are suddenly full of additional creative secrets! \nBesides the standard latching mode, the Bypass Switch offers some cool, yet creative and simple to use options. When the pedal is off, you can engage the pedal momentarily by holding the Switch down for sudden bursts of ambience. When the pedal is on though, holding down the Switch maxes out the Decay, jumping you straight into infinite reverb wonderland. You can also hold down the Tap-Tempo Switch to max out the repeats for infinite echoes. Plus, you can even hold down BOTH at the same time to enter an endless cascading dream state! \nWe’ve also equipped Cirrus with an Expression Pedal input (standard TRS connection) and a Selector Switch, giving you complete hands-free control over whatever key parameter of Cirrus you want. In addition, an internal switch can turn the Reverb and Delay trails on or off to taste, plus the individual Reverb and Delay mix controls help to tailor your sound exactly as you see ft. \nAs the final piece of the tonal puzzle, we added a Serial FX-Loop, letting you put any pedal in front of the Delay/Reverb line, to further ﬂavour your own signature sound. \nPhew, that was a lot of awesomeness in one box - now the rest is up to you. Engage Cirrus and ride the atmospheric high clouds. But be aware - there’s a big chance you’ll get lost in its stunning beauty for hours when up there!\nPowered by an optional standard 9V DC (max.) PSU (negative center, 2.1mm, approx. 220mA current draw) \nEvery pedal is designed, assembled, silkscreened, tested and numbered by hand in our small workshop. We use external manufactured PCBs to guarantee our high quality standard and keep the price of our pedals reasonable. The use of an indestructible powdercoated die-cast enclosure ensures a maximum durability. \nhttp://kma-machines.com/m_cirrus.html",
    "hrid": "kma-audio-machines-cirrus"
}