{
    "py/object": "mylib.pedal.Pedal",
    "id": "18935",
    "name": "Horizont",
    "image": "images/kma-audio-machines-horizont.jpg",
    "function": [
        "Phase Shifter",
        "Dual/Stereo"
    ],
    "manufacturer": "KMA Audio Machines",
    "current": "? mA / ? V / AC/DC",
    "cost": "$324 Price in €",
    "width": 153,
    "height": 125,
    "details": "Stereo JFET Phaser“He who does not expect the unexpected, will not find it” - Heraklit\nJump into spaceship Horizont and begin your trek into star-filled galaxies, all while discovering the incredible vastness of the sounds created by this interdimensional multi-spatial stereo JFET Phaser. The unexpected is waiting for you behind the far away horizon and it will be a journey you'll never forget!\nThe Horizont’s mission is to push way beyond the classic phasing sounds of yesteryear, and take you to uncharted phaser worlds the second you plug in. By combining lush analog JFET phasing with digitally controlled dynamics, Horizont creates a vivid and expressive modulation experience, all while providing experimental and creative features that’ll kick phasing well into the 21st century.\nBesides the more common phaser controls, the Horizont offers a plethora of new and exciting options for all the interstellar tone chasers out there. To greatly broaden the range of phasing tones available, we implemented a digital LFO with no less than eight different waveforms: Ramp Up/Down, Sine/Triangle/Square wave, a sweeping waveform, Sample & Hold and a random slope waveform going from 20s down to 40ms.\nThe implemented envelope generator is one of Horizont's absolute key features. It transforms your input signal into a control source to modulate the speed of the digitally controlled LFO or lets you manually phase for a resonant touch wah-like sound, depending on the state of the SWP- and SPURTCONTROL-Switch.\nSet the SPURTCONTROL switch to LFO to let the SPURT knob adjust the internal phasing speed. However, by flicking the switch to ENV (Envelope) mode, it allows you to dynamically modulate the speed along the full LFO speed range, based on how loud the input source is (e.g. when you attack the strings hard). You can also combine the SPURT knob and the envelope by flicking the toggle to LFO+ENV where SPURT then sets the minimum speed. For even more control, you can even plug in an external expression pedal/CV-source (0-5V) to alter the minimum speed on-the-fly or you can use the TAP TEMPO switch to set the speed to fit in with the tempo of your music.\nThe EXP-Mode switch also lets you choose between a manual phasing mode, controlled by an expression-pedal or an external CV source. Setting the EXP-Mode switch to the middle position will disable any external expression control.\nThe SWP (Sweep) switch lets you decide to use either the LFO or the envelope of your instrument signal to control the phasing.\nThe envelope can be set to upwards or downwards operation via the ENV switch, seeing the LFO either slowing down or speeding up, or flipping the orientation when phasing manually from lows to highs and vice versa. In conjunction with the FUEL (Sensitivity) and the DECAY controls, the envelope can be tailored perfectly to your needs.\nWe kept the EMPH (Emphasis) mode from our original Astrospurt Phaser, but have reworked and refined it extensively for the Horizont. The four toggle-switches determine the stage in which the phase-shifted signal is fed back into itself, while the REG (Regeneration) control sets the feedback amount. We also smoothed out the overall sound of the EMPH mode for a more pronounced, and crisp vocal-like tone. Each of the different switch variations and turn of the REG control will yield different results, seeing you discover new wild, fuzzy and noisy galaxies as you travel deeper down this sonic wormhole.\nIn order for you to levitate through spacetime, we’ve also added a stereo output to the Horizont. You can switch between a standard stereo output or a panning output, via the STEREOPAN switch. Synchronized with the LFO speed, the upper cycle of the LFO sends the signal to the OUT1 and the bottom cycle to the OUT2. This is without a shadow of a doubt the most liquid and astonishing phasing experience you’ll ever embark upon. But wait, there’s more! Stop and take a deep breath, set the MIX control to fully clean and the Horizont is transformed into a Tremolo on-the-spot, with all the other aforementioned features.\nLast but by no means least, we equipped the Horizont with an FX-Loop right in front of the phase-shifting line. This enables you to add your own secret sonic weapons to this spaceship, seeing you create your very own unique phasing sounds. We’ve also increased the pedal’s headroom drastically by boosting the internal circuit voltage to 18V, from the regular 9V input, to give the cleanest phasing possible no matter what instrument or line source you use.\nAn Introduction into EMPHASE-Mode Theory\nThe Emphase-Mode is a mighty tone-shaping tool, BUT has to be handle with care! That feature will let you activate a feedbackloop which is taking the phaseshifting (wet)-signal and feeding it back into one of the four phase-shifting stage, defined by the labeled switches. That leads to an emphasing of a certain frequency for a more pronounced and resonating phasing sound, like the EHX-Small Stone is known for or helps you to get a more pronounced Touch-Wah Sound, when engaging the ON/OFF Switch and the certain stage of choice. The Regeneration-Control (REG) will let you dial in the right amount of feedback. So far, so good.\nNow comes the hard part. As soon as you combine more than one stage, the signal will be fed back from the forth stage into the activated ones AND also from the activated ones into each other, for example Stage 1 and 2 is activated and the ON/OFF Switch is in ON position: Signal is going from the fourth into the first and second and from the second into the first stage.\nYou will come up with tones of totally non-standard phasing sounds like wild glitchy oscillations, weird distorted and fuzzy phasing tones or unpredictable blips and blops.\nAs far as it already went you will have the possibility to modulate the behaviour of those sounds by the help of the DEPTH- and REG-Control. It will change the pitch of the oscillations, filtering highs or let you escalate quickly. Some settings behaving different when the ON/OFF Switch is engaged or not.\nBut before using this awesome sounds some things have to be considered when using more than one stage:\n★ TURN DOWN THE SIGNAL FIRST\n★ ACTIVATE THE STAGES OF CHOICE\n★ ADJUST YOUR DESIRED SIGNAL\n★ USE THE DEPTH AND REG CONTROL TO CHANGE THE BEHAVIOUR OF THE CRAZY SOUNDS\n★ ENJOY\nBut don’t be fooled by all of these seemingly complex features, the Horizont is a super intuitive next generation phaser that’ll see your tone take flight in seconds flat. Whether you are looking for traditional phasing sounds, experimental synthetic soundscapes or super dynamical sonic endeavours, the Horizont will have you covered to infinity and beyond.\nPowered by an optional standard 9V DC (max.) PSU (negative center, 2.1mm, approx. 75mA current draw)\nhttps://shop.kma-machines.com/product/horizont-stereo-jfet-phaser",
    "hrid": "kma-audio-machines-horizont"
}