{
    "py/object": "mylib.pedal.Pedal",
    "id": "14656",
    "name": "Field Kit",
    "image": "images/koma-elektronik-field-kit.jpg",
    "function": [
        "Controller",
        "Multieffect",
        "Utility",
        "Volume",
        "PreAmp",
        "Filter"
    ],
    "manufacturer": "KOMA Elektronik",
    "current": "? mA / ? V / AC/DC",
    "cost": "$200 Price in €",
    "width": 201,
    "height": 130,
    "details": "Electro Accoustic WorkstationThe KOMA Elektronik Field Kit is the perfect tool for everyone who would like to experiment with electro acoustic sound. Use everyday objects, amplify them and use them to make sound, like our heroes John Cage and David Tudor used to do!\nThe Field Kit is optimized to process signals from microphones, contact microphones, electromagnetic pickups and able to run DC motors and solenoids. On top of that it can receive radio signals and convert signals from switches and sensors into control voltage!\nLet’s get more detailed…\nThe Field Kit boasts 7 separate functional blocks all focussed on receiving  or generating all types of signals. They are designed to operate together as a coherent electroacoustic workstation or alternatively together with other pieces of music electronics with the ability to use control voltage signals.\n\nThe Four Channel Mixer is the beating heart of the Field Kit, providing a fully functional mixer with individual Gain, Mix Level and Tone control over each channel and individual Master- and Aux sub-mixes.\nThe level of the Master and Aux Channels can be set with the Master Volume and Aux Volume controls and the channels being sent to the Aux sub-mix can be set with dedicated Aux Select-buttons. The Aux sub-mix is pre-fader.\nThe CV Radio is a CV-controllable radio receiver capable of receiving radio frequencies on AM/FM and SW bands. Additionally it provides the ability to catch electromagnetic waves for further processing inside the Field Kit. The frequency of the radio can be set with a dedicated multifunctional Search-control which acts both as a manual CV-source and as an input attenuator for a CV-signal.\nThe Field Kit comes with three connectors to attach needed antenna’s for both FM and SW bands and a loop antenna connector for AM signals.\nThe Envelope Follower in the Field Kit applies two functions to the waveform you send to the input: full-wave rectification (mirroring of negative portions of the waveform) and low-pass filtering (averaging). It can also be used for frequency doubling of a signal, which is a great tool to have in the electroacoustic domain.\nIn addition to the Envelope Out, the Envelope Follower inside the Field Kit also gives out a gate signal whenever the level of the input signal is high enough. The input signal level can be set with a dedicated Attenuation-control.\nThe Low Frequency Oscillator generates periodically varying voltages to be used as control signals. The output waveform can be set with a three-position Waveform-control and gives out either a Square-, Triangle- or a mix of Square and Triangle waveforms.\nThe frequency of the LFO can be set together with a dedicated Frequency-control and a three-position Range-control. With the higher range-settings, the frequency of the LFO reaches into the audio-range so the LFO can also be used as a simple drone sound source, send this is into a delay effect and you can make trippy sounds for hours!\nA very cool function of the Field Kit is the DC Interface. You can use its output voltages to run little motors, fans, solenoids, buzzers and control them with control voltage signals. You can pick up the vibrations and electromagnetic waves with the contact microphones and electromagnetic pickup.\nThe DC Interface can be used together with PWM (Pulse Width Modulation)- or Pulse-controlled devices. An example of a PWM-controlled device is a DC-motor of which the rotation speed can be set by varying the pulse width. A Pulse-controlled device can be a solenoid-motor whose impulse strength/distance can be set with the length of the control pulse. Other devices that can be used together with the DC Interface could be computer fans, LEDs, relay switches,  etc.\nThe Signal Interface is a nifty toolset to transform the raw signals of a wide variety of sensors and switches into signals that can be used with the Field Kit or other gear. This means you can trigger or control sound by light, heat, humidity, distance, speed, acceleration, proximity, pressure, force, level, all depending on what type of switch or sensor you are using! Ideal for sound installations!\nThe Signal Interface consists of two parts, the Switch and the Sensor Interface.\nThe Switch Interface transforms signals from different switches like buttons, ball- or tilt-switches etc. into four different types of gate signals. It can output gates, inverted gates, ramp or sawtooth triggers of adjustable length (1ms to 1s). It has two outputs that can be used at the same time, so you could drive a motor and scan the CV Radio with the same switch! The output-voltage spans a range from 0V to about 8V.\nThe Sensor Interface is made to manipulate the output voltage of analog sensors, like light-, heat- or distance-sensors and convert their signals into control voltage. It can amplify or attenuate the incoming signal and add a DC-offset, so you can for instance set the motor to a constant speed and make it run faster by outputting a higher voltage from the sensor.\nThe maximum output-voltage is about 8V. It provides enough current to power an Arduino!\n\nhttps://koma-elektronik.com/?product=field-kit",
    "hrid": "koma-elektronik-field-kit"
}