{
    "py/object": "mylib.pedal.Pedal",
    "id": "12574",
    "name": "Kaossilator",
    "image": "images/korg-kaossilator.jpg",
    "function": [
        "Drum",
        "Synth Voice"
    ],
    "manufacturer": "Korg",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 106,
    "height": 129,
    "details": "Dynamic Phrase SynthesizerThe KAOSSILATOR is a pocket-sized musical instrument that puts a KAOSS touchpad interface on 100 of Korg's world renowned synth sounds and innovative performance features! You can instantly play musical phrases simply by tapping or sliding your finger across the KAOSSILATOR's touchpad-no previous skills required!\nThe KAOSSILATOR liberates synthesizer sounds from the keyboard. It gives keyboardists, guitarists, and DJs a convenient way to add fresh new elements to band performances or to DJ sets. Even untrained music enthusiasts can enjoy an entirely new level of musical involvement and expression. \nThanks to its ultra-compact size, battery operation and hooks for attaching a strap, the KAOSSILATOR makes it easy for you to start creating music whenever and wherever inspiration strikes you.\nPacked with powerful synth sounds, sound effects, and drum sounds KAOSSILATOR comes packed with one hundred powerful sound programs that combine Korg's legendary modeling synthesizer engine with the effects from the KAOSS PAD series, perfect for any musical genre. The horizontal axis is assigned to note/pitch, while the vertical axis is assigned to parameters such as: cutoff, feedback, or modulation depth, giving you a wide range of performance possibilities. In addition to classic synthesizer sounds like leads, basses and sound effects, there are sounds that faithfully simulate piano, guitar, and trumpet as well as looped and one-shot drum sounds, making the KAOSSILATOR a never-ending source of inspiration to stimulate your creativity.\nScale/key setting lets you produce perfect phrases The KAOSSILATOR has a scale function that makes it simple to produce accurate pitches that match any musical context. You can choose from 31 different scales, including chromatic, diminished, as well as major and minor blues and pentatonic scales. The scale function can be used in conjunction with the key setting function, allowing you to perform in any key. Unusual scales such as Spanish, Ryukyu, and Raga are also provided, letting you create distinctive phrases with an exotic flavor.\nGate Arpeggiator expands your performance possibilities The Gate Arpeggiator lets you produce specific patterns of notes in sync with the user specified tempo, greatly expanding your performance options. Simply choose one of the fifty patterns to specify the timing of the notes, and you'll be creating phrases that you've never dreamed of in a flash.\nLoop Recording accelerates your creative power Loop Recording allows you to record a phrase with a specified number of beats (maximum 8 beats = 2 measures), and play it back endlessly. For example you can record a phrase using a synth-lead sound, and then layer (overdub) bass or drum sounds onto it. You can build up layers of cool phrases by simply repeating this cycle of selecting, playing, and recording sounds. Building a groove was never so easy!\nKorg KAOSSILATOR Dynamic Phrase Synthesizer Specifications:\nPrograms: 100\nProgram Categories: \"NOTE\" Sound = LEAD: 20, ACOUSTIC: 10, BASS: 20, CHORD: 10 \"SE\" Sound = SE: 20 \"DRUM\" Sound = DRUM: 10, DRUM PATTERN: 10\nMusical Scale Patterns: 31\nKey Range: ±12\nTypes of Gate Arpeggiator: 50\nConnectors: LINE OUT jacks (RCA phono jacks), PHONES jack (Stereo mini phone jacks)\nSampling Frequency: 48kHz\nDA Conversion: 24-bit Linear\nPower Supply: four alkaline AA (LR6) batteries (6 V)\nBattery Life: approximately five hours (with alkaline batteries)\nIncluded Items: Owner's Manual, parameter sheet, four AA \"test\" batteries\nDimensions( W x D x H): 4.17\" x 5.08\" x 1.14\" (106 x 129 x 29 mm)\nWeight (without batteries): 5.43 oz. (154 g)\nOptions: DC4.5V AC adapter (Sold Separately)\nKorg KAOSSILATOR Dynamic Phrase Synthesizer Features:\nA portable synthesizer delivering maximum flexibility in an ultra-compact body, with battery operation that allows you to jam anywhere\nSynth, sound-effects, and drum sounds, for a total of 100 powerful sound programs\n31 scale patterns let you easily play a wide variety of \"always perfect\" phrases\n50 types of gate arpeggiation help you perform complex rhythmic patterns\nLoop Recording allows multiple phrase overdubbing to create complete grooves",
    "hrid": "korg-kaossilator"
}