{
    "py/object": "mylib.pedal.Pedal",
    "id": "20615",
    "name": "Volca Modular",
    "image": "images/korg-volca-modular.jpg",
    "function": [
        "Synth Voice"
    ],
    "manufacturer": "Korg",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 193,
    "height": 115,
    "details": "Micro Modular SynthesizerThe Volca Modular is a semi-modular synthesizer consisting of independent analog synth modules, digital effects, and a sequencer. Each of the modules has been carefully selected for its stand-alone completeness. The modules are internally connected so that sound can be produced even before connecting the included pin cables, and the routing is shown by white lines on the panel. Module connections via a pin cable take priority over the internal connections, bypassing them.\nThe Korg Volca Modular features 8 modules:\nSOURCE: This consists of a triangle VCO carrier and a modulator. The complex overtones generated by FM modulation are sent through a wave folder circuit to add additional overtones, producing a distinctive sound. This module is important in determining the basic character of the sound of volca modular.\nFUNCTIONS: This section consists of two function (envelope) generators. In addition to an ADH generator with attack, hold, and release, there’s a Rise-Fall generator, also known as a slope generator, which not only applies time-varying change to the sound but also lets you patch the end trigger out back into the trigger in as a loop, making it usable as a VCO or LFO.\nWOGGLE: This is a random signal generator containing a sample & hold circuit that uses pink noise as its source. Two outputs are provided, allowing it to output either stepped or smooth random noise.\nSPLIT: This module distributes one input to two outputs. It can also be used in the reverse direction, combining two control or audio signals into one.\nDUAL LPG: This consists of two low-pass gate circuits. Typical of the West Coast style of synthesis, the module packages a filter with an amp, allowing the brightness and volume of the sound to vary together.\nUTILITY: This is a mixing scaling module that combines two signals in various ways. It can mix not only audio signals but also control signals, as well as inverting or attenuating those signals.\nSPACE OUT: This is a stereo module that applies a reverb-like effect to the audio signal.\nSEQUENCES: This module is for connecting to the internal sequencer. You can set the tempo, and select different rhythm divisions to output via the gate counter.\n\nOther features include microtonal support, randomization and support for CV control.\nhttps://www.korg.com/us/products/dj/volca_modular/",
    "hrid": "korg-volca-modular"
}