{
    "py/object": "mylib.pedal.Pedal",
    "id": "33672",
    "name": "P-Split III",
    "image": "images/lehle-p-split-iii.jpg",
    "function": [
        "Utility"
    ],
    "manufacturer": "Lehle",
    "current": "Pedal is passive",
    "cost": "$117 Price in €",
    "width": 92,
    "height": 90,
    "details": "Passive splitter and DI boxThe LEHLE P-SPLIT III combines passive splitting with the highest possible signal fidelity.\nIts applications range from splitting signals and eliminating hum, to balancing and reamplification along with any signal routing that requires a clean signal free from noise.\nAt its core is the high-end LEHLE TRANSFORMER HZ, which galvanically isolates the two outputs, eliminating any possibility of ground loops. The LEHLE TRANSFORMER HZ was specially designed for use with high-impedance signals but also splits low-impedance signals with uncompromising sound quality. The signal can be picked off either symmetrically or asymmetrically from the ISO output.\nBy using the phase inverter switch with gold-plated contacts you can flip the signal phase at the ISO output, preventing phase cancellation from impairing signal reproduction.\nThe classic application for the LEHLE P-SPLIT III is splitting an input signal to two outputs, enabling you to connect an instrument to two devices, which may, for example, be two amplifiers, or an amp and a mixer/recording unit (PC/DAW). Thanks to its ability to pick off the balanced signal on the ISO output, the LEHLE P-SPLIT III is also eminently suitable for use as a high-quality compact DI box for all types of signal.\nAnother useful application for the LEHLE P-SPLIT III is as a hum suppressor. Frequently background noise caused by ground loops occurs when two electronic devices are connected to each other. The LEHLE P-SPLIT III provides a simple, but extremely effective remedy when installed between the two units. Using the ISO output, the devices are galvanically isolated and background noise becomes a thing of the past.\nYou can even use the versatile LEHLE P-SPLIT III as a passive mono summing unit for a stereo signal by using the DIR output as second input.\nAnd just in case you are looking for a power connection: the LEHLE P-SPLIT III performs all its functions without any need for a power supply.\nhttps://lehle.com/EN/Lehle-P-Split-III",
    "hrid": "lehle-p-split-iii"
}