{
    "py/object": "mylib.pedal.Pedal",
    "id": "13145",
    "name": "OD-820 Overdrive Pro",
    "image": "images/maxon-od-820-overdrive-pro.jpg",
    "function": [
        "PreAmp",
        "Distortion"
    ],
    "manufacturer": "Maxon",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 117,
    "height": 150,
    "details": "Tube OverdriveThe OD820 circuit is basically a hot-rodded 808 with a few special tricks.  After a JFET input buffer, the signal is sent a dual-gang Drive pot where it is split between a clean gain stage and the overdrive stage.  As the Drive knob is turned up, more signal is sent to the overdrive stage while the drive of this stage is also turned up.  If the Drive knob is turned down, more signal is sent to the clean gain stage and the drive of the overdrive stage is turned down.  At 12 o’clock on the Drive knob, signal is split 50/50 clean/overdriven.\nThe OD820 features a standard 808-style tone control.  However, the entire pedal is running at 18 volts via an internal voltage doubler that bumps up the clean headroom and provides greater output and a fuller frequency response than the typical 808 circuit – in other words, no midrange spike!\nEven though the 820 circuit is running at 18 volts, it powers up off standard 9 VDC via battery or a standard external power adaptor.\nThe OD820 features buffered, Mechanical bypass switching with a low impedance output, allowing it to drive long cable lengths or other effect units without loss of signal.\nWith plenty of gain, a super-musical tone circuit and a transparency rarely found in a pedal, the OD820 takes Maxon’s legendary 808 circuit and launches it into the 21st century.\nThe OD820’s voltage doubling circuit adds gain, girth and grit without desecrating your existing tone. Imagine the classic 808 sound with more output, more bottom and more drive and you’ve pretty much summed up the 820’s sound.\nThe circuit’s additional headroom gives your playing a fluid, effortless feel:  Notes jump off the fretboard with a noticeable yet controlled sustain.  Though capable of heavier-than-usual overdrive, the OD820’s dynamic response is amazing and the pedal cleans up beautifully by rolling back your guitar's volume control.\nThe dual-ganged Drive pot blends clean and dirty tones, creating stunning clean solo boosts at lower settings and a buttery, light overdrive at high noon.  Max it out for a full-bodied overdrive that’s saucy and saturated while still retaining clarity and openness.\nFeatures:\n• Clean Booster /Overdrive designed specifically for tube amps\n• Like a Klon with a fuller frequency response and less noise\n• Extremely responsive to fingering and picking touch\n• Dual-purpose Drive control with Clean Blend function\n• 18-volt operation for additional headroom (powers off 9 VDC)\n• Low impedance, Mechanical Bypass Switching",
    "hrid": "maxon-od-820-overdrive-pro"
}