{
    "py/object": "mylib.pedal.Pedal",
    "id": "29487",
    "name": "Graphic Equalizer (GE601)",
    "image": "images/maxon-graphic-equalizer-(ge601).jpg",
    "function": [
        "Equalizer"
    ],
    "manufacturer": "Maxon",
    "current": "11 mA / 9 V / DC / Negative Center",
    "cost": "$159 Price in €",
    "width": 70,
    "height": 112,
    "details": "EQ6-Band Graphic EQ\n12 dB of boost/cut per band\n12 dB of output level boost\nCreate mid-boosted, wah-like solo tones\nEQ’s may not be as sexy as overdrives, but when used properly they can add a wide variety of useful new colors to your existing guitar rig.\nThe GE601 Graphic Equalizer covers six carefully selected frequency bands over a five octave range with 12 dB of Boost/Cut per band (100, 200, 400 & 800 Hz, 1.6 & 3.2 KHz respectively).  There’s also a Master Level control with 12 dB of overall Boost/Cut.\nAdjusting these controls, the GE601 can be used to fine tune your sound in an infinite variety of ways, a few of which are detailed below:\nPickup Simulator (Humbucker to single coil) – To turn a Humbucker into a Single Coil, cut 200, 400, & 800 Hz and Boost 100 Hz & 1.6 KHz.\nPickup Simulator (passive Bass to active Bass) – Cut 200 Hz and Boost 100 Hz & 1.6 KHz to give a passive Bass the clarity and punch of an active instrument.\nPickup Simulator (single coil to piezo) –Cut 200, 400, & 800 Hz and Boost 100 Hz, 1.6 & 3.2 KHz to make a single coil electric simulate the bright, chiming sound of an acoustic guitar with piezo pickup.\nHalf-cocked Wah – Boost at 800 Hz to emulate the tone of a wah pedal with the treadle set half-way forward.  This setting is also ideal for solo boosts (Adjust Level control to taste).\nClean Booster – Leave all frequency bands flat and boost the Level control to use as a clean booster for solos or to overdrive an amplifier’s input.  For more output, set all frequency bands to maximum boost.\nTECH TALK:\nAfter a low-impedance input buffer, the GE601 splits its signal into 6 parallel EQ bands each powered by its own Op Amp (JRC4558).  Through the sweep of the slider you can cut or boost the selected frequency.\nBoost is created by feeding the effected signal back into the Op Amp, creating an effect of exponential multiplication of that frequency - the higher the slider, the more of the effected signal is fed back through the EQ Op Amp chain.\nThe GE601 features buffered, JFET bypass switching with a low impedance output, allowing it to drive long cable lengths or other effect units without loss of signal.\nInput Impedance: 500K Ohms\nInput Jack: 1/4 inch standard phone jack\nOutput Impedance: 10K Ohms\nOutput Jack: 1/4 inch standard phone jack\nOutput: 1\nControls: Cut/Boost (6), Level (1)\nSwitch: Normal/Effect\nMax Input: 4 dBu\nNoise (IHF-A): -110 dBu\nMax Amplitude: 12 dB\nFrequency Range: 100 Hz 3.2 KHz\nPower Supply: 9V Manganese dry cell battery (S-006P) or special AC adapter\nPower Voltage: DC 9V (Battery) / DC10 V (AC adapter)\nCurrent Consumption: 11 mA (9V) / 12 mA (10 V)\nAC Adaptor: AC210N (option) Input: AC120V Output: DC9V/200 mA Center - / Sleeve +)\nDimensions (main body): 61 mm (W) x 112 mm (D) x 35 mm (H)\nDimensions (whole): 70 mm (W) x 112 mm (D) x 55 mm (H)\nWeight: 240 g\nAccessories: 9V Manganese dry cell battery (S-006P) x 1\nNon-skid pad: x 1\nWarranty Card: x 1\nUser's Manual: x 1\n\nAll specifications are subject to change for improvement without notice or obligation.All brand names and product names are trademarks or registered trademarks of their respective companies.\n\nhttps://maxonfx.com/products/reissue-series-guitar-effects-pedals-graphic-equalizer-ge601",
    "hrid": "maxon-graphic-equalizer-(ge601)"
}