{
    "py/object": "mylib.pedal.Pedal",
    "id": "19575",
    "name": "856 for ZELLERSASN",
    "image": "images/montreal-assembly-856-for-zellersasn.jpg",
    "function": [
        "Looper",
        "Sampling"
    ],
    "manufacturer": "Montreal Assembly",
    "current": "? mA / ? V / AC/DC",
    "cost": "$385 Price in €",
    "width": 165,
    "height": 121,
    "details": "Looper / Sample sequencer856 for ZELLERSASN manual fw 1.0\nIntroduction\nThe 856 for ZELLERSASN (856) is a looper and sample sequencer. Samples are taken of different parts of a loop and played back in various rhythms and at different pitches. A designed sequence can be stored and can be applied to new recordings (loops).\nParticularities\nThe knobs give the user the ability to design sequences. This should be kept in mind when adjusting the knobs: what you adjust may not immediately be audible as you are setting a parameter that will be changed the next time a sample plays.\nThe momentary switches \"acknowledge\" a press when they are released. For example, when you want to record a loop (in A=R mode), press and hold the record footswitch on the left and release it when you want to start recording. When you want to stop recording press and hold the record footswitch and release when you want recording to end.\nYou can only record for a maximum of 20 seconds. After this time, the recording will automatically stop.\nTerminology\nWhen we say \"parameter\" in this manual, we refer to the value that a particular knob represents. For example, the \"pitch\" knob controls the pitch parameter.\nWhen we say \"click a switch\" in this manual, we mean press and release a switch. The time between pressing and releasing should be short, but it actually doesn't matter if nothing else changes while the switch is down (no knob is turned, etc.).\nSetting up\nThe pedal is on moments after it is plugged in (it takes a few milliseconds to boot up). The power socket on the back is for a 9 volt adapter with a negative tip and a positive shell (this is standard for most guitar pedals). The 856 can pull up to 300 mA and so requires a power supply that can supply at least that much current.\nLooking from the top, the 1/4 inch jack furthest to the right is the audio input and the one just to the left of it the audio output.\nThe jack just to the left of the audio output jack is for incoming MIDI messages.\nTutorial\nBefore going through all the controls on the 856, we'll take you through a tutorial to get a flavour for what can be done with it.\nSee the \"setting up\" section to set up the pedal before proceeding.\nTo reset all the parameters hold the STRIDE/ABS/(UNI) switch in the down position while clicking the FADE/GAIN/(FBK) switch in the downward direction twice.\nSet the controls to control note set 1 by putting the N1/BAR/N2/N3 switch in the upward position.\nPut the pedal in R=B mode by putting the FREE/R=B/AREC switch in the middle position.\nThe rest of the switches can stay as they are for now.\nPlay a loop you are interested in recording. The first time we recommend just playing a note and letting it sound, then recording it for 1 or 2 seconds -- what is going on will be clearer this way. Press and hold the left footswitch and let go when you want to start recording. Press and hold the switch and let go when you want to stop. The loop you played should now be playing.\nAs the N1/BAR/N2/N3 switch is in the upward position and we are in A=R mode, the TMPO/REP knob only slightly changes the tempo. This is useful for adjusting your loop if it wasn't quite recorded right. The Δ knob controls the tempo more coarsely if the FREE/QUANT/SKIP switch is in the upward position. If in the middle position, it doubles, triples or quadruples the tempo depending on the Δ knob's position. This knob turned all the way clockwise does no scaling to the tempo, it turned all the way counter-clockwise quadruples the tempo.\nWith the FADE/GAIN/(FBK) switch in the middle position, turn the GAIN knob all the way counter-clockwise. The loop should not sound the next time it plays (the gain adjustment will not be immediate). Put the N1/BAR/N2/N3 switch in the middle position. You are now controlling the second note set. Turn the LEN knob to about half, the TMPO/REP knob to about half. Set the FREE/QUANT/SKIP to the middle position and turn the Δ knob to the middle. Now turn up the GAIN knob to maximum. You should hear many repeated copies of the beginning of your loop. Try adjusting the TMPO/REP knob to add fewer or more copies. Try adjusting the Δ knob to change the time between the repeats.\nYou can choose to sample a different part of your loop. To do this, set the STRIDE/ABS/(UNI) knob in the middle position and move the POS knob. You will hear the part of the loop that is sampled change based on where the POS knob is.\nThe pitch of the repeats can be controlled. Set the TMPO/REP knob to maximum to get a lot of repeats. We can control the pitches of sub-sets of the repeated notes. The P1/P2/P3 switch set in the upward position allows controlling the pitch of the 1st playback and 3rd, 6th ... repeats. This switch in the middle position controls the pitch of the 1st, 4th ... repeats and in the bottom position controls the pitch of the 2nd, 5th ... repeats. With the PITCH knob set to a different position for each of the P1/P2/P3 switch settings, you should hear a sort of arpeggio in the repeats (or chord if the time between the repeats is short).\nYou can make the repeats fade out or fade in by setting the FADE/GAIN/(FBK) switch to the upward position. The GAIN knob turned counter-clockwise will cause the repeats to fade out, there will be no fading if it is in the middle and the repeats will fade in if the knob is turned to the right. For fading in to be audible, the overall GAIN should not be maximum as the fading in is stopped when the notes would clip. To experience this, set the FADE/GAIN/(FBK) switch to the middle position and turn the GAIN knob to the middle. Then set the FADE/GAIN/(FBK) switch back to the top position and turn the GAIN knob to the right. You should hear the notes fade in.\nOur original loop is still present, just turned down. To hear it along with what you've set up on note 2, set the N1/BAR/N2/N3 switch to the top position, set the FADE/GAIN/(FBK) switch to the middle position and turn the GAIN knob to the top (if it is already at the top, turn the knob down then up again). You should hear the original loop with the repeats you created on note 2 playing at the same time as the beginning of the loop. We can change when these repeats occur relative to note 1. Set the N1/BAR/N2/N3 switch to the middle position. Now adjust the OFST knob. You should hear the repeats of note 2 starting sometime within the loop playing on note 1 -- when OFST is all the way counter-clockwise, the repeats start at the beginning of the loop and all the way clockwise they start at the end (which is close to the beginning as it's a loop).\nIf you like what you've created and want to apply it to other loops, you can save the parameters by setting the PRE1/PRE2/PRE3 switch and clicking the STR-RCL switch upwards. To recall the setting later select the preset with the PRE1/PRE2/PRE3 switch and click the STR-RCL downwards.\nControls\nLeft footswitch\nStarts and stops recording. The command is acknowledged when the switch is released.\nRight footswitch\nStarts and stops playback. The command is acknowledged when the switch is released.\nENV\nControls the amplitude shape of a playing note. Turned counter-clockwise, produces an amplitude envelope with slow attack and fast decay. Clockwise is an amplitude envelope with fast attack and slow decay. The envelope when in the middle has a slow attack and decay. In between you can find varying speeds for the attack and decay.\nNote that the envelope also applies to a loop. If in the middle position for example, this will give long attacks and decays to your loop, which you may or may not want. When recording a loop in R=B mode, the loop is automatically given an envelope with short attack and decay.\nN1/BAR/N2/N3\nControls what note set you are controlling. In the upward position, controls N1/BAR (we say \"BAR\" because TMPO/REP, FREE/QUANT/SKIP and Δ behave different from N2 and N3 in this setting). In the middle and lower positions controls N2 and N3 respectively.\nLEN\nControls the length of the notes samples from your recording. Fully clockwise plays for the time of the whole loop (we say time of the whole loop because if PITCH were set to 1 octave above, it would play through the loop twice as it is playing at double the speed). This knob set in the middle is not half the loop because the accuracy with which you can choose the length increases as you turn the knob counter-clockwise. This is so you can accurately cut out small segments from your loop, like a note or a specific drum, but choose the length of longer samples less precisely. You can't have your cake and eat it with such a small knob! (For more accuracy, check out the MIDI controls.)\nFREE/R=B/AREC\nDetermines what happens when you stop recording.\nIn FREE mode your recording does not affect the current tempo (see TMPO/REP for how to choose the tempo).\nIn R=B mode the length of your recording adjusts the tempo so that the notes of N1 are played with a delay equal to the length of your recording. This effectively creates a looping sensation. If the FBK light is on (see FADE/GAIN/(FBK)) then the gain of N2 and N3 is turned down so they do not play. This is so you can record what the 856 is playing and have it play like a loop without the sampling of the other notes making it sound chaotic. As a side-effect, the timing determined by the Δ and OFST knobs are all based on the length determined by the length of your recording.\nAREC mode is the same as R=B mode except that after you have recorded a loop, the 856 records automatically again and again for the length that you recorded the first time. This allows you to apply your sequence to what you just played. If you have recorded a loop in R=B mode and would like to record for exactly its length, while the loop is playing in R=B mode, switch to AREC mode, then press and release the REC button. Recording might not happen immediately but will start when the start of the loop happens then restart at the end of the loop. If you want to keep what is currently playing, press and release the REC button.\nTMPO/REP\nThis knob serves two functions: when N1/BAR is selected it controls the tempo of the loop or sequence. When N2 or N3 are selected, it determines the number of repeats that are played of that note. This means repeats are not available for the first note set.\nWhen N1/BAR is selected, the knob's function changes depending on the position of FREE/A=B/AREC. When FREE/R=B/AREC is in FREE mode, the knob controls the tempo so that in fully counter-clockwise position, the there are 40 loops per minute (40 playings of N1) and in fully clockwise position, there are 240 loops per minute.\nIn R=B mode the knob slightly nudges the tempo: turning clockwise makes it slightly faster and counter-clockwise slightly slower.\nIn AREC mode it behaves the same as in R=B mode.\nFREE/QUANT/SKIP\nThis switch controls the function of the Δ knob. The functions available change depending on the N1/BAR/N2/N3 switch. The following describes the various selections depending on whether or not the N1/BAR mode is selected or N2 or N3 is selected.\nFREE\nIf N1/BAR selected, Δ controls the tempo so that if Δ is fully counter-clockwise 10 beats per minute are subtracted from its rate and if clockwise 10 beats per minute are added to it. A sort of fine tempo adjustment.\nIf N2 or N3 selected, Δ controls the amount of time between the repeats of the notes. Δ in fully clockwise position, the time between repeats is equal to the length of the loop, Δ in fully counter-clockwise position, the time is 1/64 the length of the loop. N.B.: After reset (see (UNI)) the time between repeats is 0 until the Δ knob is adjusted.\nQUANT\nIf N1/BAR selected, Δ controls doubling, tripling or quadrupling of the tempo. Δ in the fully counter-clockwise position causes tempo quadrupling and in the fully clockwise position no tempo scaling occurs.\nIf N2 or N3 are selected, Δ controls the time between repeats as fractions of the loop length. From counter-clockwise to clockwise position, the fractions are from 1/16, through 1/12, 1/8, 1/6, 1/4, 1/3, 1/2, to 3/4.\nSKIP\nThis behaves the same for N1/BAR, N2 and N3. It determines how many loops to wait until playing the set of notes again. Each note set can be set individually. This is useful to play different note sets with different densities as sometimes your sequences might get too cluttered. Δ in the fully counter-clockwise position, the note set is played every loop. In the fully clockwise position, for every 4 loops, the note set plays only 1 time. In between more frequent choices are possible, like once every 2 or 3 loops.\nΔ\nControls many things. See the other controls for clarification.\nP1/P2/P3\nControls what pitch in the repeats the PITCH knob affects. P1 means PITCH changes the pitch of the 1st, 4th, etc. notes. P2 the 2nd, 5th etc. notes and so on.\nSTRIDE/ABS/(UNI)\nIf in the central position, ABS, the POS knob controls absolutely where samples are taken from in the recording. If the POS knob is in the fully counter-clockwise position, samples are taken from the beginning, if in the clockwise position, samples are taken from the end.\nIf in the upward position, STRIDE, the POS knob controls the rate at which the sample selection is advanced through positions in the sample. A counter-clockwise position of the POS knob advances backward and a clockwise position of the POS knob advances forward. The knob in the centre does not advance the start position of sampling.\n(UNI)\nIf the STRIDE/ABS/(UNI) switch clicked down without adjusting any other controls while the switch is down, the pitches of the repeated notes (previously set via P1/P2/P3 and PITCH) are reset to unison, that is, their pitches are not altered.\nIf held down while adjusting the PITCH knob, the pitches of all repeats for the currently selected note set are adjusted simultaneously. This is useful if you would like to have repeated notes at a different pitch, but no arpeggio effect.\nIf held down and the (FBK) switch is clicked (the bottom position of the FADE/GAIN/(FBK) switch), the gains of N2 and N3 are set to 0 (they are silenced). Their settings still remain.\nIf held down and the (FBK) switch is clicked twice, all the settings are reset and only N1/BAR plays as if a recording had just been made using R=B mode.\nPITCH\nControls the pitch of the repeat selected with P1/P2/P3 (or all pitches if (UNI) held down). Turned fully counter-clockwise, the note is transposed down an octave and fully clockwise up an octave. The transpositions are quantized to the nearest semi-tone. The transposition also affects the length of the playback.\nPRE1/PRE2/PRE3\nChooses what preset is stored or recalled using the STR/-/RCL switch.\nPOS\nChooses either where sampling starts within the recording or the velocity of sampling-start advancement according to the STRIDE/ABS/(UNI) switch.\nOFST\nChooses when the note set plays relative to when the BEAT light blinks. If in the fully counter-clockwise position, the note set starts playing at the same time as the BEAT light's illumination. If in the middle position the note set starts playing at the time half way between two flashes of the BEAT light.\nFADE/GAIN/(FBK)\nIn the middle position, the GAIN knob controls the loudness of the note set. This gain setting is only acknowledged when the next note plays.\nIn the top position, this controls the fading of repeated notes. If turned counter-clockwise, the repeated notes fade-out and if turned clockwise, the repeated notes fade-in. The gain is limited to 1. to avoid clipping, so to get a dramatic fade-in effect, the gain setting may need to be turned down (the GAIN knob turned counter-clockwise with the FADE/GAIN/(FBK) switch in the middle position) before dialing-in a fade-in effect.\nThe (FBK) position can be clicked, which will enable feedback in the FREE and R=B modes. If FBK is on (the FBK light illuminated), when recording, the output of the pedal is also recorded. Feedback is not available in the AREC mode. (FBK) can also be used to reset note parameters, see STRIDE/ABS/(UNI).\nGAIN\nControls the loudness of the notes or their fading, depending on the setting of the FADE/GAIN/(FBK) switch.\nMIDI\nBefore you can control the device via MIDI messages it is necessary to set the channel of the MIDI messages it responds to. By default it responds to messages on channel 1. If you have a new device and you have never set up the MIDI channel and are content with the 856 only responding to messages transmitted on channel 1 then you can skip this step. Otherwise follow the following instructions:\nTurn off the 856 by unplugging it. Set the switches in the top row according to the MIDI channel you would like to set. See the following table for the settings:\nChannel Switch 1 position   Switch 2 position   Switch 3 position   Switch 4 position\n1   middle/down middle/down middle/down middle/down\n2   middle/down middle/down middle/down up\n3   middle/down middle/down up  middle/down\n4   middle/down middle/down up  up\n5   middle/down up  middle/down middle/down\n6   middle/down up  middle/down up\n7   middle/down up  up  middle/down\n8   middle/down up  up  up\n9   up  middle/down middle/down middle/down\n10  up  middle/down middle/down up\n11  up  middle/down up  middle/down\n12  up  middle/down up  up\n13  up  up  middle/down middle/down\n14  up  up  middle/down up\n15  up  up  up  middle/down\n16  up  up  up  up\nFor example, if you would like the 856 to respond to MIDI messages transmitted on channel 10, set the top left-hand switch to the upward position, the top middle-left switch to the middle or downward position, the top middle-right switch to the middle or downward position and the top right-hand switch to the upward position.\nNow, while holding the (UNI) switch down, plug in the power to the back of the pedal. The MIDI channel you selected should display briefly on the LEDs using the same pattern as in the table (the illuminated LEDs will correspond to switches in the upward position, the dark LEDs to those in the middle or downward position). Shortly afterward, the pedal will continue to power up normally. It should now respond to messages on the channel you chose. Note that for channel 1, no LEDs will be illuminated.\nMIDI control change messages\nControl change number   Description Notes\n0   N1/BAR Pitch 1 control (fine)   Adjust pitch of 1st, 4th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n1   N1/BAR Pitch 2 control (fine)   Adjust pitch of 2nd, 5th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n2   N1/BAR Pitch 3 control (fine)   Adjust pitch of 3rd, 6th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n3   N1/BAR Envelope control Control the amplitude envelope of the notes just as the ENV knob does.\n4   N1/BAR Length control   Control the length of the notes just as the LEN knob does.\n5   N1/BAR Pitch 1 control  Adjust pitch of 1st, 4th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n6   N1/BAR Pitch 2 control  Adjust pitch of 2nd, 5th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n7   N1/BAR Pitch 3 control  Adjust pitch of 3rd, 6th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n8   N1/BAR Gain control Control the gain just as the GAIN knob does with the FADE/GAIN/(FBK) switch in the middle position.\n9   N1/BAR Position control Adjust the position just as the POS knob does with the STRIDE/ABS/(UNI) switch in the middle position.\n10  N1/BAR Stride control   Adjust the position advancement just as the POS knob does with the STRIDE/ABS/(UNI) switch in the upward position.\n11  N1/BAR Offset control   Adjust the playback offset just as the OFST knob does.\n12  N1/BAR Fade control Adjust the fade just as the GAIN knob does with the FADE/GAIN/(FBK) switch in the upward position.\n13  N1/BAR Free Δ control   Adjust the time between notes just as the Δ knob does with the FREE/QUANT/SKIP switch in the upward position. *\n14  N1/BAR Number of repeats control    Adjust the number of repeats (the number of notes in the arpeggio) just as the TMPO/REP knob does. *\n15  N1/BAR Stride state If non-zero (1-127), enables playback offset advancement, otherwise if 0, disable playback offset advancement. This cannot be in conflict with the STRIDE/ABS/(UNI) switch. That means you cannot control this parameter over MIDI when the note whose parameters you are adjusting is selected with the N1/BAR/N2/N3 switch, in this case the N1/BAR note.\n16  N1/BAR skip control Control how often the arpeggio plays just like the Δ knob does with the FREE/QUANT/SKIP switch in the downward position.\n17  N2 Pitch 1 control (fine)   Adjust pitch of 1st, 4th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n18  N2 Pitch 2 control (fine)   Adjust pitch of 2nd, 5th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n19  N2 Pitch 3 control (fine)   Adjust pitch of 3rd, 6th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n20  N2 Envelope control Control the amplitude envelope of the notes just as the ENV knob does.\n21  N2 Length control   Control the length of the notes just as the LEN knob does.\n22  N2 Pitch 1 control  Adjust pitch of 1st, 4th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n23  N2 Pitch 2 control  Adjust pitch of 2nd, 5th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n24  N2 Pitch 3 control  Adjust pitch of 3rd, 6th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n25  N2 Gain control Control the gain just as the GAIN knob does with the FADE/GAIN/(FBK) switch in the middle position.\n26  N2 Position control Adjust the position just as the POS knob does with the STRIDE/ABS/(UNI) switch in the middle position.\n27  N2 Stride control   Adjust the position advancement just as the POS knob does with the STRIDE/ABS/(UNI) switch in the upward position.\n28  N2 Offset control   Adjust the playback offset just as the OFST knob does.\n29  N2 Fade control Adjust the fade just as the GAIN knob does with the FADE/GAIN/(FBK) switch in the upward position.\n30  N2 Free Δ control   Adjust the time between notes just as the Δ knob does with the FREE/QUANT/SKIP switch in the upward position.\n31  N2 Number of repeats control    Adjust the number of repeats (the number of notes in the arpeggio) just as the TMPO/REP knob does.\n32  N2 Stride state If non-zero (1-127), enables playback offset advancement, otherwise if 0, disable playback offset advancement. This cannot be in conflict with the STRIDE/ABS/(UNI) switch. That means you cannot control this parameter over MIDI when the note whose parameters you are adjusting is selected with the N2/N2/N3 switch, in this case the N2 note.\n33  N2 skip control Control how often the arpeggio plays just like the Δ knob does with the FREE/QUANT/SKIP switch in the downward position.\n34  N3 Pitch 1 control (fine)   Adjust pitch of 1st, 4th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n35  N3 Pitch 2 control (fine)   Adjust pitch of 2nd, 5th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n36  N3 Pitch 3 control (fine)   Adjust pitch of 3rd, 6th, ... notes in arpeggio from -100 cents to +100 cents (hundredths of a semitone).\n37  N3 Envelope control Control the amplitude envelope of the notes just as the ENV knob does.\n38  N3 Length control   Control the length of the notes just as the LEN knob does.\n39  N3 Pitch 1 control  Adjust pitch of 1st, 4th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n40  N3 Pitch 2 control  Adjust pitch of 2nd, 5th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n41  N3 Pitch 3 control  Adjust pitch of 3rd, 6th, ... notes in arpeggio according to the control change value. 60 is no transposition, 48 is an octave below, 72 an octave above, etc. Note that this is more range than is available on the physical interface.\n42  N3 Gain control Control the gain just as the GAIN knob does with the FADE/GAIN/(FBK) switch in the middle position.\n43  N3 Position control Adjust the position just as the POS knob does with the STRIDE/ABS/(UNI) switch in the middle position.\n44  N3 Stride control   Adjust the position advancement just as the POS knob does with the STRIDE/ABS/(UNI) switch in the upward position.\n45  N3 Offset control   Adjust the playback offset just as the OFST knob does.\n46  N3 Fade control Adjust the fade just as the GAIN knob does with the FADE/GAIN/(FBK) switch in the upward position.\n47  N3 Free Δ control   Adjust the time between notes just as the Δ knob does with the FREE/QUANT/SKIP switch in the upward position.\n48  N3 Number of repeats control    Adjust the number of repeats (the number of notes in the arpeggio) just as the TMPO/REP knob does.\n49  N3 Stride state If non-zero (1-127), enables playback offset advancement, otherwise if 0, disable playback offset advancement. This cannot be in conflict with the STRIDE/ABS/(UNI) switch. That means you cannot control this parameter over MIDI when the note whose parameters you are adjusting is selected with the N1/N2/N3 switch, in this case the N3 note.\n50  N3 skip control Control how often the arpeggio plays just like the Δ knob does with the FREE/QUANT/SKIP switch in the downward position.\n51  Coarse tempo control    Control how often the sequence plays in beats per minute (BPM) from 40 BPM to 240 BPM.\n52  Fine tempo control  Control how often the sequence plays by adding to the current tempo -10 to +10 BPM.\n53  Tempo scaling   Scale the tempo like the Δ knob with N1/BAR/N2/N3 in the upward position and FREE/QUANT/SKIP in the middle position.\n54  Tempo nudge Slightly adjust the tempo like the TMPO/REP knob with N1/BAR/N2/N3 in the upward position and FREE/R=B/AREC in the middle position.\n55  Preset store    Store the current settings in a specified register. The message value of 0 stores in the PRE1 register, a value of 1 stores in the PRE2 register and a value of 2 stores in the PRE3 register. If greater than 2, stores in the PRE3 register.\n56  Preset recall   Recall the current settings from a specified register. The message value of 0 recalls from the PRE1 register, a value of 1 recalls from the PRE2 register and a value of 2 recalls from the PRE3 register. If greater than 2, recalls from the PRE3 register.\n57  Record enable/disable   Start/stop recording. A message value of 0 stops recording. A message value greater than 0 starts or restarts recording depending on whether or not recording is already going on.\n58  Play start  Start/stop playback. A message value of 0 disables all playback. A message value greater than 0 starts playback. If playback is already going on it will start a new set of notes along side the already playing set.\n59  Record mode Sets the record mode just like the FREE/R=B/AREC switch. A message value of 0 sets the FREE record mode, a value of 1 sets the R=B mode and a value of 2 sets the AREC mode. A value greater than 2 sets the AREC mode.\n60  Feedback state  Sets the feedback state just like the bottom position of the FADE/GAIN/(FBK) switch. A non-zero value turns feedback on, a zero value turns it off. Note feedback is disabled (cannot be turned on) in AREC mode.\nMIDI note on messages\nSending a MIDI note on message on the channel the 856 is set up to listen on will play back one iteration of the loop or sequence. The pitch value will scale all the pitches accordingly: a pitch value of 60 means no transposition, 72 means all pitches are transposed 1 octave up, 48 means they are all transposed one octave down, etc. The velocity value scales the GAIN value of all notes. 127 means no scaling, 63 is a scaling of about half, etc. Note off messages are ignored.\nhttp://mtlasm.blogspot.com/p/856-for-zellersasn.html",
    "hrid": "montreal-assembly-856-for-zellersasn"
}