{
    "py/object": "mylib.pedal.Pedal",
    "id": "12437",
    "name": "Reecho Pro",
    "image": "images/mooer-reecho-pro.jpg",
    "function": [
        "Delay",
        "Digital",
        "Dual/Stereo"
    ],
    "manufacturer": "Mooer",
    "current": "? mA / ? V / AC/DC",
    "cost": "$120 Price in €",
    "width": 106,
    "height": 96,
    "details": "Digital Delay Reecho Pro\nWhile Reecho and Shimverb are selling pretty hot, we are actually preparing for the birth of its next generation. After several years of repeated researches and efforts, we finally make a more powerful and charming pedals—TWIN Series.\nReecho Pro uses floating-point DSP chips, with new algorithm, therefore the tone is significantly improved. Reecho Pro assembles 6 delay effects and with Tap Tempo function which makes adjusting the delay time much more easier. From clean digital delay to psychedelic Galaxy Delay, we provide different musical styles with different delays choices. Moreover, we have provided three additional effects which can be added to the delay effects. Reecho Pro have separated dry and wet level control. It also equipped with high cut and low cut control, PINGPONG function, Loop function, stereo input and stereo output, preset saving function. No matter you use it in practicing or professional performance, Reecho Pro will give you a much wider space for your playing.\nFunctions:\nNew algorithm, new technology, overall tone improvement\n6 delay effects\nDigital Delay: Clean and clear digital delay\nGalaxy Delay: Cut off the sound head of the effect tone, giving you an outer-space-like tone.\nAnalogy Delay: Warm, smooth analog delay.\nReal Echo Delay: Simulate effects generated in the real environment.\nTape Echo Delay: Simulate effects generated by the old tape delay machine.\nTube Echo Delay: Tube-like sweet sounding effect.\nThree additional effects\nAdds additional effects on the delay effect\nMod: Add chorus effect on the delay\nDynamic: Add dynamic to the delay\nReverse: Simulate the sound of a reversed tape\nLoop recording function\nProvided with 20 seconds recording time and there is no maximum overdub limits. It is equipped with two footswitches, which make recording an easy task.\nDRY and WET Knob\nDRY knob controls the volumn of the guitar sound and the WET knob controls the volumn of the delay effect.\nHI CUT and LOW CUT Knob\nThese two knobs control the high and low frequency of the delay effect.\nStereo input and Stereo output and P.PONG function\nReecho Pro is equipped with Stereo input and Stereo output and P.PONG function, which can make the delay effect generated back and forth in two channels and therefore create a much wider stereo sound.\nTrail ON/OFF function\nTrail ON is the Buffer Bypass mode in which the delay effect will be held even if you turn off the delay effect.\nTrail Off is the True Bypass mode in which the delay effect will be immediately stopped when you turn off the delay effect.\nTone saving\nTo save your tone, simply press down two footswitches together and hold for 3 seconds or longer. To use your saved tone, simply press down two footswitches together again.\nDC 9V Adapter\nCurrent Draw:210mA\nSolid metal shell design\nhttp://www.mooeraudio.com/?product/201410178952.html",
    "hrid": "mooer-reecho-pro"
}