{
    "py/object": "mylib.pedal.Pedal",
    "id": "29343",
    "name": "MF Ring v2",
    "image": "images/moog-music-inc.-mf-ring-v2.jpg",
    "function": [
        "Ring Modulator"
    ],
    "manufacturer": "Moog Music Inc.",
    "current": "25 mA / 9 V / DC / Negative Center",
    "cost": "$159 Price in €",
    "width": 83,
    "height": 144,
    "details": "Minifooger Ring ModulatorThe MF Ring is an analog ring modulator that is based on the best selling Ring Mod in the world, the Moog MF-102.  Its unique tone voicing circuit actually changes the behavior of the ring modulation, allowing for a wider range of modulated behaviors. Create anything from octaves and choral dissonance to harmonic undertones and synthesized lead lines.\nThe expression pedal input provides hands-free control of the Freq control for sound sweeps, pitch shifting effects, and playing between two scales on the fly. Unlike other ring modulation pedals, the MF Ring can also be battery powered.\nHere's what Moog say about the Moog Minifooger Ring Modulator Pedal\nThe MF Ring is an analog ring modulator that is based on the best selling Ring Mod in the world, the Moogerfooger MF-102. Its unique tone voicing circuit adds a new musical dimension to ring modification, making it easy dial in everything from octaves and choral dissonance to harmonic undertones and synthesized lead lines. The expression pedal input provides hands-free control of the Freq control for sound sweeps, pitch shifting effects, and playing between two scales on the fly. Unlike other ring modulation pedals, the MF Ring can also be battery powered.\nCONTROLS\nFREQ- Tunes the frequency of a carrier oscillator to the root note in a scale. The range of this control has been refined to be extremely musical. At lower settings chorus and octaves occur on notes within a chosen scale, while beating and extreme dissonance occur on notes played outside of that scale. At Mid position the sound is buzzy and tight. This is great when paired with the MD Drive for octave-fuzz sounds. At the maximum position the sound is much more synthesized and robotic.\nMIX- Sets the amount of input versus modulated signal. A ring modulator outputs the sum and difference frequencies of your instrument and a carrier oscillator (FREQ). At lower to medium levels, the MF Ring can be used to accompany and accentuate notes. As Mix is increased, you will notice more synthesized and bell-type sounds. At maximum, the input signal is completely gone and only the sum and difference frequencies are heard. This is perfect for creating unpredictable synthesized and electronic sounds.\nTONE- A filter circuit only applied to the effected signal. This allows you to leave in the MF Ring’s natural high frequency chime and buzz, or dial it down for a warmer, more musical character. Because the tracking of the MF Ring is so accurate, this control is particularly useful for dialing in sounds that accompany lead lines, bends, and even chords. It is the perfect way to add unique texture to an idea without it overtaking the sound of your instrument.\nEXPRESSION PEDAL INPUT- This input is assigned to the Freq control. Use it to specify two independent playing keys or create classic sci-fi swells, bit reduction effects, and whammy dives. This input is additive and will allow you to go past the panel settings.\nTrue Bypass\nTone control adds musical flexibility to the sonic capabilities of ring modulation\nEasily go from octaves, beating, and chorus in a scale to electro-insanity\nEasily tune and voice the Freq control to your key of choice\nExpression pedal input control of Frequency for key changes and sound effects\nDesigned to perform with any Guitar, Amp, or Bass guitar configuration\nhttps://www.moogmusic.com/products/minifooger-mf-ring",
    "hrid": "moog-music-inc.-mf-ring-v2"
}