{
    "py/object": "mylib.pedal.Pedal",
    "id": "17274",
    "name": "Tunnelworm",
    "image": "images/mr.-black-tunnelworm.jpg",
    "function": [
        "Flanger"
    ],
    "manufacturer": "Mr. Black",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 71,
    "height": 111,
    "details": "Through-Zero FlangerMr. BlackTunnelWorm – уникальная гитарная педаль-флэнжер, фактически не имеющая конкурентов благодаря своему неповторимому (во всяком случае, в формате педали) звуку. \nНе будем вдаваться в технические подробности и то, чем флэнжер “через ноль” отличается от любого другого (тем более что я сам этого не понимаю). Сделаем это описание резким и дерзким, как удар серпом по хммммм. \nВ общем, кроме обычных для флэнжера потенциометров Width и Rate, TunnelWorm имеет убойный потенциометр Zero. При низких значениях ZeroTunnelWorm звучит как знакомый по восьмидесятым флэнжер (разве что несколько более тёплый, чем мы все привыкли). Но вот если вы найдёте ноль… так, тут требуется пояснение. Для того чтобы “найти ноль”, надо выкрутить влево Rate и Width и найти такое положение Zero, при котором гитары…не будет слышно. Теперь можно задать желаемые положения Rate и Depth и насладиться… насладиться потусторонним, утробным, фееричным, ни на что не похожим, ненормальным, широченным флэнжером. Включив его, сразу понимаешь, что его делал кто-то, кто может написать статью о типах флэнжеров на 2485 слов (она, кстати, доступна в интернете по ссылке ниже). \nP.S. В ходе написания этого описания на мне выросли волосы Роберта Смита (я боюсь, что он придёт за ними), моя жена похудела до 45 килограммов и стала носить исключительно футболки с Яном Кёртисом, Sonic Youth и Echo and the Bunnymen, а дети собрали группу и начали играть пост-панк. Думаю, этого можно избежать, но всё же имей в виду. \nУправление:\n• Width – ширина хмм….глубина ммм….интенсивность…\n• Zero – обязательно отвечать на этот вопрос? Инструкция гласит, что Zero устанавливает какой-то zero point. На самом деле, меняя её положение, ты сможешь получить от прибора много типов флэнжера, а также хорус и ротари.\n• Rate – скорость модуляции. Аха, ответ без запинки! \nСпецификации:\n• питание от адаптера 9 вольт, центр – отрицательный, стандартный Boss-style разъём, возможно питание от батарейки\n• потребление педали: 60 мА\n• размеры: 6 х 11,1 х 4,4 см\n• вес: ~280 г\n• true bypass \nВ комплекте поставки: само устройство, руководство пользователя, стикер Mr. Black. \nСделано в США. \nhttp://www.mrblackpedals.com/products/tunnelworm \nСтатья обо всём, что стоит знать о флэнжерах:\nhttp://www.mrblackpedals.com/blogs/straight-jive/6622058-positive-negative-and-through-zero-flanging-probably-more-than-you-ever-wanted-to-know-about-flanging",
    "hrid": "mr.-black-tunnelworm"
}