{
    "py/object": "mylib.pedal.Pedal",
    "id": "30281",
    "name": "Wet v5",
    "image": "images/neunaber-wet-v5.jpg",
    "function": [
        "Reverb"
    ],
    "manufacturer": "Neunaber",
    "current": "100 mA / 9 V / DC / Negative Center",
    "cost": "$199 Price in €",
    "width": 64,
    "height": 115,
    "details": "ReverbReverb From Natural to Atmospheric, it's Easy with the Wet Reverb\nDialing in a great tone shouldn't be a daunting task. Designed for compact flexibility, the Wet Reverb gives you the power to craft your reverb sound with three straightforward controls.\nYou want a reverb that can be huge and endless, warm and organic, or simply add a subtle sparkle. You set high standards for yourself and your tone, so add something special to your sound that doesn’t get in the way.\nIntroducing the Wet Reverb v5 — an update to the fan-favorite reverb pedal. The new Wet Reverb has everything you loved about its predecessor, plus a little more.\nSimple 3-knob layout makes it easy to quickly dial in your perfect reverb sound. You’ll spend less time twiddling knobs and more time actually playing.\nTwo effects in 1 pedal lets you instantly choose the classic Wet reverb from the previous-version pedals or the new, magical W3T reverb from the Immerse Mk II and plug-in. No more worrying if you picked the right pedal, because you’ll have the best of both!\nFull Mix knob adjustment from 0% to 100% wet. Dial in the perfect amount of reverb, from just a touch of space to deep, inspiring ambience.\nAnalog dry signal for low noise and zero latency. Maintain the integrity of your source tone.\nSmall footprint with top jacks, the Wet Reverb is pedalboard-friendly. You can easily fit the Wet in any setup, no matter how tight.\nSelectable trails allows you to choose whether the effect naturally trails or cuts off abruptly after the effect is bypassed.\nMono input & output makes setup quick and simple. Easy access to inputs and outputs makes this pedal perfect for on-the-go use.\nPowered from a standard 9V pedal power supply, the Wet Reverb draws less than 100 mA and can be powered by your existing pedalboard’s power supply. No need to run a separate power adapter or free up a power port for a hungry, high-current device. Just plug and go, it’s that easy.\nManufactured locally in Orange County, California. Family owned and operated, Neunaber Audio is dedicated to bringing you the highest quality audio effects on the market.\nhttps://neunaber.net/products/wet-reverb-v5",
    "hrid": "neunaber-wet-v5"
}