{
    "py/object": "mylib.pedal.Pedal",
    "id": "13209",
    "name": "Cali76 Compact Bass",
    "image": "images/origin-effects-cali76-compact-bass.jpg",
    "function": [
        "Dynamics",
        "Bass"
    ],
    "manufacturer": "Origin Effects",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 66,
    "height": 142,
    "details": "FET Compressor PedalThe Cali76 Compact Bass is an 1176-style studio-grade FET compressor, complete with dedicated controls for parallel compression and side-chain filtering. Origin Effects have taken everything that was great about the original Cali76, added new features optimised for bass and compressed the whole lot down into a pedalboard-friendly package!\nA single combined Attack/Release control provides a continuous sweep of useful settings while avoiding combinations that can result in ugly distortion artefacts creeping into the lower registers. Meanwhile, the elegant jewel lamp functions as a three-colour gain reduction meter, providing vital and intuitive feedback to the player.\nThe Cali76 Compact Bass delivers natural, musical compression exactly where you want it, letting the lower strings breathe for more dynamic transfer and greater perceived girth.\nIn addition to this pedal’s low-noise circuitry and fast, musical FET response, two special features lift the Cali76 Compact Bass above the competition.\nThe first is the Dry Blend control, which lets you mix your dry signal back in with your compressed signal for true parallel compression, an indispensable studio recording technique. By combining the compressed and dry signals, you get all of the tone thickening and increased sensitivity of the Cali76's 1176-style compression, while retaining the natural attack and dynamic expression in your playing. It’s the ultimate in transparent compression - both fat and punchy at the same time.\nThis pedal's second secret weapon is also culled from the studio engineer's handbook. The Cali76 Compact Bass allows you to rein in the amount of compression applied to the lowest frequencies via a variable-frequency high-pass filter placed in the compressor's side-chain. With the HPF control dialled in, the compression ratio effectively becomes frequency dependent. The low strings come back to life, adopting an extra weightiness, power and dynamic response, while the higher strings are strictly controlled, preventing slapped and popped notes from leaping out of the mix. This unique bass compressor is like having your own studio engineer sat on your pedalboard!\nSmaller size with no compromise\nThe original Cali76 is a big, beautiful compressor pedal that delivers studio-quality 1176-style compression using discrete Class-A circuitry that’s true to the topology and design philosophy of the original.\nThe Cali76 Compact Bass is cut from the same cloth, sharing the features, performance and pedigree of its larger sibling, but with added parallel compression and a side-chain filter optimised for bass, all in a stompbox a third of the size of the Cali76 Standard.\nLike all of our Compact Series pedals, the Cali76 Compact Bass features high-current, discrete, Class-A circuitry for transparent, low-noise performance. Origin Effects have taken a no-compromise approach to the circuit design using only the best of modern components.\nRugged MELF resistors offer low noise performance and rock-solid reliability. Film and tantalum capacitors offer tight tolerances and superb linearity. Carefully chosen transistors biased at relatively high currents yield a distinct signal-to-noise advantage.\nPlease note: the Cali76 Compact Bass is powered by a mains adaptor only (not included). The usual 9V battery option is not present, both to save space and to allow us to adopt a high-current approach, yielding lower noise levels and superior tone.\nhttp://sxpro.co.uk/origin-cali76-compact-bass",
    "hrid": "origin-effects-cali76-compact-bass"
}