{
    "py/object": "mylib.pedal.Pedal",
    "id": "26856",
    "name": "G-2",
    "image": "images/pete-cornish-g-2.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Pete Cornish",
    "current": "20 mA / 9 V / DC / Negative Center",
    "cost": "",
    "width": 121,
    "height": 171,
    "details": "Class-A germanium with buffer preampThe PETE CORNISH G-2™ has been hailed as the most original sounding distortion unit available to guitarists in the Rock Arena. It features a four stage overdriven discrete transistor Class A circuit with additional Germanium components that generate much warmer sounding harmonics than anything else on the market. Within the huge tone generated by this unit, the original guitar sound and dynamics are present creating a much more musical effect than any other distortion pedal.\nThe G-2™ gives a higher level of overdrive for that classic cranked up Marshall sound found on most British rock records of the 70s (Led Zeppelin, Free, Bad Company etc.). The G-2™ with its warm Germanium qualities and higher gain starts at around the rhythmic crunch stage of the SS-3™ and continues through in controllable degrees to a rounded but dynamic lead.\nThe input to this unique device is our universally acclaimed High Impedance, Unity Gain, Class A, Buffer Preamp with it's superior RFI rejecting capability (to eliminate Radio Station interference) and Low Impedance output, allowing the use of extended cable runs from the G-2™ in bypass mode. The fixed High Impedance load presented to the Guitar allows the pickups to operate at their optimum, even when several effects units are connected after the G-2™. The Unity Gain Buffer also prevents \"Ghost Distortion\" being audible in Bypass Mode. This effect unit gets the most benefit from being fed into a clean, full frequency response amplifier and I recommend that when you receive your pedal you connect it up without anything else in line, just Guitar/Pedal/Amp, and discover the way the controls interact, both with themselves and the guitar/amp controls. Then adding the rest of your effects, you may find that you need to make slight adjustments to these as they are now being fed with a constant signal when the G-2™ is in Bypass Mode.\nFEATURES:\nHigh Impedance RFI rejecting input and bypass buffer.\nEach unit is hand built, wired and tested by Pete and Lynda Cornish.\nHoused in a Rugged Die-cast box with ‘Chicken-Head’ pointer knobs.\nHeavy Duty all-metal footswitch with Hi-Brite, low power consumption LED.\nEasy battery replacement via the ‘drawer’. The battery is switched on when you insert the “IN/PWR” jack and to ensure long battery life unplug this lead when the unit is not in use. If the unit is not to be used for a long length of time we recommend that you remove the battery. Preferred battery type is Alkaline.\nAlso fitted is an input for a DC adaptor: the size of the coax connector is 5.5/2.1mm and the centre pin is negative (-VE). The voltage rating of the adaptor should be noise free, fully stabilized at 9.6V and capable of supplying 20mA. We recommend the use of the BOSS PSA series adaptors (PSA-100/110/220 or 240 depending on your local AC supply voltage) as meeting the above criteria and cannot accept any liability for damage caused to this unit by the use of, or to, any other type of AC/DC adaptor.\nAlthough the current consumption of our Stand Alone pedals is extremely low, giving an extended battery life, it may be appropriate to use an AC/DC Adaptor for long term usage. If a single pedal only is in use then the Boss PSA series will be cost effective but we do not recommend this unit for powering multiple effects as ground loops can become troublesome.\nAfter extensive testing for both noise, stability and reliability we have pleasure in recommending the Voodoo Lab Pedal Power 2 Plus as being suitable for powering our range of stand alone pedals - particularly when multiple effects are in use. The isolated outputs of the Pedal Power 2 Plus prevent the occurrence of ground loops and the noise level is too low to measure.\nhttp://www.petecornish.co.uk/SAEG-2.html",
    "hrid": "pete-cornish-g-2"
}