{
    "py/object": "mylib.pedal.Pedal",
    "id": "19486",
    "name": "Echolution 2",
    "image": "images/pigtronix-echolution-2.jpg",
    "function": [
        "Delay",
        "Dual/Stereo"
    ],
    "manufacturer": "Pigtronix",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 145,
    "height": 120,
    "details": "Echolution 2An in-depth echo pedal that marries analog tone shaping and DSP technology.\nPigtronix Echolution 2 is a user-friendly and fully programmable stereo modulation delay that supports 60 user-editable presets that can be recalled instantly. Under the hood of this elegant user interface lurks a vast array of additional modes and features with which to craft an unlimited number of sonic textures. Unlike other delay pedals, every algorithm in the Echolution 2 can be run simultaneously, in any combination. A free PC/MAC application for the Echolution 2 enables real time editing and access to all of the advanced sound design functions as well as online sharing of presets via USB.\nAnalog i/o\nEcholution 2 features stereo inputs and outputs, sporting an all analog dry signal path along with extensive analog tone shaping and filtering before and after the 24-bit, variable-clock digital delay line. Rather than try to model the sound of analog delays in DSP, the Echolution 2 uses real analog filters and non-linear saturation stages to achieve its signature sound with a smaller footprint, higher fidelity and far greater functionality than its predecessors.\nDelay Line\nAvailable delay time goes from 10ms up to 12 seconds instantly settable via knob, tap tempo or MIDI. Changing the delay time manually results in the smooth pitch change of an analog tape unit, with a unique twist that allows octave up and down jumping. The delay line can also be turned off, to allow for the advanced modulation, pitch shifting and filter capabilities to be used as stand-alone effects.\nMulti-Taps\nThe multi-tap capabilities of the Echolution 2 allow for the use of one or two discreet delays which can be assigned to musical subdivisions of the master delay time. Multi-tap selections include 1, 3/4, 2/3, 1/2, and PHI (the golden ratio). One or any combination of two taps can be selected, allowing for instant access to all of the most crucial musical echo patterns as well as a wide range of unconventional polyrhythms.\nLFO Modulation\nThe modulation section of the Echolution 2 features sample rate modulation where both the read and write heads of the delay line are affected by one of four different LFO waveforms (Sine, Square, Saw or Random). Each of these LFO waveforms can also be quantized with a STEP mode and will run freely or sync to either tap tempo or MIDI with variable sync ratios from 1:8 to 8:1.\nFilters\nThe Echolution 2 sports four all new filter modes (Low Pass, Tape, Comb and Sweep). Each of the first three modes can be combined with the SWEEP filter which is modulated by the LFO as described above. Any of these filter settings can then be run through a unique Pigtronix BIT CRUSHER destruction filter within the delay line as well.\nExpression / Envelope\nEvery knob on the Echolution 2 can be mapped to the expression pedal. Using the included software, multiple functions can be mapped to expression with adjustable range for each parameter. Additionally, an envelope follower within the pedal can also be mapped to any parameter, with user definable sensitivity and release time for each function.\nThe Kitchen Sink\nAdvanced features such as Reverse, Ducking, Trails, Listen and Ping Pong modes are augmented by a unique Halo Shimmer function, which causes the echoes to rise in octaves on each repeat. The externally triggered Freeze function allows you to loop the content of the delay line and an all new footswitch activated Jump function sends your echoes cascading up in octaves when desired. The TRS remote switch accessory pedal for the Echolution 2 provides Jump and Freeze functions as well as instant access to four favorite presets in each bank.\nPresets\nEcholution 2 supports up to 60 custom presets contained in 6 banks of 10, all of which can be edited in real time via the front panel and saved to the machine. Hands free Preset selection is accomplished by holding down the onboard TAP switch, using an external remote footswitch or via MIDI preset change command. The included PC/MAC application allows even deeper real time editing as well as the ability to import artist presets and share your own custom presets online.\nMIDI\nMIDI IN provides instant preset change, Tap Tempo and LFO synchronization with an external source as well as remote control over every function of the Echolution 2. MIDI OUT allows for tap tempo control over the Pigtronix Infinity Looper and other MIDI capable devices. The USB port on the Echolution 2 provides connectivity to MAC or PC computers, allowing you to run the free Echolution 2 application for preset management and real-time tweaking of advanced parameters.\nFEATURES\n10ms - 12sec delay time\nTrue Stereo i/o\n15 multi tap patterns\nTap Tempo or Manual Control\n8 Modulation Waveforms\n8 Filter modes\nLFO Sync to Tap and MIDI\nBit Crusher Destruction\nReverse Delay\nDucking\nExpression pedal control of all parameters\nEnvelope control of all parameters\nPing Pong\nOctave Jump Delay\nHalo \"Shimmer\" Effect\nFreeze Effect\nDelay Line Bypass\nDry Kill\nTrails / Listen\nRemote Preset Selection\nComplete MIDI control\nMIDI out\n60 presets\nUSB connectivity\nFree PC / MAC Editor",
    "hrid": "pigtronix-echolution-2"
}