{
    "py/object": "mylib.pedal.Pedal",
    "id": "12528",
    "name": "Mothership",
    "image": "images/pigtronix-mothership.jpg",
    "function": [
        "Pitch Shifter",
        "Ring Modulator",
        "Synth Voice"
    ],
    "manufacturer": "Pigtronix",
    "current": "? mA / ? V / AC/DC",
    "cost": "$499 Price in €",
    "width": 188,
    "height": 117,
    "details": "Analog Guitar SynthesizerPigtronix Mothership is an analog synthesizer featuring VCO, Sub-Octave and Intelligent Ring Modulator. Incredibly fast tracking and ultra FAT tone make this unique synthesizer ideal for use with guitar, bass, horns, vocals or any other musical instrument. No special pickup or interface is required.\nAt the heart of the Mothership is a revolutionary note recognition system that achieves instantaneous and accurate pitch to voltage translation. The Mothership is a true analog monosynth with a limitless array of tuning options between its voices covering 8 octaves\nVCO – The main voice of the Pigtronix Mothership is a VCO (voltage controlled oscillator) that outputs either triangle or square waves. An adjustable portamento (glide) effect can be added to produce subtle slides from note to note or outrageous multi-octave glissando maneuvers. An expression pedal jack for Whammy control provides tunable pitch bending up to one octave using a TRS Expression pedal. That’s right… ANALOG WHAMMY!\nSub-Octave – The octave down is a massive, earthshaking sine wave bass tone that remains locked to the input signal. A dedicated SUB Out jacks allows low frequencies to be sent to a separate bass amp or house DI for maximum booty.\nIntelligent Ring Modulator – Pigtronix unique pitch tracking ring modulator follows every note you play, retaining the exact harmonic intervals between its output and the signal it is tracking. A “ring mod source,” switch lets the ring modulator follow either the input signal or the VCO signal, providing an immense array of analog textures and interactive harmony. The glide and whammy functions also apply to the intelligent ring modulator, letting the musician morph one harmony into another and then back again.",
    "hrid": "pigtronix-mothership"
}