{
    "py/object": "mylib.pedal.Pedal",
    "id": "12172",
    "name": "Patch Box",
    "image": "images/pittsburgh-modular-patch-box.jpg",
    "function": [
        "PreAmp",
        "Switch",
        "Utility"
    ],
    "manufacturer": "Pittsburgh Modular",
    "current": "? mA / ? V / AC/DC",
    "cost": "$350 Price in €",
    "width": 244,
    "height": 229,
    "details": "Eurorack Guitar Interface and EnclosurePatch Box Specs:\n100% Eurorack Modular Format Compatible\nAvailable Width for Modules: 213mm (42hp)\nHeavy Duty Steel Case Construction\nAvailable Depth for Modules: 42mm\n9 Sliding Square Nuts Per Rail Supports Up To 9 Modules\n20 (4-40 Size) Black Panel Screws Included\nTrue Bypass Foot Switch\nDual, Assignable A/B Foot Switches\nPatchable High Quality Pre-Amp with Overdrive\nPatchable Output Level Attenuator\nDual, Assignable Expression Pedal Inputs\nPatchable Passive Multiple Signal Splitter\nOutput Jack Controlled On/Off Switch\nPowered Bus Board supplies +12v / -12v / +5v\nCustom Powered Bus Board with 6 Keyed Power Headers\nEurorack Bus Compatible Bus Board\nRear Mounted 2.1mm DC Power Jack\n15VAC 2.6A DC Universal Power Adapter\nPatch Box Power Supply:\nTotal Power Output: +12v @ 900mA, -12v @ 900mA, and +5v @500mA\nIntegrated bus board delivers power for up to 6 modules using standard 16 pin, keyed eurorack power headers.\nThe power supply uses an external 15V DC 2.6A 2.1mm barrel jack universal power adapter.\nPatch Box Dimensions:\nExternal Width: 244mm\nExternal Length: 229mm\nExternal Depth (including feet): 51mm\nMinimum Depth Available for Modules: 42mm\nMaximum Depth Available for Modules: 42mm\nAn epic shift in the definition of what a modular can be. The Pittsburgh Modular Patch Box redefines modular synthesis around the venerable stomp box. A monster performance device for guitarists and synthesists alike. A patchable, modular system designed to handle anything.\nA playground for unrestricted creativity, the Patch Box is a fully patchable, customizable effects pedal. The open architecture allows the patch box to create unique effects unattainable with standard, fixed signal path guitar pedals.\nThe Patch Box is not just another empty eurorack case. It ships packed with the functionality of five highly tuned modules integrated into the heavy duty steel enclosure.\nTo protect your instrument's tone, we included true bypass switching. Once the Patch Box is engaged, the audio signal passes through a unique preamp with extremely high headroom and a pair of fully buffered outputs. Custom engineered soft limiting circuitry built into the preamp adds everything from clean gain to sweet distortion without overdriving the modules within the Patch Box.\nDual, assignable expression pedal inputs allow the Patch Box to integrate 3rd party expression pedals anywhere into the signal path. This allows for realtime foot control of any voltage controllable parameter. Or split the signal from the foot controller and control two parameters at once.\nDual, assignable A/B footswitches expand signal routing options. Perfect for use as on/off switches or to flip between two signals, the footswitches can be patched up to enable/disable individual modules or route audio and control voltages. Patch a modulation source such as an LFO or external expression pedal through the footswitch to enable or disable the modulation while playing. Patch the outputs of two effects into one of the footswitches to bounce between effects. With two independent, patchable footswitches, there are countless options for realtime signal routing.\nThe preamp has dual buffered outputs to allow for complex signal routing, but for patching a single modulation or audio source into two destinations, the patchable signal splitter is a perfect solution. Also known as a multiple, the signal splitter has one input and two outputs allowing any signal to be routed to two destinations.\nThe last stage of the Patch Box signal path is a master output level control. Adjust the output signal level to connect with a wide range of devices. \nThe Patch Box is available as an empty case, ready to customize with a huge selection of Pittsburgh Modular, Dwarfcraft, or other compatible eurorack format modules. The Patch Box is also available in a number of preconfigured ‘Complete’ and ‘Core’ effects systems that highlight the wide range of Pittsburgh Modular and Dwarfcraft effects modules. Stunning filters, character rich analog delays, sweeping phase shifters, nasty distortion, and much more are available to interact with and manipulate in entirely new ways.\nhttp://pittsburghmodular.com/patch-box/",
    "hrid": "pittsburgh-modular-patch-box"
}