{
    "py/object": "mylib.pedal.Pedal",
    "id": "23826",
    "name": "Tonebone Bassbone V2",
    "image": "images/radial-tonebone-bassbone-v2.jpg",
    "function": [
        "Bass",
        "Distortion"
    ],
    "manufacturer": "Radial",
    "current": "? mA / 15 V / DC / Negative Center",
    "cost": "$290 Price in €",
    "width": 175,
    "height": 114,
    "details": "Bass Preamp DI w/ FX sendThe Bassbone V2 is a bass command center that enables one to seamlessly switch between any two bass guitars including active, passive (magnetic) and upright (piezo). When the PZB booster  is  engaged  the  PZB  activates  a  special  boost  circuit  for  piezo  transducers  that  at  once increases the sensitivity and impedance to 10 meg-Ohms, this results in a much wider frequency response. Two channels let you set up each instrument with their own tone and signal level. channel-1 features two preset tones that will bring a modern vibe to older vintage amps. channel-2 features a powerful passive-interactive EQ that lets you carve out any tone. When Input-2 is not in use the Bassbone reverts to a 2-channel preamp that lets you create two completely different tones with one bass. A built-in effects loop lets you to share pedals with both basses and this is supplemented with a variable power booster for solos and a mute switch for quiet-on-stage tuning. a built-in Radial DI box delivers the performance to the PA or recording system.\nFeatures\n•  2 channels for two tones or two basses\n•  PZB piezo boost for upright bass\n•  Powerful EQ for tone shaping\n•  Built-in effects loop and DI box\nBenefits\n•  Switch between two basses on stage\n•  Lets you perform without an amp\n•  Delivers your tone to the PA system\n•  Puts you in control of your sound\nCool stuff\n•  Works equally well in studio as it does live\n•  Mute switch for quiet tuning on stage\n•  Can make any bass sound dramatically different\n•  Super compact yet extremely powerful\nDimensions (W x D x H)\n•   6.8” x 4.5” x 2”  (175mm x 114mm x 52mm)\n•   Includes 15VDC power supply\n•   3  Year transferable warranty\nhttps://www.radialeng.com/product/bassbone-v2",
    "hrid": "radial-tonebone-bassbone-v2"
}