{
    "py/object": "mylib.pedal.Pedal",
    "id": "15249",
    "name": "Empress Chorus",
    "image": "images/red-witch-empress-chorus.jpg",
    "function": [
        "Chorus"
    ],
    "manufacturer": "Red Witch",
    "current": "? mA / ? V / AC/DC",
    "cost": "$299 Price in €",
    "width": 118,
    "height": 94,
    "details": "Stereo Guitar Chorus/Vibrato Pedal with Mix Control, Depth Control, Velocity Control, Voicing Control, and Internal Input AdjustEmpress Chorus Vibrato Pedal\nNo ordinary analog chorus/vibe pedal.........\nThe Empress Chorus offers unparalleled chorus options; an infinite number of analog chorus/vibe devices in one box…\nThe effect was popularized by Andy Summers in the early 1980’s with his work in The Police – and we were delighted to learn that he chose our Empress Chorus to fulfil all his chorus requirements on The Police Reunion tour.\nThe Red Witch Chorus is the only chorus pedal in the world to offer an adjustable delay setting. It changes the delay time – it’s on a pot so you’ve got an infinite number of chorus pedal sounds in one box – from super spanky sparkling clean to over the top sea-sick inducing, pitch bending wobble.\nThe delay setting in all other chorus units is preset to one setting – producing only one voice or flavour.\nThe Empress allows the user an almost infinite number of flavours by adjusting the “voice” control - an innovation never before offered and only available in the Empress.\nAs well as Andy Summers, folk like Jon Hudson (Faith No More), Sigur Ros, Paul Stacey (Oasis) and Terry Lawless (U2) consider the Empress Chorus to be a favorite.\nFeatures:\n\n100% analog chorus pedal\nUses original MN3007 BBD chip\nChorus and vibrato mode\nUnique adjustable voice controls chrous delay time\nStereo – splits wet and dry\nTrue bypass\n9 volt battery or DC 9volt wall wart\n\nSpecs:\nCurrent draw: 25ma\nWeight: 395grams\nDimensions: 118mm x 38mm x 94mm\n\n“Ben Fulton, the man behind Red Witch, has succeeded in designing a chorus pedal that is capable of dialing in pretty much any chorus sound you may have floating around in your head while not relying on past sounds to get you there. ” (Premier Guitar Magazine, June 2008)\n\n\n\n“The Empress is a three-dimensional modulation machine, and when you couple its vast array of sounds with absolutely wicked construction – and some cool graphics – you’ve got one of the drippiest sounding chorus/vibrato pedals ever made.” (Guitar Player, May 2008)\n\nhttp://www.redwitchpedals.com/empress/",
    "hrid": "red-witch-empress-chorus"
}