{
    "py/object": "mylib.pedal.Pedal",
    "id": "12141",
    "name": "RMC3",
    "image": "images/rmc-rmc3.jpg",
    "function": [
        "Filter",
        "Wah"
    ],
    "manufacturer": "RMC",
    "current": "? mA / ? V / AC/DC",
    "cost": "$200 Price in €",
    "width": 92,
    "height": 254,
    "details": "Teese Real McCoy Custom WahLOW-Controls the amount of low frequencies present in the wah's sweep.\nMID-Controls the mid-range depth of the sweep. This control affects the vocal-like quality of the wah, as the human voice falls mostly into this range.\nQ-Controls the attack, sharpness, and contour of the sweep. The Q can be anywhere from a smooth US Thomas Organ wah at minimum to a very sharp attack like found on early Clyde McCoy Picture wahs.\nVOLUME-Allows you to adjust the output strength of the wah.\nSWEEP-This bank of 9 DIP switches allows you to select your desired sweep within a 9 octave range. The switches may be used in any combination to create familiar wah sweeps as well as some never before available. The voicing parameters go from higher than the old SCHALLER Bow-wow/Yoy-yoy pedal to deeper than any bass wah.\nFINE TUNE-These 2 trimmers work in conjunction with the SWEEP DIP switches to allow you access to values \"in-between\" switch settings. The effect of these trimmers is slight and might not be audible to every player. For those that can hear the difference, they are available.\nJust like all RMC wahs, the RMC3 is designed and built by Geoffrey Teese and includes licensed fuzz-friendly technology (as of October 2006), true-bypass, exclusive RMC ROC-POT5 extra long-life sealed potentiometer (as of 2008), easily adjustable rocker tension (as of October 2006), and AC adapter jack,\nThe RMC3 has a fully adjustable, tuneable circuit that can be made to sound like any other wah, and other wah sounds that you can only imagine! The adjustable parameters are treble, bass, mids, intensity, gain, range of sweep, and location of resonant peak. The adjustments are all hand labeled on the circuit board. You have to pull off the bottom of the wah and use a small screwdriver to make the adjustments. The factory setting is a nice Clyde McCoy sound, I don't need any further adjustment! The manual has settings for SRV, Hendrix, Clapton, Santana, Colorsound, and Thomas organ sounds to give you some ideas.\nThe switch is wired for a TRUE BYPASS, so that when the wah is off, it does not affect your tone like most wahs. All RMC wahs have true bypass. 9V DC adaptor jack (Boss style) now standard, along with RFI filtering. Used by Trey in Phish, Slash, George Lynch, Page Hamilton, THE BLACK CROWES, Joe Holmes (Ozzy), Monster Magnet, and many other professionals.\nBy Geoffrey Teese\nThe REAL MCCOY CUSTOM THREE WAH-WAH PEDAL was created to allow guitarists to tailor their wah effect to their own \"dream sound\" and is not merely a Clone-O-Wah. With a little time and attention, guitarists can mimic the sweep and tones of most all U.S. and Italian made vintage Thomas Organ Company wahs and their modern counterparts, as well as most any other wah ever made. But, the beauty of the RMC3 lies in it's ability to let you create your own sounds and wah textures. You know, the ones you've been carrying around in your head forever! The RMC3 can also be adjusted to suit both novice and advanced players. You are able to dial in wah sounds that range from one with a narrow range and smooth attack all the way to a Colorsound-rivalling range with attack sharper than an original Picture Clyde McCoy. Therefore, it takes a little time to break in your sound, much like breaking in a new set of strings. Play a little, tweak a little, play a little more, tweak a little more. Putting this time into building your own wah tone is essential. When you're done, you will be amazed at what the RMC3 has allowed you to do.\nThe physical feel of all RMC3 models is also different than the stock mass produced wahs. Many players report that they prefer the tactile response of the RMC3 to other pedals that they have used. The fact that the RMC3 is built by hand and not machine helps to account for this. There is no factory, no machine, and no assembly line that produces the RMC3. It is entirely built by hand. One set of hands, mine. This wah is as personal as it can get. From the 100,000+ cycle lifetime of the recreated ICAR taper pot to the reissue of the old Thomas (brown) inductor, extreme care has been taken to insure accuracy of the neo-vintage components.\nTuning Instructions for the RMC3\nTHERE ARE SIX VARI-TUNE CONTROLS ON YOUR RMC3 BOARD\nLOW - The LOW (1st/top) trimmer enhances or cuts the low frequencies in the sweep. This control affects resonance, and acts as an output booster due to the increased strength of the frequency enhanced signal. The Q contour should be checked after adjusting this trimmer.\nMID - This (2nd) trimmer boosts or cuts mid-range frequencies and also effects vocal quality, as the human voice falls mostly into mid-range frequencies. It can be used to subtract some of the boominess which may come from saturation of the LOW control.\nQ - The (3rd) trimmer controls the Q, or resonance, of the inductor. Turning this trimmer changes the resonant peak contour (sweet spot), affecting where and how quickly it occurs in the pedal's sweep. The effect is smoothest and most like the U.S. made V-846 at minimum (counterclockwise) rotation, and sharpest, most closely resembles the Picture Clyde McCoy at the maximum (clockwise) rotation.\nVOL - (4th) This controls the \"wet\" signal output strength and is used to balance the affected signal with the bypassed signal, so there is no drastic change in volume when the pedal is switched in or out.\nFINE TUNE - The two trimmers (5th & 6th) let you subtly fine tune the primary SWEEP DIP settings. Turning the trimmer to line up with the \"leg\" (solder point @ 9:00) adds bass. Turning the trimmer to the 3:00 position adds treble. While these tuners can be turned 360 degrees, only the half-turn from 9:00 to 3:00 is required to make the transition from bass to treble.\nSWEEP - The 9 pole DIP switch expands or compresses the sweep range of the RMC3. The switches are set up in a sonic progression. Switch #1 equals the maximum sonic value of FINE TUNE. Switch #2 is the sonic equal of Switch #1 and FINE TUNE together... and so on. This overlapping stairstep sequence lets you select the depth and width of the RMC3's actual frequency sweep. The higher the number switch(es) selected, the wider and deeper the sweep will be.\nThese VARI-TUNE controls allow you to adjust your RMC3 to emulate almost any wah pedal made.",
    "hrid": "rmc-rmc3"
}