{
    "py/object": "mylib.pedal.Pedal",
    "id": "31727",
    "name": "MC-707",
    "image": "images/roland-mc-707.jpg",
    "function": [
        "Synth Voice"
    ],
    "manufacturer": "Roland",
    "current": "2000 mA / ? V / AC/DC",
    "cost": "$999 Price in €",
    "width": 426,
    "height": 263,
    "details": "Modern GrooveboxThis modern GROOVEBOX packs a lot of punch in a single piece of gear. It’s deep and customizable, yet fun and friendly, always ready to create something new. Compose from a curated collection of built-in sounds, beats, and phrases all expertly crafted by renowned artists and sound designers. Explore a musical playground, where you can freely combine loops and one-shots with melodic phrases, including your own audio recordings and MIDI sequences. Record and chain clips, re-arrange, re-sample, record automation, and make it all sound huge with per-track and global effects.\nThis modern GROOVEBOX packs a lot of punch in a single piece of gear. It’s deep and customizable, yet fun and friendly, always ready to create something new. Compose from a curated collection of built-in sounds, beats, and phrases all expertly crafted by renowned artists and sound designers. Explore a musical playground, where you can freely combine loops and one-shots with melodic phrases, including your own audio recordings and MIDI sequences. Record and chain clips, re-arrange, re-sample, record automation, and make it all sound huge with per-track and global effects.\nThe MC-707’s eight-track sequencer is optimized for fluid production of today’s electronic-focused music styles and ever-evolving subgenres. The TR-REC step sequencer is just like those found on classic Roland drum machines, perfect for building rhythm parts quickly. There are also 16 ultra-sensitive pads for playing or sequencing drum parts, melodic basslines, or polyphonic chord progressions. Sequences are stored in clips that contain your sounds, note data, and live knob movements or drawn automation. This lets you create moving effects like a deep reverb on a single clap, slow filter sweeps, and much more. Clips can be triggered or chained into songs and creative tools like note repeat, chord designer, and step LFO supercharge new ideas.\nThe MC-707 features our latest sound engine, which fuses virtual analog and modern PCM. It’s flexible, powerful, and lets you dig deep into its sonic capabilities. It has the sounds of legendary Roland rhythm machines and synthesizers that are the foundation of electronic music—including the TR-808, TR-909, TB-303, JUNO-106, and SH-101. But the MC-707 also looks forward, with modern digital and hybrid sounds perfect for creating future classics—today.\nIn addition to its deep synthesis engine, the MC-707 has a powerful sampler with on-the-fly recording that synchronizes to your project’s tempo. Record vocals or instrument parts, or import from your own existing library, then sequence or trigger phrases, one-shots, and loops. You can also tweak and mangle samples by slicing, truncating, and reversing—with the inspiration and precision that comes only from hands-on control.\nWith the MC-707’s massive effects palette, your music sounds polished and fully produced. All eight tracks have independent effects processors with a huge number of variations. Lush chorus brings depth to pads and other synth sounds. Delays and reverbs create evocative spaces and add movement to delicate sequences. Overdrive, distortion, and amp simulation inject grit and intensity into synths, guitars, drums and more. You can process external audio and run your entire mix through master effects like filters, bit-crushers, and a master bus compressor that glues it all together with punch and clarity.\nLoaded with hands-on controls, the MC-707 lets you dig in and shape your music in a visceral, physical way. Faders for each track let you immediately mix and arrange parts, and knobs can be freely assigned to any control you need. You can even record your knob movements so they play back automatically. And the 8x2 pad array is not only great for playing drums and triggering clips—you can generate repeating rhythms, create melodies, constrain to any kind of scale, and trigger complex chords.\nWith its advanced USB audio interface capabilities, the MC-707 easily flows in and out of your production setup. You can record all eight parts to individual DAW tracks and finish your song there. Or sample sounds from your DAW to capture backing tracks, stems, or the sound of a favorite software synth for your next live show.\nhttps://www.roland.com/global/products/mc-707/",
    "hrid": "roland-mc-707"
}