{
    "py/object": "mylib.pedal.Pedal",
    "id": "12144",
    "name": "VG-99",
    "image": "images/roland-vg-99.jpg",
    "function": [
        "Modeling/Simulation",
        "Multieffect"
    ],
    "manufacturer": "Roland",
    "current": "? mA / ? V / AC/DC",
    "cost": "$550 Price in €",
    "width": 384,
    "height": 218,
    "details": "Dual modeling engines allow guitar and amp models to be dynamically switched, layered and combined\nNew COSM electric, acoustic and even bass guitar models, and new synth waves such as the famous GR-300\nGuitar to MIDI converter for direct connection to keyboards, sound modules, soft synths, computers, and other MIDI-compatible devices\nSupports USB audio and MIDI for easy digital recording and sequencing\nDual GT-Pro-class effects processor enables unequalled flexible tone creation\nAdvanced performance controls, including D BEAM, V-LINK and Ribbon Controller take guitar performance to a whole new level\nSimple and intuitive knob-based interface and new design support live performance\nGraphical Editor software included to support sophisticated sound making\nVersatile I/O, including USB, S/PDIF and XLR provide pro connections for virtually every type of music production and performance on stage to professional studio recording\nMulti Modeling\nThe VG-99 contains an incredible range of COSM-modeled guitars and amplifiers including new electric, acoustic and bass guitar models, a new GR-300 synth wave and much more. It even models two signal paths at once. Complete dual processing of guitar modeling on the VG-99 allows you to play two different guitar sounds simultaneously. For example, one virtual guitar could be a Telecaster® in a vintage Tweed amp with full effects and the other a nylon-string guitar with just a hint of reverb.\nDynamic Control\nBoth modeled guitar and amp paths can be active at the same time, or they can be dynamically switched or blended. You can control the switching behavior between virtual guitars and/or amps by foot controllers, buttons/knobs on the unit, or according to your picking dynamics. Imagine playing softly for an acoustic-guitar sound, then transitioning to a full metal blast simply by picking more aggressively. Furthermore, each modeled guitar can be separately assigned to individual guitar strings. For example, you could have a 12-string guitar on 1st to 4th string and Synth-bass for 5th and 6th.\nAlternate Tunings\nThe VG-99 can produce custom tunings — anything the player desires on any virtual guitar. A virtual Les Paul®, for example, could be tuned down four or five steps for a heavy sound, while a nylon string could be tuned as a 12-string, and also tuned down four or five steps at the same time. Open and drop tunings are also supported as well as user-defined custom tunings and can be applied to any COSM guitar, so the player can switch instantly between tuning setups without physically switching guitars or having to manually retune.\nGuitar Performance in Higher Dimension\nWith its new performance-based design, the VG-99 can be placed within a player’s easy reach on stage by using an optional PDS-10 stand. This new style setup allows various new performance possibilities such as D BEAM, Ribbon Controller and more. In combination with the versatile new foot controller FC-300, the VG-99 takes your guitar performance on stage to a whole new dimension.\nMost Wanted\nYou asked for it, now Roland delivers the most-requested new features in the VG-99, including an onboard guitar-to-MIDI converter for direct connection to keyboards, sound modules, soft synths, etc. Audio output via USB or S/PDIF digital out, and optional RAD-99 rack mount adaptor further enhance your music production environment. Built-in stereo XLR and 1/4\" outputs are ideal for live stage performances and touring. The striking new on-screen editor makes programming the VG-99 super easy and fun.\nAUDIO PROCESSING\nAD Conversion\n24 bits + AF method\nDA Conversion\n24 bits\nSampling Frequency\n44.1 kHz\nProgram Memories\n400: 200 (User) + 200 (Preset)\nNominal Input Level\nGUITAR INPUT: -10 dBu\nInput Impedance\nGUITAR INPUT: 2.2 M ohm\nNominal Output Level\nMAIN OUT: -10 dBu\nSUB OUT (XLR): +4 dBu\nGUITAR OUT: -10 dBu\nOutput Impedance\nMAIN OUT: 1 k ohm\nSUB OUT (XLR): 600 ohms\nDynamic Range100 dB or greater (IHF-A)\nDigital Output\nCoaxial type (conforms to IEC60958)\nTOP PANELControls\nOUTPUT LEVEL knob, Function knobs (F1--F6), BALANCE knob, PATCH LEVEL knob, V-LINK button, DIRECT PATCH buttons (1--5), CONTROL buttons (1, 2), COSM GUITAR MODELING TYPE buttons (A, B), COSM GUITAR ALTERNATE TUNING button, POLY FX A/B buttons (A, B), FX buttons (A, B), COSM AMP buttons (A, B), MIXER buttons (A, B), DELAY/REVERB button, DYNAMIC button, CHAIN button, CONTROL ASSIGN button, NAME/KEY/BPM button, Function buttons (F1--F6), EXIT button, WRITE button, PAGE buttons x 2 (Left, Right), GUITAR TO MIDI button, SYSTEM button, GLOBAL button, TUNER button, CATEGORY button, PATCH/VALUE dial, Power switchD Beam Controller\nPITCH button, FILTER button, ASSIGNABLE buttonRIBBON CONTROLLERPITCH button, FILTER button, ASSIGNABLE buttonDisplay240 x 64 dots graphic LCD (backlit LCD)CONNECTORS/SWITCHES/OTHERSTop PanelGK IN connector\nRear Panel\nGUITAR INPUT jack, GUITAR OUTPUT jack, SUB OUT jacks (XLR)(L, R)MAIN OUT jacks x 2 (L/MONO, R)PHONES jack, DIGITAL OUT jack, EXP PEDAL jack, CTL 3,4 jack, USB connector, RRC2 connector, MIDI connectors x 2 (IN, OUT), DC IN jack, Ground Lift switch (SUB OUT)Power SupplyAC Adaptor (PSB-1U)Current Draw1.3 A\nAccessories\nOwner's Manual, GK cable (3 m), USB cable, RRC2 cable, VG-99 Software CD-ROM, AC adaptor (PSB-1U), Roland Service (information sheet)\nOptions\nDivided Pickup: GK-3, MIDI Foot Controller: FC-300, Footswitch: BOSS FS-5U/6, Expression Pedal: EV-5, BOSS FV-500L/500H, GK Cable: GKC-10/5/3, Unit Selector: US-20, GK Parallel Box: GKP-4, Rack Mount Adaptor: RAD-99, Pad Stand: PDS-10, Footswitch Cable: PCS-31L\nSIZE AND WEIGHT ( DIMENSIONS )\nWidth384 mm\n15-1/8 inches \nDepth 218 mm\n8-5/8 inches \nHeight 94 mm\n3-11/16 inches \nWeight 2.1 kg\n4 lbs. 11 oz.\nhttps://www.roland.com/us/products/vg-99/",
    "hrid": "roland-vg-99"
}