{
    "py/object": "mylib.pedal.Pedal",
    "id": "12148",
    "name": "LN-322 FRENZY",
    "image": "images/rowin-ln-322-frenzy.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Rowin",
    "current": "? mA / ? V / AC/DC",
    "cost": "$50 Price in €",
    "width": 38,
    "height": 76,
    "details": "Vintage style FuzzA very versatile fuzz pedal offering sounds of Vintage Germanium Analog Fuzz for Guitar/Bass.\nThe Rowin LN-322 FRENZY Vintage Fuzz pedal that achieves classic fuzz tones of the late '60s/early '70s era. Think Hendrix and other crossover blues-rock players. It's simple controls allow the Frenzy Fuzz to do one thing and do it well taking you from classic rock to contemporary fusion, fuzz has been applied to guitar signals to weave a unique musical texture - either by itself, or to aggravate the input of an already overdriven tube amp. This Micro compact pedal's three pots - Volume Tone and Fuzz Â– letÂ’s you effortlessly dial up anything from relatively tame silken fuzz to snarly, sputtery, and full-on nasty fuzz tone. Its full metal casing makes it durable and road ready, and like most great effects pedals it has true bypass.\nTwo modes, PUSH1 and PUSH2  \nThe best thing about this boutique pedal is that unlike any similar counterparts, the Rowin LN-322 Frenzy Fuzz comes at a surprisingly affordable cost so that any guitarist or bass players can take advantage of its amazing sound.\nCompact, Tough Design\nThis nano pedal is very small - less than 3 inches in length! Only 1.5 inches wide! With a small footprint like that, you will not have any problem finding a place on your pedal board for this pedal!  Tiny doesn't mean weak - this series of effects are extremely tough! All metal construction, true bypass, and metal micro switches - this pedal is gig worthy.\nTrue Bypass Circuitry\nHard to believe but these effects are designed with a 3PDT - true bypass, your tone is not altered when the pedal is not engaged.\nSpecifications\nFull Metal Shell\nVolume/Fuzz/Tone  controls\nTwo Tone  modes Â– Push1 and Push2\nTrue Bypass 3DPT Switch\nPower Supply: 9V DC (Negative Center) - (Not Included) (38ma).\nMore than 23000 guitar effects pedals from 4000 brands:\nhttp://www.effectsdatabase.com/model/rowin/ln300/ln322",
    "hrid": "rowin-ln-322-frenzy"
}