{
    "py/object": "mylib.pedal.Pedal",
    "id": "15129",
    "name": "Andromeda",
    "image": "images/seymour-duncan-andromeda.jpg",
    "function": [
        "Delay",
        "Digital",
        "MIDI",
        "Dual/Stereo"
    ],
    "manufacturer": "Seymour Duncan",
    "current": "? mA / ? V / AC/DC",
    "cost": "$299 Price in €",
    "width": 142,
    "height": 130,
    "details": "Programmable Dynamic DelaySummary\nAndromeda is a fully programmable digital delay, combining classic sounds with unique dynamic control for an inspiring musical experience.\nDescription\nThe Andromeda™ Dynamic Delay is a new approach to the traditional digital delay – as much a performance tool as it is a sound effect. Andromeda features warm, hypnotic repeats with an unparalleled level of control and musical, dynamic interaction. The combination of versatility and ease of use make it an indispensable tool for the creative guitarist.\nWhether you prefer the sound of lush analog delays, vibey tape echoes, pristine digital repeats or some unique blend of the three, Andromeda has you covered with eight delay types including Normal, Ping Pong, Reverse and Reverse Pong. Once you select your delay type, you can further modify it with the Tone knob (to brighten or darken the repeats), the Saturation control (to add some of the grit and grind that the classic tape machines provided) and the Modulation knob (for gorgeous chorus or vibrato on the echoed signal). This provides a tremendous amount of tonal options—especially when you add functions like Tap Tempo (with four rhythmic subdivisions) and a selectable Trails feature, which allows the echoes to decay naturally when Andromeda is bypassed. But that’s just the beginning…\nWhat truly sets Andromeda apart is the exclusive Dynamic Expression™ feature that allows you to control how the pedal reacts, in real time with your picking attack. That means you can alter settings for Mix, Modulation or Saturation on the fly, just by how you play. For instance, by selecting Mix, you can set Andromeda for a subtle echo until you dig in, at which point your repeats will jump to the forefront. Choose Mod and you can have beautiful chorus in a quiet verse part that magically disappears when you launch into a loud solo, or vice versa. Select Saturation and you can overdrive the echoed signal simply by picking harder. Depending on how you set the various controls, picking hard or picking soft will produce infinite variations on the sounds, taking Andromeda from a stompbox to a living, breathing thing. It’s interactive, intuitive and—most importantly—inspiringly musical.\nDespite the awesome power and flexibility of this pedal, Andromeda is remarkably easy to work with. Everything you need to create your delay sounds is at your fingertips on the front panel, so no scrolling through menus or navigating confusing multi-function controls. Twist a knob, change the sound—it’s that simple. Andromeda provides the tactile, immediate response that we associate with classic guitar gear in a deep, modern effect.\nBecause Andromeda is capable of so many great sounds, we made it fully programmable. When you create a unique delay patch, you can save it, quickly and easily, and recall it in an instant, either with the onboard buttons or via MIDI. And with 128 presets as well as MIDI In and Through, Andromeda can be not just the pulsating, beating heart of your rig, but the brain as well.\nNeed more? Andromeda features stereo ins and outs, making it compatible with a wide array of live and studio applications and facilitating huge, expansive stereo imaging, powered by a 24-bit/48kHz digital engine. Andromeda also comes with a micro-USB port so it can connect to our Updater/Librarian software. This will allow you to download future updates for Andromeda, save and name your favorite presets to your computer, trade patches with fellow users and more. Finally, the bright alpha-numeric readout on the front makes it easy to see what patch is loaded, whether on a dim stage or in bright sunlight. \nAny delay can repeat what you play. The Andromeda Dynamic Delay can actually have a musical conversation with you, reacting to what you say and how you say it. The dynamic interaction that is possible with this pedal will forever change the way you view delay effects. \nLike all of our pedals, the Andromeda Dynamic Delay is designed and assembled at our Santa Barbara, California factory by the same team responsible for our legendary pickups.\nTech Specs:\nINPUT IMPEDANCE: \n1M Ohm\nOUTPUT IMPEDANCE: \n100 Ohms\nGAIN: \nUnity\nNOISE: \nhttps://www.seymourduncan.com/pedal/andromeda",
    "hrid": "seymour-duncan-andromeda"
}