{
    "py/object": "mylib.pedal.Pedal",
    "id": "14298",
    "name": "Shape Shifter (original)",
    "image": "images/seymour-duncan-shape-shifter-(original).jpg",
    "function": [
        "Tremolo"
    ],
    "manufacturer": "Seymour Duncan",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 140,
    "height": 132,
    "details": "Seymour Duncan SFX-07 Shape Shifter Tap TremoloOVERVIEW\nYou'll love the Seymour Duncan SFX-07 Shape Shifter Tremolo pedal if you like the smooth, easy-to-dial-in sound of vintage amp tremolo. But if you also crave unrestrained versatility, and you want to delve into ultra-modern experimental sounds like flutters, shimmers, warbles, and even radical \"helicopter chops,\" the Shape Shifter is your dream tremolo.\nThe Shape Shifter pedal's sonically pure, 100% analog signal path delivers the familiar lush, hypnotic, pulsing tremolo vibes characteristic of '50s tube amps. Digital tap control offers incredible control. Shape and Wave controls provide unparalleled versatility.\nThere are two modes. In Rate mode the tremolo speed varies continuously from one to 20 cycles per second. An LED pulses in time with the tremolo effect for easy Rate setting. In Ratio mode, tapping the Tap Rate switch establishes the speed, allowing for easy synchronization of the tremolo rate and song tempo. Also, in Ratio mode, the tapped tempo can be expressed in your choice of four tap-to-note ratios: 1:1, 2:1, 3:1, or 4:1 (1/4 notes, 1/8 notes, triplets, or 1/16 notes).\nThe Wave control allows the tremolo effect to go from the smooth modulation of a sine wave through the sharper characteristics of a triangle wave to the abrupt on/off effect of a square wave drive.\nSPECIFICATIONS\nType of Circuitry: Pure analog signal path, digital tremolo timing\nInput Impedance: 1 megohm\nOutput Impedance: 1.2K ohm\nGain: 2.5dB maximum\nMax Output before Saturation:  2.8V RMS\nS/N Ratio: 95dB\nFrequency Response: Wideband; -3dB at 3Hz and 165 kHz\nTHD:  0.09% @ 1 kHz, 1VRMS\nTremolo Characteristic:  Gain variation linear in dB\nControl functionality:\nDepth: Continuously adjustable from 0 to 28dB\nShape (Duty Cycle): Continuously adjustable from 10% to 90%\nWave: Continuously adjustable, sine to triangle to square waves\nRate: Continuously adjustable from one to 20 beats per second\nTremolo Rate Controls: Speed knob, tap tempo button, and rate multiplier control\nPower:  9V battery or 9V-regulated DC adapter\nCurrent Consumption:  7mA operate, 3mA bypass\nDimensions:  5-1/2\" W x 2-1/5\" H x 5-1/5\" D\nWeight:  2 lbs.\nChassis Material:  16 gauge steel\nBypass:  True hard-wire bypass\nMost classic tremolos increase the volume over a certain period of time”say, a quarter of a second”and then decrease the volume over a similar period of time, giving a smooth, even feeling to the tremolo effect. When set to the middle of its range, the Seymour Duncan Shape Shifter's Shape control does exactly that, but when the Shape control is rotated away from its center position, the relationship between the time spent increasing the volume and the time spent reducing the volume changes. For example, you can dial in one-tenth of a second of volume increase followed by four-tenths of a second of volume decrease, or vice-versa, adding a very different feel to the tremolo effect. With quick swell and a slow drop, the effect is percussive like a piano. Conversely, with a slow swell and sudden drop, the result is reminiscent of a tape played backwards.",
    "hrid": "seymour-duncan-shape-shifter-(original)"
}