{
    "py/object": "mylib.pedal.Pedal",
    "id": "23428",
    "name": "A+ Buzz V.2",
    "image": "images/shift-line-a+-buzz-v.2.jpg",
    "function": [
        "Bass",
        "Distortion"
    ],
    "manufacturer": "Shift Line",
    "current": "60 mA / 9 V / DC / Negative Center",
    "cost": "$189 Price in €",
    "width": 67,
    "height": 110,
    "details": "Bass driveBuzz V.2\nBass drive\nShift Line presents the A+ Buzz V.2 bass drive. \nBass and distortion go hand in hand — at least, that’s what we believe, and many bass players seem to agree. The A+ Buzz has found its place in bass pedalboards all over the world, and now it’s time for a new and improved revision: the Buzz V.2 bass drive. \nThe new version builds up on what made the Buzz so popular. The strong core sound, great dynamic response, and simple controls with a wide sweet spot are all present in the Buzz V.2 — but now they are joined by an improved EQ section along with separate volume controls for the dry and distorted signal. And due to the top-mounted jacks, it’s now even easier to fit into your pedalboard!\nKey features of the A+ Buzz V.2:\nExcellent dynamic response: clean to full-on distortion\nFully fledged low & high frequency controls (BASS and TREBLE knobs)\nControl over low and high mids (MID and BITE)\nSeparate dry & wet volume controls with the option to boost the clean signal\nUniversal usability (live, studio, direct recording)\nFully analog signal path\nCompact and lightweight anodized aluminium enclosure with laser-engraved graphics\nTop-mounted jacks for improved connectivity\nControls\nThe DRIVE LEVEL knob controls the distorted signal volume. The distorted signal can be turned down to 0 if needed.\nThe CLEAN LEVEL knob controls the clean signal volume. The clean signal can be boosted up to +12dB or turned down to 0 if needed.\nThe GAIN knob controls the intensity of the drive.\nThe BASS knob controls the volume of low frequencies in the distorted signal (±10dB shelf at 70Hz).\nThe TREBLE knob controls the volume of high frequencies in the distorted signal (±10dB shelf at 10kHz).\nThe MID switch provides fine control over low mids (650Hz) in the distorted signal:\nUP: +5dB\nCENTER: 0dB\nDOWN: -12dB\nDepending on the position of the MID switch, the distorted signal’s character shifts from vintage to modern. Frequencies are cut with a narrow band and boosted with a wide band.\nThe BITE switch provides fine control over high mids (2900Hz) in the distorted signal:\nUP: +6dB\nCENTER: 0dB\nDOWN: -6dB\nThe BITE switch determines how aggressive the pedal sounds. Frequencies are cut with a narrow band and boosted with a wide band.\nThe BYPASS switch turns the effect on or off.\nGeneral Info\nThe A+ Buzz V.2 is an improved revision of the Buzz, a bass drive pedal that has found its place in pedalboards all around the world. It is a product of our long-time experience in creating effects for bass guitar in various music styles, and it meets our core principles:\nHigh quality of sound and execution\nReliability. The pedal utilizes a fail-safe relay-based passive (true) bypass circuit\nJust like the rest of our products, the Buzz V.2 has been tested with high-end and budget instruments and equipment\nSize matters! The device’s complex schematics are packed inside a compact enclosure\nDue to well-thought EQ, the pedal sounds good even for direct recording: there are no excessive high frequencies or “sizzle” in the distorted signal.\nThe schematics of the Buzz V.2 are based on the first revision with improvements to the sound palette. If needed, the V.2 can sound exactly like the V.1 while offering much deeper control over the nuances of the sound. Some elements of the Shift Line Termofuzz are used in the Buzz V.2’s schematics.\nThe higher you set the GAIN knob, the quieter sounds will get distorted. The distortion range depends on the instrument. With low-output basses, the gain range starts from a clean sound; instruments with high-output and/or active pickups allow for much higher gain. Make sure to use your instrument’s volume knob for fine adjustments to the gain range.\nSince the CLEAN LEVEL knob can boost the clean signal volume up to +12dB, the Buzz V.2 can be used as a boost pedal and drive the amplifier even harder for an increased gain amount (the result depends on the amp model).\nSpecifications\nIN — 6,3mm, mono, unbalanced, 1MOhm input impedance.\nOUT — 6,3mm, mono, unbalanced, 100Ohm output impedance.\nPower — (9V DC 60mA), negative tip, 2.1/5.5mm. Use a regulated PSU only.\nDimensions — (LхWхH): 110х67х56mm (4.3x2.6x2.2”)\nWeight — 240g (0.5lbs)\nhttps://shift-line.com/card.php?device=10101",
    "hrid": "shift-line-a+-buzz-v.2"
}