{
    "py/object": "mylib.pedal.Pedal",
    "id": "30595",
    "name": "A+ Everest II",
    "image": "images/shift-line-a+-everest-ii.jpg",
    "function": [
        "Bass",
        "Delay",
        "Digital",
        "Dual/Stereo",
        "Multieffect",
        "Reverb"
    ],
    "manufacturer": "Shift Line",
    "current": "100 mA / 9 V / DC / Negative Center",
    "cost": "$289 Price in €",
    "width": 110,
    "height": 104,
    "details": "Stereo Reverb-DelayThe A+ Everest II is the result of the Everest M evolution. Aside from the new enclosure, stereo mode and tap tempo, the new pedal has got a new architecture with completely reworked algorithms. The combination of reverb and delay in a single compact pedal allows for otherworldly atmospheric textures along with classic spatial sound processing. The pedal is suited for use with any kind of instrument: guitar, bass, synths, drums, or anything else. \nThe Everest II has retained its predecessor's compact size, minimalist UI and extensive sonic palette. New additions include stereo mode with width control, dual mono mode, tap tempo, and improved hold mode. Sculpting your sound has never been easier; now you will have even more time for actual music creation!  \nEverest II: Key Features\n\n\nFully fledged stereo signal chain with width control and dual mono mode. \nTap tempo with subdivisions. \nStereo and ping-pong delay. \n6 reverb and delay modes with the two effects running in parallel. \nIndependent volume control for both effects along with the option to use reverb and delay in separation. \nControl over the brightness of the sound via a low-pass filter. \nThe option to use delay filters separately. \nHold Mode: infinite sustain gradually shifting into self-oscillation. \n\"Favorite\": the option to save and recall a preset from the device's memory. \nFully analog dry signal chain. \nSwitchable tails in bypass. \nKill Dry: the option to exclude the dry signal from the output in order to use the pedal in Wet-Dry-Wet configurations or external mixing setups. \nLightweight and compact aluminium enclosure.\nTop-mounted jacks for improved connectivity and easier pedalboard management.\nExternal tap tempo switch input.\nUniversal power intake in the 9-12V range; low current draw by digital device standards (75-100mA).\nMicro-USB for updates and settings. \n\n\nConnections\n\n\nLEFT IN is a monophonic signal input. In a mono signal chain, use this input exclusively.\nRIGHT IN is an input for the second signal source. A stereo setup can be achieved by simultaneously connecting two mono signal sources to the LEFT IN and RIGHT IN inputs. The Everest II does not support TRS connections. \nLEFT OUT is the left channel output. Connect it to the signal receiver. In a mono signal chain, use this output exclusively. \nRIGHT OUT is the right channel output. Connect it to the signal receiver. A stereo setup can be achieved by simultaneously connecting the LEFT OUT and RIGHT OUT outputs to two mono inputs. The Everest II does not support TRS connections. The mono and stereo modes are described in detail further on.\nEXT. TAP is an input for an external tap tempo switch (normally open momentary button).\nPOWER IN is a power supply input (9-12VDC).\nMicro-USB is a port for connecting the pedal to a computer for servicing. Hidden functions are also present; stay tuned for the updates on our website and social media.\n\n\nControls\n\n\nThe REVERB LEVEL knob controls reverb volume in the wet signal. Turn this knob fully CCW to disengage the reverb.\nThe DELAY LEVEL knob controls delay volume in the wet signal. Turn this knob fully CCW to disengage the delay. \nThe REGEN knob simultaneously controls delay feedback and reverb decay. \nThe STEREO WIDTH determines how wide the stereo image is. Turn this knob while holding down the TAP footswitch to control overall brightness of the wet signal. For a detailed description of this knob's functions, please refer to the \"Stereo Setup\" section. \nThe TIME knob controls delay time. Turn this knob fully CCW if you want to disengage the delay but still use the filters on repeats. \nThe MODE switch selects one of the six reverb/delay algorithms. For a detailed description of the algorithms, please refer to the \"List of Algorithms\" section. \nThe BEAT switch selects a subdivision for the time set by the TIME knob or the TAP footswitch: \n  UP: 3/4 (dotted eighth note). \n  CENTER: 1/1 (quarter note). \n  DOWN: 2/3 (quarter note triplet). \nThe BYPASS footswitch has multiple functions: \n  Press once to turn the effect on or off. \n  Press and hold to go into Hold Mode (infinite sustain with a gradual shift into self-oscillation). \n  Press twice to recall the Favorite preset. \n  Press and hold while changing the MODE switch setting to select among additional algorithms. \n  Press and hold while changing the BEAT switch setting to select bypass mode and control the Kill Dry function. \nThe TAP footswitch sets delay time after two consecutive presses. Press and hold the TAP and BYPASS footswitches simultaneously for 3 seconds to record the current settings as a Favorite preset.\nHold the TAP footswitch while changing the BEAT switch setting to control internal channel setup (stereo/ping-pong) for the delay section.\n\n\nhttps://shift-line.com/everest2",
    "hrid": "shift-line-a+-everest-ii"
}