{
    "py/object": "mylib.pedal.Pedal",
    "id": "11992",
    "name": "Reflex Universal Expression Controller",
    "image": "images/source-audio-reflex-universal-expression-controller.jpg",
    "function": [
        "Controller",
        "MIDI",
        "Multieffect",
        "Utility",
        "Expression"
    ],
    "manufacturer": "Source Audio",
    "current": "? mA / ? V / AC/DC",
    "cost": "$219 Price in €",
    "width": 95,
    "height": 266,
    "details": "Multi-Output expression controllerOVERVIEW\nThe Reflex Universal Expression Controller is the stand-alone command center for all of your expression pedal needs. It is a programmable expression pedal that connects to any effects pedal, synthesizer, or rack system with an expression or MIDI jack, and can also control DAW software via USB. Its outputs include three ¼” analog expression outs, MIDI 5-pin DIN in and out connectors, a USB port, and Source Audio’s proprietary 1/8” Sensor Out. Use the onboard control panel to program which outputs are active, the depth and direction of the expression or MIDI continuous controller signals, and the curve of the tapers. The Reflex can also send five different LFO wave shapes with expression control of the depth, modulation speed, or beat division. Save up to 128 expression configurations, recallable via the onboard controls or external MIDI program change messages.\nThree 1/4” Expression Outs (10k/10k/50k): Each expression out is paired with its own set of DIP switches, which are used to select the expression type — choose control voltage (CV) or the passive expression configuration that is compatible with your effects pedal, synthesizer or rack unit.\nCONTROL PANEL\nThe Reflex Universal Expression Controller allows musicians to create an endless array of unique effects by providing independent or simultaneous control over the expression function of multiple effects pedals or rack systems.\nThe Reflex’s bright LED display and clearly labeled control panel make it extremely easy and intuitive to program anything from very basic to highly complex expression configurations. The Reflex holds up to 128 user presets — within each preset it is possible to assign a different expression function to every expression output and MIDI port on the pedal. Use the control panel to select which outputs are active, the depth and direction of each expression signal, and the curve of the tapers.\nIt is also possible to send an automated modulation signal to each expression output with LFO wave shapes. Set the expression pedal to control the LFO’s depth, modulation speed, or the beat divisions over a fixed BPM. LFO wave shapes include sine, square, saw tooth, triangle, random sample and hold, as well as a \"User\" position, reserved for future features. Sending LFO signals is a nice way to achieve (for example) a vibrato effect from an external pitch shifting pedal or a tremolo from the level control of an external unit.\nEXPRESSION CONNECTIONS\nThe Reflex has a total of seven expression outputs. Each can be programmed independently and function simultaneously.\nThree 1/4” Expression Outs (10k/10k/50k): The Reflex connects to as many as three effects pedals at any given time with its 1/4” expression outputs. Each 1/4” expression out on the Reflex is paired with its own set of DIP switches that allows you to select the expression plug type that is compatible with your effects pedal or rack unit. Choose from either an active control voltage (CV) signal or any passive TRS or TS expression configuration. Thanks to the DIP switches, the Reflex works with any brand of expression compatible effects pedal on the market.\nMIDI 5-Pin DIN Connectors (Input and Output): The Reflex can send up to three independently configurable MIDI continuous controller messages to MIDI equipped effects pedals, rack systems, or hardware synthesizers via the 5-pin DIN output (as well as the USB port — see below).\nThe MIDI 5-pin input receives program change messages, which allow you to change the Reflex’s presets via an external MIDI foot controller. The 5-pin input can also receive MIDI Clock messages\nUSB Port: The Reflex’s USB port connects to your Mac or Windows based computer providing MIDI expression control (CC messages) to any digital audio workstation or virtual instrument software. The Reflex is a class compliant USB device that requires no additional drivers and automatically appears as a MIDI control device in your music production software. The Reflex’s USB port can also receive MIDI Clock messages.\nSource Audio Sensor In: The Sensor In is a 1/8” TRRS connector that provides expression control to all Source Audio One Series, Soundblox, Soundblox 2, and Soundblox Pro pedals. The Sensor Input is also compatible with the Neuro Hub (formerly Soundblox Hub), which distributes the Reflex’s expression control to any One Series or Soundblox 2 pedal connected to the Hub.\nhttp://www.sourceaudio.net/products/toolblox/reflex_universal_exp_controller.php",
    "hrid": "source-audio-reflex-universal-expression-controller"
}