{
    "py/object": "mylib.pedal.Pedal",
    "id": "32683",
    "name": "Aurora",
    "image": "images/spaceman-effects-aurora.jpg",
    "function": [
        "Flanger"
    ],
    "manufacturer": "Spaceman Effects",
    "current": "58 mA / 9 V / DC / Negative Center",
    "cost": "$319 Price in €",
    "width": 94,
    "height": 120,
    "details": "Analog FlangerINTRODUCING AURORA\nThe Aurora is an analog bucket-brigade flanger that gives you a powerful 5-mode modulation bus with 2 LFOs, 2 tape emulations, and a static comb filter. This provides several shades of flange, vibatro, chorus, phase, and filtery spatial effects with the lush sound of an analog signal path. The inclusion of a dedicated wet/dry MIX control gives you acute tonal control, while manually actuated TAPE modulation, and interruptible LFOs open up new avenues of in-the-moment expressiveness. Let your imagination coast across the neon sky. \nTHE MODULATION STATION\nThe modulation bus of the Aurora consists of three types of modulation: Two LFO modes, two tape modes, and one unswept comb filtering mode. Add shimmer and movement with shallower WIDTH and MIX settings. Crank up the REGEN, WIDTH, and RANGE and careen into deep rhythmic sweeps.\nThe LFO 1 mode produces a triangle waveshape ideal for a traditional flanger effect at lower speeds and lush chorus and phasing sounds at moderate speeds. At higher LFO speeds, set your MIX to fully wet and spin up bizarre seasick pitch-shifting vibrato. The LFO 2 mode offers discrete control over the rise and fall times, allowing you to craft ramp up, triangle, and ramp down waveforms. The ability to control the LFO slopes independently makes for very interesting asymmetrical modulation especially useful for flange and pitch-shifting settings. A quick tap of the TRIG footswitch resets the LFO to the bottom, and holding the TRIG switch holds the LFO low.\nThe TAPE modes of the Aurora give you the ability to mimic the tape deck manipulation of early flange effects. Just like placing your finger on the flange of a tape deck, holding the TRIG footswitch down begins the upward sweep, and releasing the TRIG footswitch begins the downward sweep. Careful use of the REGEN, WIDTH and MIX controls can tame or exaggerate the effect to suit any application.\nLastly, the COMB mode freezes the modulation, and uses the RATE & RANGE controls to set two different static delay times that can be switched between by using the TRIG footswitch. The comb filtering effect can be used in a variety of ways, from simple thickening, to exotic, chaotic, robotic clang.\nTHE AURORA PROVIDES YOU WITH:\n\nBrilliant clarity through a noise-reducing compander, and filters with a carefully tuned frequency response.\nA dedicated 100% wet / dry MIX control.\nTraditional AND unique multi-slope controls via two LFO modes.\nEmulation of your finger on the flange of a tape deck via 2 TAPE modes.\nCreate subtle to not-so subtle Haas spatial effects with the static COMB filter.\nMaximum delay path headroom via a 256-stage MN3009 delay chip.\nSlowest sweep: > 60s\nWide sweep ratio: > 20:1\nDelay time: 0.35ms-8ms\n\nCONTROL DETAILS\nVOLUME - Unity gain is roughly at noon, and a moderate boost of 6dB is possible at maximum.\nMIX - Full control over wet/dry blend. This dramatically increases the utility of the Aurora by opening up subtler and more extreme tones.\nREGEN - The staple jet sound maker. This control feeds a portion of the output signal back into the input for exaggerated resonant, robotic, or swooshy effects.\nMODE - Five modulation modes are available: LFO 1, TAPE 1, LFO 2, TAPE 2, and COMB; each with their own unique attributes. See the tables for a more in depth coverage of each mode.\nWIDTH - This is the main depth control of the modulation. It sets how wide the sweep is by controlling how much of the total delay time is modulated.\nRATE • ↑  - Controls the speed of the modulation in LFO 1 & TAPE 1 modes. In LFO 2 & TAPE 2 modes it controls the RISE time. Sets the static delay time in COMB filter mode.\nRANGE • ↓ - Controls which portion of the delay time is modulated in LFO 1 & TAPE 1 modes. In LFO 2 & TAPE 2 modes it controls the FALL time of the modulation. Sets a secondary static delay time in COMB filter mode.\nTRIG Footswitch - Multi-function footswitch for use with the modulation bus. See the tables for a more in depth coverage of its usage in each mode.\nBYPASS Footswitch - True-bypass soft-touch relay switching to engage and disengage the effect.\nTRULY HAND CRAFTED\nHand-wired and built in Portland, Oregon, the Aurora features true-bypass relay switching with soft-touch footswitches. On top of the cast-aluminum enclosure sits a durable, engraved vinyl faceplate and jewel indicator light. This pedal is built to last a lifetime, both on Earth or in the vacuum of space.\nhttps://spacemaneffects.com/products/aurora",
    "hrid": "spaceman-effects-aurora"
}