{
    "py/object": "mylib.pedal.Pedal",
    "id": "19753",
    "name": "Wow Signal Fuzz",
    "image": "images/spaceman-effects-wow-signal-fuzz.jpg",
    "function": [
        "PreAmp",
        "Distortion",
        "Filter",
        "Ring Modulator",
        "Rotary",
        "Tremolo"
    ],
    "manufacturer": "Spaceman Effects",
    "current": "? mA / ? V / AC/DC",
    "cost": "$399 Price in €",
    "width": 102,
    "height": 127,
    "details": "Analog modulated fuzz devicePin\nAugust 15th, 1977: Earth received its first message from the depths of outer space.  The Big Ear radio telescope at Ohio State University picked up a strong 72-second signal from the constellation Sagittarius, detected by astronomer Jerry R. Ehman.  Circling the frequency code of the signal, 6EQUJ5, on the computer printout Ehman wrote, “WOW!” causing the alien message to become forever known as “The WOW! Signal.”\nTwo precise values by different astronomers were given for this mysterious frequency, 1420.4556Mhz & 1420.356Mhz.  Hydrogen resonates at a frequency of 1420.40575177Mhz, which is near dead center of the two values.  Since hydrogen is the most abundant element in the universe, it was a meaningful number to researchers, as extraterrestrials might use this frequency to transmit a signal a long distance.  Was intelligent life out there trying to communicate with us?\nThe WOW! Signal was never heard again, despite several searches with a multitude of equipment.  At Spaceman, we haven’t given up on extra-terrestrial communication and through much research and development with a group of our country’s greatest stargazers, we have created a way to speak back to our friends in space.  Working with a group of audio research scientists known as The Dandy Warhols, an Alien Fuzz Communicator was born, dubbed The WOW Signal.\n\nThe WOW Signal is a unique, all analog modulated fuzz device.  At the heart of this machine lies a UFO-shaped, vintage Soviet germanium transistor.  The circuit then adds in modern components, to yield a wide variety of pre and post cold war fuzz tones, from bright and buzzy to thick and fuzzy.\nThe fuzz tone is effected by an LFO section that provides a range of unique filter modulation from subtle to extreme, with controls for speed and depth.  Many of the pedal’s controls interact with each other, allowing for a large palette of sonic possibilities.  This pedal is not for the faint of heart.\nIn addition to the five external control knobs, there is also an internal switch, accessible by removing the bottom cover.  The factory setting for this switch is the “normal” position.  Flipping it increases the LFO depth greatly, with results that can be extreme, choppy, and noisy.\nCompletely hand-soldered and handmade in Portland, Oregon, the WOW Signal utilizes true-bypass switching via the heaviest duty mechanical footswitch available.  Open one up and you’ll see an unparalleled display of craftsmanship.  Thick, high-quality PCB along with detailed military-spec wiring, using vintage US made heavy-gauge stranded wire.  On top of the cast aluminum enclosure sits a durable, engraved vinyl faceplate and red jewel indicator light.  This fuzz is built to last a lifetime.  Each pedal is numbered on the nameplate, as well as signed and numbered on the inside.  The WOW Signal also comes with a transferable three year warranty, plus a lifetime discount repair plan.\nThe WOW Signal sounds best with passive pickups and can be used with guitar, bass, baritone, synth or your favorite sonic transmission device.\nThere are five different editions of the WOW Signal being produced.  The Copper Edition (Dandy Warhols Edition) is electroplated in raw copper, which will oxidize, giving each enclosure a unique personality over time.  It also features a vintage 1959 US Aerospace dim-able indicator light, engraved knobs and includes an audio compact disc of the Warhols’ “This Machine,” autographed by the band.  The Chrome Edition includes the same features as the Copper Edition, but with a polished chrome finish.   There are two powder-coated editions available, Gloss Grey and Brass Metallic.  The remaining edition will feature a raw, brushed aluminum finish.  These final three editions will feature aluminum capped knobs and a red jewel indicator light, as well as goodies from The Dandy Warhols.\nhttps://spacemaneffects.com/products/wow-signal/",
    "hrid": "spaceman-effects-wow-signal-fuzz"
}