{
    "py/object": "mylib.pedal.Pedal",
    "id": "13331",
    "name": "Trashy Blonde",
    "image": "images/stone-deaf-trashy-blonde.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Stone Deaf",
    "current": "? mA / ? V / AC/DC",
    "cost": "$200 Price in €",
    "width": 117,
    "height": 152,
    "details": "The Trashy Blonde is your one-stop ticket to those classic British dirt tones that has helped shape and define rock-n-roll as we know it today.The quintessential ‘classic-rock-in-a-box’ guitar pedal, the Trashy Blonde is inspired by tones reminiscent of classic British tube amplifiers and especially on the definitive Marshall® amp sound, allowing you to drive any clean amplifier with controlled and musical crunch. Trashy Blonde is a sexy British beauty that features a great deal of classic rock with unquestionable control. Imagine you wanted some classic Brit tones from your super clean jangly amp? Well, she will turn any prancy little thing into an over-driven crunchy distorted badass. Roll her back with your guitar volume and she cleans up very nicely. You may also want to mix it up with her mix knob, allowing you to toggle through trebly distortion, to a more rounded vintage tone with plenty of warmth. \nExtremely versatile, you can get those JTM45 subtle break-up tones all the way through to saturated JCM800 territory and then suddenly you’re feeling just like Slash stepped in with his heels. Plus, the design allows mixing clean and distorted signals with ease for a more vintage, well rounded and less saturated tone, to more classic rock tones reminiscent of AC/DC and Led Zeppelin. The in-depth EQ settings let you refine the sound to your exact preference, while the parametric filter and noise gate assists in suppressing unwanted feedback so that you’re always in control. \nHowever, Trashy Blonde does have another ‘secret’ channel up her sleeve. By cranking the Balance (output) knob on the clean channel, into a ‘just about to break up’ amp will take you into boosted valve break up, step on the Trashy side and then boom! You’re into full-on distortion nirvana. \nAdd a Stone Deaf EP-1 active expression pedal to the expression input control and on top of the impressive regular tone shaping features, Trashy Blonde can also achieve wah, phaser and manual tonal shift sounds as well as the ability to control your drive tone on the fly with your foot. \nEach Trashy Blonde is proudly manufactured by Stone Deaf in our factory based in Huddersfield, West Yorkshire, England.\nhttp://www.stonedeaffx.com/trashy-blonde",
    "hrid": "stone-deaf-trashy-blonde"
}