{
    "py/object": "mylib.pedal.Pedal",
    "id": "13184",
    "name": "EP-1",
    "image": "images/stone-deaf-ep-1.jpg",
    "function": [
        "Expression"
    ],
    "manufacturer": "Stone Deaf",
    "current": "? mA / ? V / AC/DC",
    "cost": "$130 Price in €",
    "width": 89,
    "height": 203,
    "details": "EP-1 Expression PedalThe EP-1 expression pedal is like a chameleon, with the ability to take a standard Stone Deaf parametric or paracentric pedal and turn it into a Manual Phaser, Wah Wah or Foot Controlled Tone control.\nThe EP-1 expression pedal is unlike any other expression pedal on the market because it is customised to only work with Stone Deaf products. It is not an off the shelf item to work with every pedal that has an expression jack. This is because Stone Deaf uses custom components manufactured to their specifications, which compliments their pedals perfectly with no compromise. As Stone Deaf strives to be different, they have to create new things. The benefit of this is that it's not a one trick pony.\nStone Deaf's EP-1 is a solid addition to anyone who wishes to further control their array of Stone Deaf effects.\nFeatures:\n-Foot Controlled Tone Control Mode: allows you to control your bass, mid and treble boosts and cuts on the fly as you play which gives you a huge tonal landscape to play with.\n-Manual Phaser Mode: allows you to control the scooped filter for the parametric or paracentric circuitry of our pedals so you can get foot controlled phasing sounds. This is the opposite effect of Wah filtering.\n-Wah Wah Mode: allows you to use the expression pedal as a Wah Wah pedal to get some amazing Wah Wah sounds by controlling the boosted filter of the parametric or paracentric circuitry of our pedals. With its wide frequency sweep it goes much further than a standard off the shelf Wah Wah pedal so you can get a wide range of wah tones using the bandwidth switch as well.\n-Adjustable Sweep: allows you control the resistance of the sweep using the two bolts at either side of the tread plate. This means you can tight or slacken for more or less resistance\n-Freq Knob: enables you to dial in the exact same setting of the Freq Knob that are on the parametric or paracentric pedal you are controlling using the EP-1. The benefit of this is when you turn off the expression pedal you can go back to your original setting on for example the Trashy Blonde which you might want to do once you have finished playing with the expression pedal.\n-LED Light: one thing we found is that on most expression pedals you can't see when they are on which is a bit stupid so we've decided to put an ultra bright led so you can see when the EP-1 is on or off.\n-9v Power socket which will accept standard (BOSS style) 9v positive polarity power supply.\n-Battery Drawer which will enable you to access the battery easy and quickly without unscrewing the pedal.\n-Custom manufactured steel enclosure: Stone Deaf has opted to manufacture their own enclosure in the UK made from steel rather than the far eastern enclosures that nearly every other manufacturer opts for. They have found that they are too restrictive in their development of products and function. By manufacturing their own, they are in control from the start to offer modifications to customers using their own enclosures.\n-Grippy Tread: Stone Deaf's grippy tread is fantastic because it allows any type of footwear to be used with our expression pedal. Sometimes rubber on rubber can slip but with this its never going to slip.\nhttp://www.stonedeaffx.com/",
    "hrid": "stone-deaf-ep-1"
}