{
    "py/object": "mylib.pedal.Pedal",
    "id": "28440",
    "name": "Octave Theory",
    "image": "images/sub-decay-octave-theory.jpg",
    "function": [
        "Synth Voice"
    ],
    "manufacturer": "Sub decay",
    "current": "60 mA / 9 V / AC / Negative Center",
    "cost": "$199 Price in €",
    "width": 70,
    "height": 110,
    "details": "Octave Modulator / SynthesizerThe first ever guitar synth with octave modulation\nSo what the heck is octave modulation? The octave theory seamlessly crossfades between octaves. Paired with an awesome filter this creates a multitude of possibilities. like 8 bit chiptune sounds, classic guitar synth, super sub bass tones and the world’s first ever shepard tone guitar synthesizer.\nWith great power…\nAn array of knobs covered many early 1980s synthesizers. This gave you the power to create a wide range of sounds. Of course, on some settings the synthesizer wouldn’t make a sound, would go into uncontrollable oscillation, or make weird noises. Sometimes the weird noises weren’t the weird noises you expected.\nWhile many guitarists enjoy tweaking and honing their tone most of us don’t have that level of patience for fiddling with a matrix of interactive settings. The Octave Theory strikes the perfect balance giving you the power to create your own sound without endless knob tweaking or (gasp!) a tedious menu driven interface.\nThe Filter:\nResonant filter inspired by the Korg MS20. Like the MS20 the resonance knob can push the Octave Theory into oscillation. Most guitar synth pedals won’t let you go there. They think you can’t handle so much raw power. To be fair many of those filter oscillation sounds can get shrill or overbearing. If you keep the filter frequency low you can give your synth tones some growl. Use this power responsibly. \nAMP vs. Filter priority and envelopes.\nOT marker settingsADSR envelopes are a mainstay of synthesizers. While lacking full external ADSR control an internal ADR (Attack/Decay/Release) envelope is generated to control the oscillator output level. (AMP – synthspeak for modulating the oscillator output level.)\nAMP Priority (white marker): In modes with the white marker the decay knob gives you full control of the AMP decay. In these modes the filter also follows the ADR envelope at a fixed depth. This allows you to make notes decay quickly and gracefully. Turning the knob up allows for longer decay times.\nFilter Priority (green marker): In green marker modes the filter follows an envelope generated by the strength of the input. (The same way envelope filters work) The depth knob controls how much influence the the input envelope has over the filter. When in filter priority the internal ADR envelope is fixed with infinite decay time.\nOctave Modulation:\nModulate your octaves in four ways. LFO modulation, envelope modulation, shepard tone, or manual mode.\nLFO: This is where you’ll find the chiptune sounds, especially with the square and double square wave modes.\nIn the triangle, square and double square modes the filter follows the internal ADR and the freq knob. In random Mode the filter follows the LFO. The octave mod knob controls the LFO speed.\nEnvelope: Playing dynamics modulate the octave cross fade.  The octave mod knob controls the envelope’s overall influence. \nShepard Tone:  As you work your way up the guitar neck playing higher notes, the octave cross fade descends. When set = modes playing one octave higher will produce the same note. You can play up the neck forever and arrive at the same pitch whether you are playing an open low E or the high E string on the twelfth fret. In ↓ modes the output pitch will get lower and lower as you play higher up the neck. In all shepard tone modes the oct. mod knob manually controls the octaves from several octaves down to several octaves up.\nManual mode: This is most similar to our original guitar synth pedal, the Octasynth, but with the most requested feature added. Instead of the Octasynth’s blend control which only allowed for one or two octaves down, the oct. mod knob takes you from three octaves down to two octaves up.\nhttps://subdecay.com/effect/octave-theory-octave-modulator-synthesizer",
    "hrid": "sub-decay-octave-theory"
}