{
    "py/object": "mylib.pedal.Pedal",
    "id": "16602",
    "name": "Prometheus DLX",
    "image": "images/sub-decay-prometheus-dlx.jpg",
    "function": [
        "Filter"
    ],
    "manufacturer": "Sub decay",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 94,
    "height": 119,
    "details": "Resonant FilterAfter a year in development we present The Prometheus DLX. An analog filter with digital control. We made sure to not build in any artificial limitations. The filter sweep goes above and below normal guitar frequencies, and works well with other instruments such as bass and synthesizers. Select between lowpass, bandpass and highpass filters, and virtually unlimited ways to manipulate them.\nWe took the mad science of the original Prometheus and multiplied it, adding features that not only increase the sonic possibilities, but also make it easier to use. The DLX is a re-imagined Prometheus that uses all the knowledge we gained from The Quasar DLX, and our experience making the most exciting filter pedals in the world. We also added some improvements. More resonance? Yep! Tap tempo? You got it! For even more headroom the DLX will operate at 18 volts. There’s even an internal switch to add a dry signal blend to the bandpass filter. (See, we love you bass players too!)\nWhile the options are nearly infinite, we made sure to keep things simple enough so that the average guitar player could figure them out in a few minutes.\nThe Prometheus DLX has nine basic functions:\nAnalog envelope – forward and reverse.\nStep – tap tempo step filter based on 7 LFO shapes.\nTrigger LFO – tap to trigger one LFO cycle.\nManual LFO – Manually control LFO speed.\nWarp LFO – tap tempo LFO speed with wave shape warp.\nPixilated Envelope – sample/hold envelope control.\nEnvelope Trigger – Envelope triggers LFO.\nEnvelope->LFO manual – Envelope drives LFO speed. Fixed sensitivity.\nEnvelope->LFO – Envelope drives LFO speed. Variable sensitivity.\nIn each of these settings, the WARP control and TAP/HOLD serve different purposes to get the most out of each effect.\nThe expression pedal input can be used with any non-envelope functions. Depending on the shape & mode settings the expression pedal has a different effect. For example, in trigger LFO mode the LFO shape is mapped to the expression pedal. Select the ramp wave for a “standard wah” effect. Choose the saw wave for a reverse wah. The triangle/square wave is especially strange.\nWe also made major improvements to the step filter in the DLX. We not only added tap tempo, but the underlying LFO rate is locked to the step rate. If the step rate changes, there is no need to readjust anything to keep the same arpeggiated pattern. The warp knob is used to adjust the ratio of the step rate and the underlying LFO between 1:1 and 1:1.5. This ensures that there are no redundant settings.\nNotes about The Prometheus DLX:\nPowered by an external regulated 9VDC to 18VDC adapter with a negative center 2.1mm barrel style plug.\nPower supply is not included.\nIf using a “daisy chain” power supply all other pedals MUST be negative ground.\nCurrent draw is less than 100mA.\nLength 4.7″ x Width 3.7″ x Height 1.2″\nInput impedance- 1M\nOutput impedance- Less than 1K.\nThe Prometheus DLX is hand made in Oregon.\nDie cast metal enclosures for durability.\n3PDT switches for true bypass switching.\nRed/Green LED indicator.\nThree-year limited warranty",
    "hrid": "sub-decay-prometheus-dlx"
}