{
    "py/object": "mylib.pedal.Pedal",
    "id": "17821",
    "name": "Sub'N'Up Octaver",
    "image": "images/tc-electronic-sub'n'up-octaver.jpg",
    "function": [
        "Pitch Shifter"
    ],
    "manufacturer": "TC Electronic",
    "current": "? mA / 9 V / DC / Negative Center",
    "cost": "$130 Price in €",
    "width": 72,
    "height": 122,
    "details": "Polyphonic Octave Pedal with Monophonic OctaverSUB ‘N’ UP OCTAVER is the new leader of the pitch-pack. Featuring our superb next generation octave-engine and individual blend controls for dry, octave-up and two sub-octaves, SUB ‘N’ UP is set to deliver flawless octave tones whether you’re playing complex chords or groovy single-note lines. And with the option of adding modulation to the mix via our high-powered TonePrint editor, for spacey ambient octaves, SUB ‘N’ UP OCTAVER truly is the definition of pitch perfection.\n•    Next generation octave engine - For flawless polyphonic tracking\n    •    Cool old-school monophonic octaver\n    •    TonePrint-engine with modulation - for otherworldly octave tones\nPolyphonic Epiphany:\nSUB ‘N’ UP features the latest in polyphonic pitch technology. This means you get lightning-fast note tracking and impeccable hi-fi octave tones when playing chords. So whether you’re into shimmery octave-up tones for swells, a sweet 12-string ring or down and dirty subsonic octave riffs, SUB ‘N’ UP OCTAVER will deliver the goods every single time!\nOld-School is Always Cool:\nSUB ‘N’ UP OCTAVER also gives you access to a cool monophonic octaver. Great for faux bass-lines with a guitar or for replicating the glorious glitchy imperfections of yesteryear's octave pedals. Or!!… hook it up to a bass, crank the two sub signals, and get ready to bring down the PA.\nTonePrint – Otherworldly Octaves:\nIf the next-generation octave engine puts SUB ‘N’ UP OCTAVER ahead of the curve, then the TonePrint engine blasts it into outer space. Not only can you beam custom-made tones to the pedal via the free app, you can also make your own octave tone from scratch via the editor. This features our state-of-the-art modulation engine for never heard before octave tones. So go ahead and give that pitch some vibrato. Pitches love vibrato!\nTrue to Tone:\nYou love tone, so do we, and our design philosophy testifies to that. So whatever route you wanna go, we got your back. With optimized headroom, True Bypass or Buffered Bypass switch and Kill-Dry on/off, this pedal guarantees optimal tonal integrity and zero loss of tone. And, no matter if the pedal is on or off your precious dry sound is always passed through the pedal unharmed in all it’s pure analog glory due to an Analog-Dry-Through.\nTonePrint:\nTonePrint means signature effects – and signature effects means truly creative tones. From classic innovators to the guys shaping the future of music, we’ve asked the coolest artists around to come up with their customized signature version of a TC ELECTRONIC effect – and make them available to you for free!\nBeam:\nDownload the free TonePrint app for Android and iPhone, choose the TonePrint you want to hear and beam it instantly from your phone through your guitar’s pickup into your TonePrint pedal. No cables needed!\nhttps://www.tcelectronic.com/Categories/Tcelectronic/Guitar/Stompboxes/SUB-'N'-UP-OCTAVER/p/P0DDQ",
    "hrid": "tc-electronic-sub'n'up-octaver"
}