{
    "py/object": "mylib.pedal.Pedal",
    "id": "12162",
    "name": "Helicon Voicetone Synth",
    "image": "images/tc-electronic-helicon-voicetone-synth.jpg",
    "function": [
        "Modeling/Simulation",
        "Pitch Shifter",
        "Synth Voice"
    ],
    "manufacturer": "TC Electronic",
    "current": "? mA / ? V / AC/DC",
    "cost": "$200 Price in €",
    "width": 130,
    "height": 132,
    "details": "Autotune Vocoder Transposer Vocal PedalA portable, high-quality vocoder and HardTune pitch shifting effect.\nFinally, the effects you've heard on chart-topping tracks from artists pushing the envelope of vocal sounds are available in a pedal. VoiceTone Synth brings together a collection of exotic and current sonic mayhem including jagged HardTune effects, a MassiveBand Vocoder with voice-controlled synth and vocal distortion and megaphone effects. Now vocalists and anyone looking to add a modern edge to their live performances and studio productions can dial-in these effects instantly with the press of a footswitch.\nHardTune\nThe jagged, stair-stepped vocal sound of key-based hard tuning is everywhere in contemporary R&B, Hip Hop and Electronica. This feature has eluded the majority of performing musicians until VoiceTone Synth came along. Now musicians can produce this effect live by simply recalling a preset and hitting the 'On' button. Easy key input methods include auto-instrument sensing or pushbuttons with a clear display of the current key. Other features of the HardTune effect include dry voice mixing, octave shift and character modification.\nVocoder\nThe vocoder in VoiceTone Synth is called 'Massive-Band' for a reason. It effectively scales resolution from ultra-clearly-enunciated Robot voices to the sound of the classic, analog low-band-count vocoders we all know and love. The benefit is that, while typical vocoders require a lot of pre-processing like distortion and EQ to hear the effect properly, with the VoiceTone Synth vocoder effect you can input signals such as clean acoustic guitar and vocode perfectly for sounds that until now have been impossible to achieve.\nVoice-controlled Synth\nThe Vocoder also features a voice-controlled synth mode”considered by many as the Holy Grail for vocoding. Prior to VoiceTone Synth, vocoding required your voice (the exciter), and an instrument input (the carrier) to make cool vocoded sounds. Of course VoiceTone Synth supports the dual input method, but for artists who don't have another instrument or don't play one, VoiceTone Synth can generate a synth part directly from your vocal and vocode that. The result? Generated vocoder parts with one input: your voice.\nVoiceSupport\nVoiceSupport is a Windows/Mac application that via USB connects your VoiceTone Synth with our support network. What can you expect?\n¢Access to software updates\n¢New preset downloads\n¢Support feed shows latest tips & tricks on using product\n¢Simple back-up and restoring of preset/setup data\n¢Product registration\nFEATURES\nHardTune processor with option for octave shift and gender processing\nVocoder effect with options for an external carrier input or various outboard synthesizer flavors\nTransducer effects create megaphones and distortion in series with HardCore and Vocoder\nTone Processing with adaptive compression, Shape EQ and de-ess\nClean, studio quality mic preamp with phantom power.\n10 user-editable presets with footswitch selection\nXLR mono output with separate dry only output\nExplore exciting new sonic possibilities. Order yours today.\nSPECIFICATIONS\nVoiceTone Synth HardTune & Vocoder Pedal\nInputs\nMic Connector: Balanced XLR, input impedance 1kOhm\nMic Input Sensitivity @ 0dBFS: -44dBu to +2dBu\nMic Input Sensitivity @ 12dB: headroom -56dBu to -10dBu\nInstrument Input Connector: Unbalanced 1/4\", input imp. 1MOhm\nInstrument In Sensitivity: +15dBu @ 0dBFS\nEIN: -126dBu @ max mic amp gain, Rg = 150 Ohm\nPower Input: 12 VDC 300 mA, tip negative\nOutputs\nMain Output Connectors: Balanced XLR\nOutput Impedance: 40 Ohm\nOutput Level: +2 dBu @ 0dBFS\nInstrument Thru Connector: Unbalanced 1/4\" phone jack\nInstrument Thru output impedance: 270 Ohm\nDynamic Range, Mic. @ Min gain >108dB: 20 Hz - 20kHz A-weighted\nDynamic Range, Mic. @ -18dBu sensitivity > 104dB: 20hz - 20kHz\nTHD+ Noise, Mic. @ Min gain: 119dB\nTuning Mute Attenuation: >100dB\nConversion Characteristics\nSample Rate: 48 kHz\nConverter: AKM AK4620B\nAD / DA Conversion: 24 bit, 128x oversampling bitstream\nEMC & Safety\nComplies with: EN 55103-1 and EN 55103-2 FCC part 15, Class B, CISPR 22, Class B\nCertified to: IEC 65, EN 60065, UL6500 and CSA E60065 CSA FILE #LR108093\nOperating Temperature: 32 F to 122 F (0 C to 50 C)\nStorage Temperature: -22 F to 167 F (-30 C to 70 C)\nHumidity Maximum: 90 % non-condensing\nSupplementary\nUSB: (for connection to VoiceSupport application)\nDimensions: 130mm x 132mm x 41mm (5\" x 5.25\" x 1.5\")\nWeight: 1.5 lb. (0.72 kg)\nWarranty Parts and labor: 1 year\nhttp://www.tc-helicon.com/en/products/voicetone-synth/",
    "hrid": "tc-electronic-helicon-voicetone-synth"
}