{
    "py/object": "mylib.pedal.Pedal",
    "id": "11970",
    "name": "Ditto Stereo Looper",
    "image": "images/tc-electronic-ditto-stereo-looper.jpg",
    "function": [
        "Dual/Stereo",
        "Looper"
    ],
    "manufacturer": "TC Electronic",
    "current": "? mA / 9 V / DC / Negative Center",
    "cost": "$130 Price in €",
    "width": 72,
    "height": 122,
    "details": "Looper with Stereo I/O and Backing TrackA Wider Loop Perspective\nThe most intuitive and amazing looper known to musickind is back. Packing a wealth of cool creative features that'll see you jam along with the cream of the crop in music today via the innovative StarJam feature, while creating multi-layered masterpieces in seconds flat. But first and foremost Ditto Stereo Looper is here to give all you loop lovers what you've been craving the most - dirt simple looping in stereo!\nSuper intuitive - Made by guitarists for guitarists\nStereo I/O\nLoop Import/Export and Backing Tracks\nDitto Through and Through\nIf it ain't broke, don't fix it and why should you when you have made something musicians truly love? That's why even though we've added some new features, we've preserved everything that's good about Ditto Looper: the ultra-simple design, the 5 minutes of looping time and unlimited overdubs all packed in a highly pedalboard-friendly enclosure. So if you liked Ditto Looper, you'll love Ditto Stereo Looper.\nYou - In Stereo\nThere's nothing like that super-wide sonic perspective you get from a stereo rig, it just rules! So why should stereo devotees not have a high-quality compact looper just like the mono-riggers? That's why Ditto Stereo Looper offers first-rate stereo I/O options alongside True-Bypass, Analog-Dry-Through, the option of running on a 9v battery and 24-Bit uncompressed audio for maximum you. So loop that E-chord and be blown away over and over and over again.\nRock With The Best\nIn order to progress as a musician you need someone that constantly pushes you and your creativity to its very limits and beyond, and who's better suited to do exactly that than the world's greatest musicians! Enter StarJam, a cool and innovative concept that lets you load pre-recorded loops made by the likes of John Petrucci, Steve Morse, Guthrie Govan and Paul Gilbert into Ditto Stereo Looper, supplying you with hours of inspiration so you can progress to the next level. We won't promise fame, glory and hot tubs, but we will promise an instant boost in creativity and fun!\nhttp://www.tcelectronic.com/ditto-stereo-looper/",
    "hrid": "tc-electronic-ditto-stereo-looper"
}