{
    "py/object": "mylib.pedal.Pedal",
    "id": "16620",
    "name": "Skysurfer Reverb",
    "image": "images/tc-electronic-skysurfer-reverb.jpg",
    "function": [
        "Reverb"
    ],
    "manufacturer": "TC Electronic",
    "current": "? mA / 9 V / DC / Negative Center",
    "cost": "$60 Price in €",
    "width": 73,
    "height": 132,
    "details": "Studio Quality Reverb with Award-Winning TC ELECTRONIC AlgorithmsSkysurfer Reverb is the one-stop solution to all of your basic reverb needs. Whether you want to dive into deep splashy oceans or ride the ambient airwaves above, Skysurfer lets you do it via its three high-quality reverb algorithms, all housed in a sturdy and compact pedal that won’t break the bank.\nNo Compromise On Quality\nA lot of budget-friendly reverb pedals simply destroy your core tone when the effect is on. Skysurfer doesn’t! Built on a superb studio-quality algorithm, Skysurfer will give you all the lush and transparent reverb sounds you could ever want, without ever compromising your original tone. Finally a reverb pedal that’ll do good things for your wallet and your tone.\nColors In Space\nSkysurfer sports three versatile reverb algorithms that’ll add just the perfect amount of color and space around your notes. Spring gives you all the drippy, splashy goodness of an old spring reverb tank, great for a full-on Dick Dale surf attack. Whereas Room and Hall will let you take your tone from earthy and organic to interstellar spaceflight.\nReverb Real Estate\nWe’re musicians just like you, and we know that it can be an uphill battle to fit all the pedals you want on a pedalboard with limited space. Pro tip: a solid game of Tetris every day will make you a pedalboard planning champ. But to make the game a little easier on you, we decided to put top-mounted I/Os in Skysurfer, so cables won’t rob you of any space where it matters the most.\nBackstage Pass – All Access\nA sweet trifecta of reverberating tones available in one easy to use pedal. Let’s have a look at the ins and outs of Skysurfer Reverb\nDecay For Days\nThis determines how long the reverb lasts. Set it low for a quick and sweet splash or max it and hang on to the reverberating moment almost forever.\nMaster The Mix\nThis controls how loud the reverb is. Set it low for some subtle ambience or crank it for a more obvious and explosive reverb tone.\nTake Me To Tone\nThis controls the amount of high frequencies in the reverberated signal. Go counter-clockwise for a dark and dampened reverb tone, or go fully clockwise for a more intense and bright sound.\nRelish In Reverb\nChoose between three high-quality reverb algorithms. Spring, Room or Hall.\nTrue To You\nNobody messes with your tone but you. It’s that simple! Hence, Skysurfer sports True Bypass, so when it’s off, it’s really off and has zero impact on your core tone.\nhttps://www.guitarcenter.com/TC-Electronic/Skysurfer-Reverb-Effect-Pedal.gc",
    "hrid": "tc-electronic-skysurfer-reverb"
}