{
    "py/object": "mylib.pedal.Pedal",
    "id": "12706",
    "name": "DM-02 Dynamorph",
    "image": "images/twa-dm-02-dynamorph.jpg",
    "function": [
        "Distortion",
        "Filter",
        "Synth Voice"
    ],
    "manufacturer": "TWA",
    "current": "? mA / ? V / AC/DC",
    "cost": "$299 Price in €",
    "width": 94,
    "height": 102,
    "details": "Distortion? Fuzz? Filter? Synth? Dynamorph™ is all of these, and much more.Featuring a distortion circuit where the amount and type of saturation is intricately and inextricably linked to the input signal level, Dynamorph™ creates multi-layered, highly complex waveforms that twist and morph your instrument’s harmonic structure in bizarre yet decidedly musical ways.\nAdd to this an envelope-detection circuit that allows control of distortion events via playing dynamics, and you have the extremely powerful tool for musical expression that is Dynamorph™.\nDepending on control settings and playing technique, Dynamorph™ can create an almost unlimited variety of filthy, flittering filter effects that will add depth and dimension to your notes. Tight chirps, greasy gurgles, & long, yawning sweeps are all available by simply varying your picking attack.\nA light touch with low Drive settings can yield sagging, fuzzy burps that reside somewhere between a “starved voltage” fuzz and a dirty Moog filter set to tight decay.\nIncreased Drive settings create higher order harmonics that subsequently drop in pitch as the note decays (think swept resonant filter). Playing double stops and chords will generate bizarre intermodulation effects that border on ring modulation but with less dissonance.\ntwa dynamorph effect pedal\nTurning up the Gain makes the Drive hit harder (a lot harder), resulting in extreme compression and more complex, thick harmonics with massive sustain.\nDigging in hard with higher Drive & Gain settings will bury your notes under a torrent of waveforms battling for evolutional supremacy – the victor finally blossoming into a screaming, searing siren-song.\nTurning on the Morph function opens up an entirely new range of control over these effects, as the amount of Drive can now be controlled via playing dynamics as well.  Notes will swell from zero volume into sustained harmonic glory, their tonal characteristics reacting and morphing in real time to the level changes preset by the Instar & Gestation controls.\nAll of these tonal transformations can be further adjusted via the Mode switch that selects between two different overall EQ settings for the pedal. If things need to be reigned in a bit, just blend in some dry signal using the Ametaboly/Holometaboly control.\nFor even further control options, the Morph function can also be controlled manually via an external expression pedal, allowing notes to be swelled in and out at will to create massive, sizzling synth pads.\nIf you’ve grown bored with the status quo of disappointing drives and flatulent fuzzes, then plug into the DM-02 Dynamorph™ and witness your tone transform from an inchworm into a 600-Lb. mutant metallic Butterfly – with teeth.\nTECH TALK -\nAt the heart of the DM-02 Dynamorph™ circuit is a string of full-wave rectifiers.  In front of this diode array sit two high-gain preamps set in series – the output levels of these pre’s are controlled by the Drive and Gain controls accordingly.\nAs the diodes are hit with increasing signal level from the preamps, they bias either positive or negative, or not at all. The resultant waveform is a combination of many, including sine, triangle, square, and interactions of all of these. The more level that the diodes are hit with, the more non-linear and wackier (technical term) things will get.\nThis primordial harmonic soup is then passed along to an op-amp that sums it all. However, since these distortion events are non-linear in nature, there is also subtraction, which yields further tonal filtering and changes to the waveform output.\nThe Morph circuit is a high-gain VCA to activate the Drive; a smooth gate that makes the harmonics sweep versus level, tracking the incoming signal from the instrument. The more drive, the more the apparent EQ of the distortion changes, again, giving notes a varying degree of harmonic “movement.”\nDM-02 Dynamorph™ features TWA’s® proprietary S3™ “Shortest Send Switching™” - a form of relay-based True Bypass switching that provides the most transparent bypass sound available. S3™ switching also automatically reverts the pedal to bypass mode if power is lost – an essential failsafe for live gigs.\nCONTROL DESCRIPTIONS –\nECDYSIS (Drive) – Controls the amount of signal level going into the circuit’s diode array. More drive yields more apparent change to the distortion’s EQ components; effectively “morphing” the tone.  Turn clockwise for more drive/distortion/filtering/morphing effect.\nOUTPUT – Controls overall output level of the pedal.  Turn clockwise for more output level (volume).\nINSTAR (Threshold) – When Morph is set to ON, this control sets the trigger point at which the drive level will increase from zero to wherever it is set on the Drive control.  Start with the control full CCW and adjust until you find the “sweet spot” where the pedal reacts best to your playing dynamics.\nCHRYSALIS (Gain) – Controls the output level of a high-gain preamp that sits before the rectifier array in the circuit.  Gain makes the Drive control hit the rectifiers harder - a lot harder. When this occurs, more complex, thick harmonics with compression and increased sustain are some of the results. Turn Gain clockwise for more gain/distortion/filtering/morphing effect.\nAMETABOLY/HOLOMETABOLY (Dry/Effect) – Blends between clean signal (Ametaboly) and morphed signal (Holometaboly). Turn CCW for more Dry, turn CW for more Effect.\nGESTATION (Rate) – When Morph is ON, this control determines how quickly the drive will swell from zero to full. Turn CW for faster gestation period (rate).\nMODE (OVID/KAFKA) – This switch selects between two different overall EQ curves for the effect. Ovid is fuller-sounding, while Kafka has more emphasis in the high frequency range.\nMORPH (ON/OFF) – Turns the envelope-detector function of the pedal ON/OFF.\nEXP – Connect an external Expression pedal (Roland EV-5 recommended) to control the amount of drive that will hit the circuit’s diode array. NOTE: Instar control should be set to zero (fully CCW).\nhttp://www.godlyke.com/totally-wycked-audio-effects-pedals/hand-built/dynamorph",
    "hrid": "twa-dm-02-dynamorph"
}