{
    "py/object": "mylib.pedal.Pedal",
    "id": "12165",
    "name": "Sparkle Drive",
    "image": "images/voodoo-lab-sparkle-drive.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Voodoo Lab",
    "current": "? mA / ? V / AC/DC",
    "cost": "$130 Price in €",
    "width": 93,
    "height": 119,
    "details": "vintage tubescreamer 808 typeMultiple, layered amp sounds - one clean, one overdriven \n Overdrive circuit delivers vintage 808 sounds\n 100% clean boost circuit with tons of output\n True bypass switching with LED\n Hand built in the U.S.A.\nVoodoo Lab Guitar Effect Pedals are handcrafted from the finest modern and vintage components. They are housed in rugged aluminum cases with heavy duty metal switches. True bypass switching is used for absolutely no loss of tone when the pedal is bypassed. These are the finest effect pedals a musician can buy. All Voodoo Lab products are manufactured in the U.S.A. by Digital Music Corporation. For more information about Voodoo Lab, please visit our web site at www.voodoolab.com.\nDescription\nThe Voodoo Lab Sparkle Drive is an overdrive pedal featuring a unique “clean” control. It’s overdrive circuit provides the same tone as a vintage ‘808. We included the original JRC4558 opamp for authenticity, but upgraded other components such as using high precision metal resistors and modern polyester film type capacitors. You’ll hear these higher grade parts in a tighter midrange, crisper highs and overall better note definition.\nThe clean control blends back in a boosted direct signal. This restores the attack and feel which is lost in a highly compressed overdrive circuit. The clean boost and blending circuit use a studio grade opamp for crisp and super transparent sound without added noise.\nThe Sparkle Drive utilizes the same concept as layering two amps, one clean and the other saturated. Of course with the clean control turned down, you get a classic overdrive tone. All the way up it provides 100% clean boost.\nOperation\nGain: This sets the gain level for the overdrive sound only. It has no effect on the “clean” signal. Use low settings to warm up and compress your tone. Turn it up for additional sustain and saturation.\nTone: Turn it up for a brighter sound, down for darker. It is for the overdrive only and has no effect on the “clean” signal.\nClean: This blends the boosted clean signal with the overdrive. All the way down is overdrive only. All the way up is clean only. In between is a blend of both the clean and overdrive.\nVolume: This sets the output level. Set as desired! Plenty of juice is available to overdrive your tube amp.\nPlugging into the input jack turns on the power to your SparkleDrive. To preserve battery life, always disconnect the input cable when not in use.\nBattery\nThe Voodoo Lab SparkleDrive is powered by a single 9V battery. To replace the battery, remove the four screws which secure the bottom cover.\n(over)\nExternal Power\nThe Voodoo Lab SparkleDrive can be powered externally with a regulated 9VDC power supply eliminating the need for the internal battery. The external power supply connector is a 5.5x2.1mm barrel with center negative. The Voodoo Lab Pedal Power will power up to eight pedals without any added hum or noise.\nhttp://www.voodoolab.com/sparkledrive.htm",
    "hrid": "voodoo-lab-sparkle-drive"
}