{
    "py/object": "mylib.pedal.Pedal",
    "id": "17734",
    "name": "MV-50 AC",
    "image": "images/vox-mv-50-ac.jpg",
    "function": [
        "Modeling/Simulation",
        "Tube",
        "Utility"
    ],
    "manufacturer": "Vox",
    "current": "? mA / ? V / AC/DC",
    "cost": "",
    "width": 135,
    "height": 100,
    "details": "Heavyweight AC Tone in the Palm of Your Hand\nThe MV50 AC mini electric guitar amplifier head ushers in a new level of professional-quality tones and convenience for guitarists chasing classic Vox tones. The MV50 AC is voiced to deliver 50 watts of the same chime and harmonically rich grind as your favorite AC30 tones and utilizes a Nutube in the preamp section for true tube performance. But the kicker is that it does it all in a package that weighs just over a pound and fits in the palm of your hand. If you're looking for the tone that has backed artists such as the Beatles, John Scofield, and Queen, the MV50 AC is the mini guitar head of your dreams.\nNOW PLAYING:\nSweetwater Review and Demo\nMV50 Line Introduction\nMV50 Series Features Overview\nQuick Demo\nMV50 Series Demo\nMany Ways to Use the MV50\nVOX: 60 Years of Iconic Tone and Artists\nNow Playing: MV50 - AC LP 412AV\n Previous   Play   Next\n00:00\n00:00\n Min volume\n Max volume\nMV50 - AC LP 412AV VOXamps Listen on SoundCloud\nMV50 - AC P90 V212HWX VOXamps Listen on SoundCloud\nMV50 - AC ST BC112 1 VOXamps Listen on SoundCloud\nMV50 - AC ST BC112 2 VOXamps Listen on SoundCloud\nMV50 - AC ST BC108 VOXamps Listen on SoundCloud\nMV50 - AC ST Line VOXamps Listen on SoundCloud\nTracks provided by SoundCloud\nTrue AC tone\nYou can expect to enjoy the same great British-influenced tones from the MV50 AC mini amp head as Vox's larger and legendary all-tube combo amplifiers. It has been carefully voiced to deliver everything from bell-like clean tone to the all-out rock assault of an AC30 cranked to the max. No matter where you set the simple 3-knob controls, you'll revel in the Brit tones that helped define the sound of rock 'n' roll.\nNutube technology\nIn a world of great-sounding digital options, it's always refreshing to find groundbreaking technology that still adheres to the \"tubes are better\" mentality. Vox knows this as well as any amplifier company and has been integrating real tube tone into their digital and analog amps for years. The MV50 AC 50-watt mini electric guitar amplifier head follows suit with a Nutube located in its preamp section. This delivers the punchy feel and rich overtones you'd expect from anything bearing the Vox logo. These MV50 amplifiers are definitely creating a buzz around Sweetwater.\nConveniently small footprint\nFor an electric guitar amplifier head that pushes 50 watts of power, the Vox MV50 AC is about as small as they come. By utilizing their Nutube technology and a Class D power section, Vox is able to cram enough power and tone into this amp to power any electric guitar speaker cabinet, even at performance volumes. Not gigging lately? The cab-emulated line/headphone output sounds fantastic for practice, at-home playing, and recording. And Vox puts it all into an amp head that comes in at just a touch over a pound.\nVox MV50 AC Mini Electric Guitar Amplifier Head Features:\n50-watt mini guitar amplifier with real tube tone\nUnbelievably small and lightweight\nNutube technology supplies a true tube-amp performance\nClass D power section keeps the weight down while pushing plenty of power\nEasily drives any type of guitar speaker cabinet\nWeighs a little over 1 lb.\nAdditional Media\nGuitar Amp Buying Guide\n13 Amazing Pieces of Gear You May Have Never Heard Of\nVox MV50 Tube Amplifier Heads Review\nTech Specs\nType:   Solid State amp with Korg Nutube\nNumber of Channels: 1\nTotal Power:    50W @ 4 ohms Class D\nPreamp Tubes:   6P1 Nutube\nEQ: Tone control\nInputs: 1 x 1/4\" (instrument)\nOutputs:    1 x 1/4\" (speaker out), 1 x 1/4\" (headphones/line)\nPower Supply:   19V DC power supply (included)\nHeight: 2.9\"\nWidth:  5.3\"\nDepth:  3.9\"\nWeight: 1.32 lbs.\nManufacturer Part Number:   MV50AC\nhttp://www.voxamps.com/MV50AC",
    "hrid": "vox-mv-50-ac"
}