{
    "py/object": "mylib.pedal.Pedal",
    "id": "26102",
    "name": "Arp-87 Stranded Limited Edition",
    "image": "images/walrus-audio-arp-87-stranded-limited-edition.jpg",
    "function": [
        "Delay"
    ],
    "manufacturer": "Walrus Audio",
    "current": "100 mA / 9 V / DC / Negative Center",
    "cost": "$180 Price in €",
    "width": 66,
    "height": 121,
    "details": "Multi-function delayThe ARP-87 is a compact, feature-rich delay, packed with a large pallet of inspirational delay tones. Featuring four main algorithms, digital, analog, lo-fi, and slap back, the ARP-87 can cover some serious ground in the world of echoes. The Digital algorithm boasts pristine, crystal clear repeats great for rhythmic riffs. The Analog setting works well to add warmth and dimension to chords and lines without getting in the way. The Lo-Fi algorithm, with its adjustable frequency range on the repeats, goes from warm, warped, and murky, to strait AM radio. Finally, the Slap setting makes it easy to dial in a great slap back echo perfect for smoking chicken pickin’ runs. With other features like our smart bypass switching, and momentary knob ramp, the ARP-87 provides endless creative opportunities that are waiting to be explored.\nThe X knob changes functions depending on which Algorithm you are using. It adjusts a specific parameter in each algorithm. In Digital, Analog, and Slap modes, the knob will control modulation depth. In Lo-fi mode, the knob will control Filter width.\nNote that when changing delay types this loads a whole new algorithm and the tempo must be tapped in again. Max delay time is 1000ms.\nTrails Mode\nThe ARP-87 can be run in trails or no trails mode. In trails mode, when you turn the pedal off, the delay trails die off naturally. In no trails mode, the delay trails are abruptly cut off when you turn the pedal off. To toggle between either mode, hold down the bypass switch for 1 second while applying power to the pedal. Unplug power and repeat to toggle to the other mode.\nMomentary Functions:\nWhen the switch is in off position, press and hold the Bypass Switch to temporarily activate the effect to add a moment of delay texture. Releasing the switch turns the effect off. When the effect is on, press and hold the bypass switch to momentarily ramp the X parameter to maximum. Releasing the switch sets the X parameter back to the knob location.\nPress and hold the Tap Switch to temporarily ramp the feedback to maximum. Release to set the feedback back to the knob location.\nhttps://www.walrusaudio.com/products/arp-87-multi-function-delay",
    "hrid": "walrus-audio-arp-87-stranded-limited-edition"
}