{
    "py/object": "mylib.pedal.Pedal",
    "id": "31557",
    "name": "MAKO Series R1 Reverb",
    "image": "images/walrus-audio-mako-series-r1-reverb.jpg",
    "function": [
        "Reverb",
        "Dual/Stereo"
    ],
    "manufacturer": "Walrus Audio",
    "current": "300 mA / 9 V / DC / Negative Center",
    "cost": "$349 Price in €",
    "width": 64,
    "height": 124,
    "details": "High-Fidelity Stereo ReverbThe R1 is an extremely powerful and versatile multi-function reverb that can quickly go from small intimate room sounds to massive washes of experimental euphoria with six customized, studio-quality programs - Spring, Hall, Plate, BFR, RFRCT (Refract), and Air. Every program can be tuned and tweaked and then saved to one of nine on-board presets. The R1 boasts a volume swell effect that can be applied to any program, sustain and latching momentary features, stereo in and out, MIDI control, and up to nine on-board presets (128 via MIDI). Players of all styles and genres will be able to find eternal inspiration with the R1.\nPrograms\n Spring - The Spring program emulates an excited spring reverb commonly found in tube amps with loads of transducing drip. Easily go from subtle to full-on surf rock. Experiment with the decay knob to get more than average amounts of reverb not found in traditional amp spring reverb tanks. \nX knob adds a warm grit to the reverb decay.\nHall - The Hall program provides the acoustics of large live sound spaces like concert halls to arenas. Longer decays and higher X knob settings result in a massive wash of ambiance. Shorter decay and lower X settings allow for a more intimate reverb expression.\nX knob controls the room's size; smaller at lower settings to larger room sizes as you increase X.\nPlate – The Plate program emulates a smooth analog plate reverb with nice even diffusion inspired by famous plates like the EMT 140.\nX knob adds in gentle warm grit to the front end of the program simulating driving a hot signal into the plate.\nBFR - BFR is a no holds barred, big, f____, reverb. This is more than a giant arena reverb. It's a hall-esque reverb with rich and lush decay in a vast cavern filled with choirs of angels.\nX knob controls the amount of diffusion applied to the multi-tap delays used to form the program. At lower X settings, you'll hear these delays bouncing around for a more textured sound. As you increase the X knob, the delays are diffused, creating a smooth texture, and lifting your riffs and chords into the atmosphere. See ya.\nRFRCT (Refract) - The RFRCT program allows for lovely, charming, and glitch-like textures hovering over a largely diffused reverb. The Rate controls on RFRCT change how often the glitch effects occur while Depth controls the overall volume of the glitch effect.\nX knob is used to shape the tone of the glitch effect. At zero, the glitch effect will have a lo-fi, almost tape-like sound to them. Increasing the X knob brightens these elements with more pristine details.\nAir - The Air program offers a larger diffused reverb with a subtle shimmer but has a more “crisp” clarity to its decay. Explore slow-building sounds that don’t get in the way of your playing. Air complements keys and synths as well.\nX knob controls the amount of the wind and shimmer elements in the Air program. At zero the effect will be off. Turning clockwise will increase the volume of the air effect.\nhttps://www.walrusaudio.com/products/mako-series-r1-high-fidelity-stereo-reverb?variant=37765773426887",
    "hrid": "walrus-audio-mako-series-r1-reverb"
}