{
    "py/object": "mylib.pedal.Pedal",
    "id": "30151",
    "name": "Slö Teal",
    "image": "images/walrus-audio-slö-teal.jpg",
    "function": [
        "Reverb"
    ],
    "manufacturer": "Walrus Audio",
    "current": "100 mA / 9 V / DC / Negative Center",
    "cost": "$199 Price in €",
    "width": 66,
    "height": 35,
    "details": "Multi Texture ReverbThe Slö Multi Texture Reverb allows players to create lush, modulated, sleepy and ambient soundscapes. Stocked with three different algorithms specifically designed to invoke textures for bringing dreams from your subconscious to reality.\nThe toggle switch allows three different reverb modes, Dark (Lower Octave), Rise (Ambient Swell) and Dream (Latching Pad), while secondary functions on the switch change between different wave shapes for the modulation on the reverb trail.\nCombine deep modulation with long washy trails and experience, the Slö.\nALGORITHMS:\nDARK – Add a lower octave to your reverb trail. Here you'll create deep and wide atmospheric sounds and channel nightmarish soundscapes. X knob sets the level of a -1 octave signal that feeds the reverb.\nRISE – This is an auto-swell reverb for beautiful cinematic swells. Don't rush it. Let it breathe and gently wake up. X knob sets the amount of time it takes the reverb to swell in after a note is played. Set lower for shorter rise times and higher for longer rise times.\nDREAM – Here is a lush reverb with a latching pad function. Press the sustain switch to latch signal. Experiment with the X knob to add vibrato over the pad. Press sustain again and pad will decrescendo according to where decay knob is set. X knob sets the depth of vibrato applied to the reverb trail.\nThe Slö also features 3 different wave shapes accessible by holding down bypass while switching the algorithm toggle.\nSINE – Smooth and even pitch up and down modulation.\nWARP – Asymmetric pitch up modulation similar to a warped record.\nSINK – Asymmetric pitch down modulation for sinking detune similar to a Bigsby.\nMOMENTARY FUNCTIONS:\nBypass: When the switch is in off position, press and hold to temporarily activate the effect to add a moment of reverb texture. Releasing the switch turns the effect off, and fades it out. \nSustain: When pressed, the decay switch ramps up the reverb trail to maximum creating long dreamy reverb trail and then ramps back down to the decay knob setting when released. In the “Dream” algorithm, the sustain switch is latching. Press it once to capture and sustain the current reverb decay for extremely long pad-like sounds. Press it again to let the reverb trail taper off, based on the position of the decay knob.\nTRAILS MODE:\nThe Slö can run in trails or no trails mode. In trails mode, when you turn the pedal off, the reverb decay dies off naturally. In no trails mode, the decay is abruptly cut off when you turn the pedal off. To toggle between either mode, hold down the bypass switch for 1 second while applying power to the pedal. Unplug power and repeat to toggle to the other mode.\nhttps://www.walrusaudio.com/collections/all-effect-pedals/products/slo-multi-texture-reverb?variant=15958645014574",
    "hrid": "walrus-audio-slö-teal"
}