{
    "py/object": "mylib.pedal.Pedal",
    "id": "15487",
    "name": "Plexi-Drive",
    "image": "images/wampler-plexi-drive.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Wampler",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 64,
    "height": 114,
    "details": "British OverdriveSince the early 60’s, Marshall Amplifiers® have lead the way in rock tones with its legendary tight overdrive and coveted bass response. Early rock legends such as: Jimi Hendrix, Led Zeppelin, Cream, and AC/DC helped lead the way in creating some of the most iconic rock tones ever produced and catapulted Marshall Amplifiers® into the icon of rock tone.\nWith these huge influential musicians and tones in mind, we sat down and designed a pedal that could help tone chasers produce the same guitar tones as those rock heroes.\nThe Plexi-Drive’s unique gain structure is capable of running the tonal rock gamut. From bluesy style 18-watt Marshall tones to the all out massive rock tones of a JTM-45® cranked to ten (preferably 11), the Plexi-Drive can handle it all with ease. Along with the volume, gain and perfectly placed tone control, the additional bass boost option allows the player to emulate the feeling of the low-end thump of having a 4×12” cabinet (or two) at the flick of a switch. This becomes really useful when playing at lower volumes.\nTo this day, the Plexi-Drive is still one of our favorite pedals and is never far from Brian’s personal pedalboard. For a man who is said to be never satisfied with his tone, the Plexi-Drive has stayed with him throughout and is still inspiring him year after year.\nYour search for the perfect simple M.I.A.B. (Marshall® in a Box) can finally be over. The Plexi-Drive will give you the crunch, response, and feeling that your rig begs for. Whether you are playing sold out shows or rocking out by yourself – the Plexi-Drive will inspire you to create your own flavor of rock!\n\nSee more at: https://www.wamplerpedals.com/plexi-drive#sthash.nRZUBia5.dpuf\n\nhttps://www.wamplerpedals.com/plexi-drive#sthash.nRZUBia5.dpuf",
    "hrid": "wampler-plexi-drive"
}