{
    "py/object": "mylib.pedal.Pedal",
    "id": "15632",
    "name": "Plexi Drive Deluxe",
    "image": "images/wampler-plexi-drive-deluxe.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Wampler",
    "current": "Pedal is passive",
    "cost": "$279 Price in €",
    "width": 89,
    "height": 114,
    "details": "Based on the classic Wampler Pedal “Plexi-Drive”, the Plexi-Drive Deluxe builds on the foundation of the original and gives you considerably more control to shape your tone. With a 3 band active EQ and additional brightness control, the Plexi-Drive Deluxe takes a huge step forward into the modern era of pedals.  Complete with the perfectly voiced pregain booster, you can achieve almost any Plexi tone from virtually any amp.\nSince the early 60’s, Marshall Amplifiers® have lead the way in rock tones with its legendary tight overdrive and coveted bass response. Early rock legends such as: Jimi Hendrix, Led Zeppelin, Cream, and AC/DC helped lead the way in creating some of the most iconic rock tones ever produced and catapulted Marshall® into rock legendary status.\nThe Plexi-Drive Deluxe is a direct descendent of the Plexi-Drive Standard but with a few upgraded features. Like the original, the Plexi-Drive Deluxe’s unique gain structure can cover everything from Vintage ’68 style Plexi tones to the all out massive rock tones of a JTM-45® cranked to ten, or even eleven.\nWith the addition of an all-new active 3 band Bass/Mids/Treble EQ stack – you can now have even more tonal control. With the bass boost option, you can emulate the feeling of the low-end thump of a 4×12” cabinet (or two) at the flick of a switch and can allow you to dial in your low end at lower volume gigs or at bedroom volume levels. To compliment this, we also added a bright switch to add high end sparkle – which makes changing from bright to dark guitars (and amps) a breeze. The Plexi-Drive Deluxe also features a one knob, pre-gain boost soft click switch that is voiced like “that ‘valve’ screaming green overdrive with pronounced mids” – to help push your leads into thick creamy overdrive.\nThe Plexi-Drive Deluxe will fill your Marshall® void and give you the crunch, response, boost and feeling that your rig begs for. Whether you are playing sold out shows or rocking out by yourself – the Plexi-Drive Deluxe will take your tone and allow you to create your own flavor of rock!\nYour search for the perfect versatile M.I.A.B. (Marshall® in a Box) can finally be over.\n\nSee more at: https://www.wamplerpedals.com/plexi-drive-deluxe#sthash.cWcNBERH.dpuf\n\nhttps://www.wamplerpedals.com/plexi-drive-deluxe",
    "hrid": "wampler-plexi-drive-deluxe"
}