{
    "py/object": "mylib.pedal.Pedal",
    "id": "14710",
    "name": "Faux Tape Echo v2",
    "image": "images/wampler-faux-tape-echo-v2.jpg",
    "function": [
        "Delay"
    ],
    "manufacturer": "Wampler",
    "current": "? mA / ? V / AC/DC",
    "cost": "$210 Price in €",
    "width": 89,
    "height": 114,
    "details": "Now in it’s second incarnation, the Faux Tape Echo v2 brings you everything you want from a standard delay pedal in the ultimate gig friendly package.Now in it’s second incarnation, the Faux Tape Echo v2 brings you everything you want from a standard delay pedal in the ultimate gig friendly package.\nBased on the hugely popular best seller of the previous models, the v2 offers the same purity of signal path, the same depth of tone on the repeats and most importantly, the addition of sub divisions on the tap tempo. With this, you can now have your delays come at ¼, 1/8, dotted 1/8 and triplet based on your tap tempo.\nWith our hybrid design (completely pure analog dry path with the digital delay layered on top) approach, you get the best of both worlds. You get the note clarity, much lower noise, and longer delay times from digital delays...  You also get the lovely warmth and little exquisite touches that are usually reserved for analog delays. Nearly every part of the pedal, all of its major functions, are analog. The “delay line” is the only digital part of the signal path. It alone being digital brings clarity and focus to the task in a way that analog delay line chips can’t really match.\nBut everything else, all the absolutely vital filtering to carefully finish the sound is pure analog. Every aspect of the modulation that gives the Faux Tape Echo pedal a unique function and tone and makes it desirable for people who want their delay tone to sound as good as tape delay units but without all the maintenance, supplies, and hassle. Your all-important fundamental dry tone is 100% analog, too.\nSo when we say it’s the best of both worlds, we absolutely mean it. From country slap-back to ambient washes to straight-ahead rock and metal delay, the hybrid approach lets Brian make one pedal that can do it all.\nThe Faux Tape Echo takes everything great about the original, and adds to it that much-requested tap tempo with sub-division functionality that users have been asking for, as well as our well known emulation of the elusive and beautiful character that people look for in classic tape echo units.\n* Built in the U.S.A. \n* High grade components picked for their superior sound and response  \n* Relay true bypass with soft switches   \n* Battery connection and 9v power jack (barrel plug like Boss)   \n  Please note: Battery not provided. Mains power recommended. \n* Power draw: 40mA \n* Sub divisions available on Tap Tempo. Quarter, eigth, dotted eight and Triplets.  \n* About 800ms of delay time available (very slight echo deterioration is apparent after about 600m/s)   \n* Size: 3.5” x 4.5” x 1.5″ (88.9mm x 114.3mm x 38.1mm) – height excludes knobs and switches\nhttps://www.wamplerpedals.com/faux-tape-echo-v2",
    "hrid": "wampler-faux-tape-echo-v2"
}