{
    "py/object": "mylib.pedal.Pedal",
    "id": "14562",
    "name": "Tumnus Deluxe",
    "image": "images/wampler-tumnus-deluxe.jpg",
    "function": [
        "PreAmp",
        "Distortion",
        "Equalizer"
    ],
    "manufacturer": "Wampler",
    "current": "? mA / ? V / AC/DC",
    "cost": "$200 Price in €",
    "width": 64,
    "height": 114,
    "details": "Mythical Overdrive Sound with EQ ControlsWith the first iteration of the Tumnus, Wampler perfected their take on the sound of THE mythical overdrive. \nWith the release of the Tumnus Deluxe, Brian has set the new standard. Thanks in large part to the design’s articulate-sounding buffer, all of the clarity, punch, and detailed breakup of the original Tumnus are still there. But if you prefer the sound of true bypass performance, just hit the switch on the side of the pedal for uncolored tonal purity. Brian also injected the Tumnus Deluxe with a level of tonal flexibility not previously available on this style of drive. Active bass and mid controls, as well as a treble control, the same as the pedal it was inspired by, encourages you to sculpt the tone from this pedal to the demands of your rig. Whether you’re boosting a driven amp or another pedal, using the pedal as a stand-alone overdrive, or crowning it your “always on” tonal sweetener, you’ll find the Tumnus Deluxe’s wide-ranging controls make it much more than just another clone.\nLegendary tone and more\nThe Tumnus Deluxe delivers all the string-to-string clarity, high-headroom output, and amp-like breakup that made this style of overdrive pedal so iconic. But its 3-band EQ will enhance your tone with warm low end, instantly identifiable midrange, and just the right amount of top-end sparkle. Unlike some other similarly voiced pedals, the Tumnus Deluxe has enough tonal control to perfect your sound through any rig.     \nActive bass and mid controls boost or cut the desired frequencies\nA classic treble control like the original perfects the pedal’s higher frequencies\nSounds great as a stand-alone overdrive or a shapeable boost\nNormal / Hot switch goes from standard Tumnus gain to higher gain                       \nBuffered or true bypass, it’s your choice\nThe buffer inside the Tumnus Deluxe sounds so good, you might just find it enhances your tone whether the pedal is on or off. But Wampler knows that some players prefer the clean signal path of true bypass operation. With the Tumnus Deluxe’s side-mounted buffered / true bypass control, attaining that uncolored sound is as easy as flipping a switch.          \nSame magic-sounding buffer that we’ve all come to love\nEasily accessible true bypass performance for uncolored tonal purity\nConvenient side-mounted switch selects between the 2 modes\nWampler - Quality Construction \nBrian Wampler’s attention to detail and commitment to designing the best and most player-friendly products out there are second to none. Those qualities are on full display within the Tumnus Deluxe. From its convenient top-mounted jacks to its amazingly flexible tone shaping, the Tumnus Deluxe pedal is every bit a Wampler.\n\nSee more at: http://www.wamplerpedals.com/products/the-tumnus-deluxe#sthash.N85ueSxu.dpuf\n\nhttp://www.wamplerpedals.com/products/the-tumnus-deluxe",
    "hrid": "wampler-tumnus-deluxe"
}