{
    "py/object": "mylib.pedal.Pedal",
    "id": "14063",
    "name": "The Doctor",
    "image": "images/wampler-the-doctor.jpg",
    "function": [
        "Delay"
    ],
    "manufacturer": "Wampler",
    "current": "? mA / ? V / AC/DC",
    "cost": "$240 Price in €",
    "width": 89,
    "height": 114,
    "details": "Lo-Fi Delay PedalThe Doctor will see you now.\nBorn from a collaboration between Brian Wampler and superstar, tele-master Brad Paisley, The Doctor Lo-Fi Delay pedal exudes a gritty character that works as well for laying down an ambient sonic bed as it does for old-school slapback. Give the pedal’s Rate and Depth knobs a spin, and the self-oscillating repeats easily become an aural wash that, while not interfering with the notes you’re playing, is still far from subtle. And the pedal’s straightforward control layout - such as onboard tap tempo control with four easily selectable rhythmic subdivisions - makes use of The Doctor Lo-Fi Delay a triumph over many of the menu-based delay engines of today. Brian Wampler and Brad Paisley know guitar tone. Take a tip from them and add the lo-fi delay goodness of The Doctor to your pedalboard. We think you’ll find it’s right in your Wheelhouse.\nThere are few tones more addictive to guitarists than the runaway repeats of a self-oscillating delay. With The Doctor, you can put that glorious chaos underneath your playing as an ambient cloud that is anything but pristine. We think you’ll find that Brian Wampler has succeeded in expertly balancing the line of tonal radiance and grainy disintegration like precious few delay pedal creators before. The Lo-Fi repeats that become a sonic bedrock for your tone, working along with the modulation, and the 100% analog, untouched signal path for your original/through tone.\nPlug it in, step on the footswitch, and be inspired. That’s how easy The Doctor Lo-Fi Delay is to use. Unlike many menu-based digital pedals, Wampler wants you to be able to twist a few knobs and get the exact tone you’re looking for. If reading manuals and scrolling through deep menus makes you sick, we have just The Doctor for you... The Doctor has been carefully engineered to be plug-and-play ready with an intuitive control layout that will be familiar to most players and absolutely no menu diving or confusing computer-based editors.\nThe onboard tap tempo footswitch and Sub Divisions (quarter, eighth, dotted eighth, and triplets) button are effortlessly accurate o giving you on the fly rhythmic control -  making sure the repeats that are every bit the musical instrument as your guitar and amplifier. We have even included an external tap tempo in/out control. This allows you to connect another compatible pedal and have The Doctor control its delay time, or have it control The Doctor – the days of tap tempo tap dancing are numbered!\nSo, as we said above, The Doctor will see you now, and your prescription is ready!\nTechnical\n* Built in the U.S.A\n* High grade components picked for their superior sound and response\n* Relay true bypass with soft switches\n* Top mounted input and output jacks\n* External Tap Tempo Out/In\n* 9v power jack Power draw: 53mA (at 9v) and 63mA (at 18v)\n* Spatial, ambient trails - the more clockwise you move the tone control, the more swirly and ambient the repeats are leading you effortlessly into amazing self-oscillation\n* Maximum 800ms delay\n* Four subdivisions: Quarter, Eight, Dotted 8th and Triplet\n* 3.5″ x 4.50″ x 1.5″ (88.9mm x 114.3mm x 38.1mm) – height excludes knobs and switches\n\nSee more at: https://www.wamplerpedals.com/the-doctor-ambient-delay#sthash.3WoGN3aN.dpuf\n\nhttps://www.wamplerpedals.com/the-doctor-ambient-delay",
    "hrid": "wampler-the-doctor"
}