{
    "py/object": "mylib.pedal.Pedal",
    "id": "17048",
    "name": "Ethereal",
    "image": "images/wampler-ethereal.jpg",
    "function": [
        "Delay",
        "Reverb"
    ],
    "manufacturer": "Wampler",
    "current": "? mA / 9 V / DC / Negative Center",
    "cost": "$199 Price in €",
    "width": 63,
    "height": 114,
    "details": "Ambient Reverb and DelayHow many times have you sat in front of your favorite ambient pedal and felt like you need weeks of training at NASA to use it? Knobs, switches, sliders…It’s often SO hard and frustrating to find a usable tone on those things quickly... Keeping that firmly in mind, when we first considered making an ambient pedal, ease of use was a top priority, right up there with top tier quality tone on par with pedals at twice the price. How do you describe a pedal like the Wampler Ethereal? Does ambient heaven cover it? Is it the gateway between real life and the astral plane? Or is it just gorgeous? It’s hard to know which phrase to use when talking about it, because they all match it perfectly… plus, of course, so easy to use you’ll be getting those perfectly Ethereal tones instantly. \nWhen designing the Ethereal these were the EXACT thoughts running through the mind of Brian Wampler. He wanted to make a delay that is as pure as you could want, with a time of up to 1s, a reverb that is thick and then have the option to mix them all up and put them together in one glorious effect that will send you away… all the way away while making it as easy to use and easy to find those perfect tones as possible. \nOh, and did we tell you – it’s been a bit of a secret, there isn’t one delay lurking within the Ethereal, there are two! The first delay constantly sits there like a heartbeat, coming back at you at quarter notes, we then layer another over the top – that one can be put into a triplet pattern, or a dotted 8th (so you can get that beautiful quarter + dotted 8th mix) and even a self-oscillating dotted eighth pattern that just takes you away and leads you over the edge and down the rabbit hole into perfect ambience… Things can get a little crazy when that one is selected, so you know, knock yourself out – it’s there to make some incredibly strange yet beautiful sounds… See that little switch down there? Yep, that’s the one, just to the right of the stomp - that’s a trails button. When this is used the delay patterns and reverbs sing out after the pedal has been deactivated, so you can even control what you want to come back at you. \nWhile you are enjoying the delay patterns, sitting underneath is that beautifully cavernous plate style reverb that is alive with character and shape, that can be brought in to exactly the right level (whether that be under your guitar, the same level - unity, or even considerably louder) to compliment the delay. \nAs you can imagine, this has been some feat of engineering (definitely worth waiting for) as we wanted all this to happen from a regular sized box, with the purity of tone and response you would expect from a Wampler. So, as with our other time pedals, we split the signal going in, the effected signal is then laid back on top of the original base tone, making sure that YOUR guitar sounds exactly how it does going in. \nThe Wampler Ethereal. Not only can it be used a stand alone reverb or delay pedal, it can be combined for you to worship, to get lost in, to even help you inspect your shoes… but most of all, it was designed to inspire.\nhttps://www.wamplerpedals.com/ethereal-reverb-and-delay",
    "hrid": "wampler-ethereal"
}