{
    "py/object": "mylib.pedal.Pedal",
    "id": "18424",
    "name": "Triple Wreck",
    "image": "images/wampler-triple-wreck.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Wampler",
    "current": "? mA / ? V / AC/DC",
    "cost": "$290 Price in €",
    "width": 89,
    "height": 114,
    "details": "Heavy gain distortion The Triple Wreck high gain distortion pedal... When this pedal was thought of, it was decided that we would take no prisoners, we would produce a pedal with so much gain it would wipe the floor of anything else\nThis pedal is probably one of the tightest, thickest highest gain distortions you have ever heard... Many people have told us that it sounds more like a 5150 amp to them than a distortion pedal, that may very well be - All we know is that Brian designed it to just to be an ass-kicking distortion pedal, heavier than everything else, meaner than everything else, and it is.\nWith a solid three band EQ (total control allowing you to scoop out those mids without it peeking out the lows and highs like so many other pedals) you can emulate some of your favorite high gain tones, but as this pedal is so versatile, you can easily find a distinctive tone all of your own. There is no much control over the tone of your distinctive sound is waiting for you. Believe it or not, even when the gain is backed off, this pedal is still useable, still sounds great.\nThere are two distinct voices in this pedal, Vintage and Modern. The vintage gives you that warmer thump high gain whereas the modern allows a little more sparkle to creep in, giving it that more recent, full audio spectrum feel.\nSo, we've already put in loads of gain, maybe more than you need, so let's stick in a boost switch. What...? Putting a boost switch on an already high gain pedal may sound crazy but you'll be amazed at how well it works. it gives you two options via the Crunch/Cream blend control. With the boost on and it dialled round to crunch, your distortion is multiplied and you have the solo sound you have always wanted. Pinch harmonics are just there, in places you've never found them before. With it dialled round to cream, your pedal turns into a fuzzy monster... Tweak the EQ and you can get a tone that will remind you of the Smashing Pumpkins right round to some Pink Floyd kind of fuzzy solo tone. It's all there, waiting for you.\nThink about your favourite high gain tone, is it a high gain with the mids scooped out or is it roll your hand across the knobs to get that in your face, fuzz, attitude melting distortion. Whatever you are looking for, this is probably the only pedal on the market that can satisfy all of those options. This pedal should come with a public health warning.\nhttps://www.wamplerpedals.com/triple-wreck",
    "hrid": "wampler-triple-wreck"
}