{
    "py/object": "mylib.pedal.Pedal",
    "id": "12494",
    "name": "Acoustic Trauma",
    "image": "images/wmd-acoustic-trauma.jpg",
    "function": [
        "Distortion",
        "Equalizer",
        "Noise Gate"
    ],
    "manufacturer": "WMD",
    "current": "? mA / ? V / AC/DC",
    "cost": "$299 Price in €",
    "width": 114,
    "height": 89,
    "details": "The new WMD Acoustic Trauma is the ultimate analog distortion machine. Two specially voiced preamps give light break up to full stack overdrive to huge sustaining crunch. Those preamps drive a 3 band boosting parametric EQ to voice your tone in any way. Then, a powerful and transparent noise gate kills the noise caused by incredible gain.\nThe Acoustic Trauma can produce the most massive sounds from a pedal. It is capable of causing hearing damage due to the high peaking nature of the EQ bands. This is your solution to cut through the mix, or make your fans writhe in pain.\nThe Controls\nStomp Switch - This footswitch activates the Acoustic Trauma. The large red LED will light and your face will be pummeled.\nCool Preamp - The leftmost preamp is a nice low-medium gain overdrive stage with very smooth clipping. It cleans up well when guitar volume is rolled down.\nHot Preamp - This preamp is designed to just get louder and add sustain. It is not designed to clean up, just to rock. You will find that the more you turn the gain up, it will just crunch a little more but the tone doesn't change. It just adds sustain.\nPreamp Blend - Use this to blend the dry preamp sounds to the output, bypassing the EQ stages. Note that the phase relationships change when analog filters are used, so blending the dry signal may produce out of phase sounds and frequency canceling.\nThe EQ\nThere are 3 bands of EQ with frequency ranges from about 40Hz to 15kHz. Each band is an independent bandpass filter with adjustable center frequency, quality factor, and gain. Use them knobsto sculpt your tone like a surgeon.\nFreq - This selects the center frequency of the filter.\nQ - The Quality Factor (Q) gives you control over the sharpness of the filter. Turn it up and the filter section becomes resonant and more abrasive. Low Q settings sound like a traditional EQ, higher Q adds resonant nodes. The Q ranges from about .1 to around 30.\nGain - This controls how much signal goes to the EQ section. Adjust to taste.\nSumming State/Clip LED\nIf any EQ stage or the summing stage (Triangle with the +) begins to distort, this LED will begin to light up. And you'll hear the distortion. It's not generally a pleasant sound, so we wanted to make it easier to avoid.\nNoise Gate\nThe noise gate is a powerful and transparent way to squelch the noise coming from the intense gain of the Acoustic Trauma.\nGate Threshold - Use this to set the level that the gate will open and the level where it will close. Adjust to taste relative to the level of your guitar.\nNoise Reduction - Controls the level of noise reduced by the gate. All the way up will completely silence noise if the gate is closed.\nWhen not using the gate, you should turn both knobs all the way down, otherwise the gate will act as an expander, boosting the level coming out when the gate opens up.\nWatch the LED for the level of attenuation. The LED will be fully lit when the gate is fully open.\nInternal Controls - The noise gate has two internal controls. The blue trim pot marked \"R\" sets the release time. It is set to what we think is optimal, you may adjust this if you would like. The other trim pot sets the gate bias which removes clicking from the control signal. It is calibrated at the factory. Do yourself a favor and leave it alone.\nhttps://www.wmdevices.com/products/acoustic-trauma",
    "hrid": "wmd-acoustic-trauma"
}