{
    "py/object": "mylib.pedal.Pedal",
    "id": "33529",
    "name": "Hangman 2D",
    "image": "images/wren-and-cuff-hangman-2d.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Wren and Cuff",
    "current": "? mA / 9 V / DC / Negative Center",
    "cost": "$250 Price in €",
    "width": 99,
    "height": 120,
    "details": "Chainsaw distortionThe Boss HM-2 was laid to rest in 1991 when the last of the wannabe Marshall-amp in a box pedals rolled off the line…\nA puzzling pedal to some and downright hated by others, the funeral was not attended by many and met with a sigh of relief by those who loathed it’s buzz-saw brand of high-gain distortion.\nHowever there was a small group of loyal followers that grieved the death of this black and orange beast.\nDespite the drop in sales the pedal experienced causing Boss to cease production, a wide swath of bands gave the HM-2 a permanent residence on their pedal-boards. Swedish Death Metal legends like Entombed and Dismember had long ago made it an essential “always on” part of their setup while the Shoegazing bands from My Bloody Valentine to The Jesus and Mary Chain were using it to help craft their walls of distorted guitar noise chaos. Others saw it showingup under the feet of some of the most noted bands that emerged in the now historic grunge-wave of the nineties.\nEnter the Wren and Cuff Hangman 2D, a detailed recreation of Boss’ “Heavy Metal” pedal.\nWith a circuit more complicated than many digital delays, and the ability for the average person to get an original HM-2 on ebay for pretty cheap, many may wonder why the hell we decided to remake this pedal.\nThe answer? Because I (Matt) wanted to. As with many of our recreations, it became an obsession and difficult task to really nail the tone. As usual, it went way beyond getting a schematic. It became a task requiring ears and hours.\nAlso, a hand-wired, hand-loaded, circuit board using 1/4 watt metal film resistors instead of the 1/8 watt carbon film on the original is a nice thing if you like this pedal. The noise floor becomes dramatically less, and colorful overtones become much more apparent. Add to that the usual Wren and Cuff luxuries of 100% mechanical, true hard-wired bypass, rugged all metal Alpha pots mounted directly to the chassis,  a Modern and Vintage toggle switch, tough metal enclosure and gorgeous art work… And one can see the value of the Hangman 2 over the original.\n(*All of the references below apply to both the original HM-2 and our Hang Man 2D.)\nThis pedal can go from super compressed, tight, smooth distortion, to a snarling buzz-saw monster that brings out every pick-to-string strike you throw at it. Surprisingly though, one trait it does not possess is the extreme scoop to the mids many associate with “Heavy Metal.” One of the secrets to it’s tone is the somewhat strange configuration of it’s “color mix” section.\nThere is the “low” knob which functions as one would expect, and a high knob to help shape the tone. But the “high” knob is kind of an odd-ball in how it effects things. The high-mids are tied together so that the high knob is more of a upper-mids to treble control which can make getting great sounds out of it a bit tricky… but this is also the charm of it. It’s not a pedal all will turn on and immediately fall in love with. It’s a pedal that will make you search for the sweet spot between the pedal’s own crunch and the amp it’s being fed into.\nMany in the death-metal crowd dime everything, pummel the front end of a solid state or tube amp, then EQ the whole amp around the pedal. But most often the pedal’s output is pushed up hard enough to mesh with an amp’s natural distortion and the high knob jacked up enough to introduce the buzz-saw grind.\nIn other words,  it’s tweaked until one finds the sweet spots lurking inside the Hangman.\nDo an HM-2 search on you tube and you’ll see the difference between those who have learned the hidden tricks of the HM-2, and those who still need some schooling. You’ll hear some of the thickest most brutal sounds a pedal can produce, but you’ll also hear some of the worst “bee trapped in a jar” tones that would make anyone cringe.\nThen why recreate a pedal that isn’t instantly awesome to the average user? Because I love it when a seemingly simple pedal makes you get out a shovel and dig for the gold nuggets inside. These are the things no modeler can reproduce. However, the “D” in our HM-2D is there for a reason. It stands for “Deluxe” because of a few tweaks applied to the circuit to make the pedal even more fun.\nThere is a vintage/modern switch that lets you to reconfigure the clipping diodes allowing you bounce between “stock” at one setting, and a less compressed more overdrive-meets-distortion sound as well as a boost to the output level.\nPick up the Hangman 2D if you dare, and learn why it kicks ass and doesn’t take names.\nBottom line…\nThis pedal F***ing Rocks.\nhttps://www.wrenandcuff.com/products/hangman-2d",
    "hrid": "wren-and-cuff-hangman-2d"
}