{
    "py/object": "mylib.pedal.Pedal",
    "id": "17477",
    "name": "Tri Pie '70",
    "image": "images/wren-and-cuff-tri-pie-'70.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Wren and Cuff",
    "current": "? mA / ? V / AC/DC",
    "cost": "$199 Price in €",
    "width": 66,
    "height": 121,
    "details": "The Wren and Cuff Tri Pie 70′ is our version of the famous ***-Muff “triangle knob” fuzz from around 1970. What we’ve done is made what we consider the best sounding tri-knob replication you can find.\nCompared to the modern-day BM, the Tri Pie 70′ has less saturation, a bit less mid-scoop, and more snarl, while at the same time possessing a smoothness that sweetens things in a very musical way. It’s range is more useful, responds well to your guitar’s volume knob, and even gets into the overdrive zone at lower settings.\nHere is one thing that sets the Wren and Cuff Tri-Pie 70’ apart from many of the other B-Muff recreations: Rather than chasing down magical part #’s and sexy looking transistors, we’ve blind-tested a plethora of different types and transistor combos to come up with what we believe to be the sweetest mix of high and lower gain transistors that will yield beautifully rich and complex saturation full of color, bloom and sustain. Contrary to popular belief, vintage “NOS” transistors aren’t that hard to find. Anyone that has a few good suppliers and is willing buy in bulk can get most silicon NOS transistors with a little homework. Problem is, the inconsistencies from muff to muff and gain variances between transistors with the same part numbers makes the search for the “right” transistors a bit pointless.\nWhen someone is chasing after a sweet-sounding year/version of a muff they’ve heard or heard-of, they may not know it, but what they’re really chasing after is one of the really good ones within that version. The ones that randomly got the transistors that had the characteristics needed to produce a pedal that had “that sound”. I don’t (excuse my change from “we” to “I”) want to paint an over-exaggerated picture of the inconsistencies inherent to these pedals. Truth is, there was a much greater amount of consistency from pedal to pedal than germanium transistor based Fuzz Faces for example. But silicon transistors (which all the muffs had) were still “new” at the time and not nearly as consistent as they are now. So the inconsistency factor is definitely a valid point. And I’d bet my booty that most of the big names in music at that time sorted through more than a few pedals before finding the one that they liked.\nSo here’s what we’ve focused on: Finding a great combo of trannies and guaranteeing that each Tri Pie 70’ will be totally consistent and sound the way it should. So what transistors do we use? We prefer to keep that to ourselves, but we will say that it is a combo of common and slightly uncommon transistors with the characteristics that we feel produce a glorious sounding muffer. We hope you’ll agree!\nIf you like the current EH muffs, but have found them to be harsh and brittle at times, or much more “buzzy” than you expected, then the Tri-Pie 70’ may be for you.\nhttps://www.wrenandcuff.com/site/the-stompboxes/the-tri-pie-70",
    "hrid": "wren-and-cuff-tri-pie-'70"
}