{
    "py/object": "mylib.pedal.Pedal",
    "id": "33572",
    "name": "De La Riva BM20-Ultra",
    "image": "images/wren-and-cuff-de-la-riva-bm20-ultra.jpg",
    "function": [
        "Distortion"
    ],
    "manufacturer": "Wren and Cuff",
    "current": "? mA / 9 V / DC / Negative Center",
    "cost": "$300 Price in €",
    "width": 92,
    "height": 113,
    "details": "Ultimate MuffYou’ve probably encountered stompboxes where the designer lets the user make component choices. There might be, for example, a switch that toggles between a vintage part and one likelier to appeal to modern tastes.\nBut few have taken this notion to such surreal extremes as L.A.-based pedal builders Wren and Cuff. In some ways, their De La Riva BM20-Ultra pedal is a traditional Big Muff clone that hews to the original circuit’s topology. But here, most of the circuit decisions are multiple-choice. A set of 20 tiny DIP switches (reminiscent of Andrew Barta’s original SansAmp) offers two possible settings for nearly every stage in the circuit.\nAccording to Wren and Cuff, the 20 DIP switches alone will yield over 1 million unique configurations, and if the three toggles are added to the mix, this give you over 8 million combinations. Minds, commence boggling.\nThe Muff Stuff\nAt its most basic, the De La Riva is a killer Muff clone. Its three knobs replicate the gain/tone/output controls of the Electro-Harmonix original. Without touching any additional controls, you get stellar versions of familiar Muff flavors, delivered with crackling presence and remarkably little noise. High-gain MPSA18 transistors in plastic housings replace the original’s metal-can 2N5133s, but whatever—they sound great.\nOriginal Muffs used only silicon transistors, but here you can switch two of the four transistors (the ones in the main clipping stages) from silicon to germanium. These germanium transistors have no visible part numbers, but they, too, sound terrific. Differences between transistor configurations are less dramatic than, say, changing from Si to Ge in a two-transistor Fuzz Face circuit. The Muff circuit generates so much gain that subtleties can get flattened beneath the steamroller fuzz.\nOn the other hand, the dedicated tone-stack bypass switch is drama for days. It helps to know a bit about the circuit’s topology here: Big Muffs build up tremendous amounts of gain across three transistor stages. Next comes a volume- and tone-sucking passive tone control, followed by a fourth transistor stage to restore the level to its former glory. Nixing the tone stage provides thunderous fuzz without the Muff’s love-it-or-hate-it midrange cut. (That’s the first tone you hear in the demo clip.)\nThe De La Riva offers 380 possible circuit variations—and that’s before you take into account the pedal’s three knobs and two mini-toggle switches.\nSo far, so awesome: a killer Muff clone with a couple of cool variations.\nEnter the Infinite\nThe De La Riva manual capably explains the roles of the 20 DIP switches, and it all makes sense if you have passing knowledge of how the Muff circuit works. The switches determine such factors as how the transistors are biased, the amount of low end filtered between gain stages, and whether the clipping diodes are engaged (and, if so, whether they are Si or Ge diodes, and whether the clipping is symmetrical or asymmetrical). The four leftmost DIP switches shape the character of the tone control, providing many alternatives to that signature mid scoop.\nBut even if you’re an electronics wiz who’s built mountains of Muff derivatives, you probably won’t be able to predict the exact result of every switch change. Experts and ignoramuses alike are likely to employ the same technique: Flick some switches until you hear a cool sound.\nDoes that sound fun? It was for me, and I stumbled across all the tones heard in the demo clip within seconds. Other players will wince at the sight of those 20 switches and their hard-to-read labels. Your gut feeling here is probably the best indicator of whether the De La Riva is for you. Another factor is whether you’d use the pedal only onstage, where fussy edits are impractical, or when sitting in front of studio monitors, thoughtfully concocting the perfect tone to suit a mix in progress.\nThe De La Riva is solidly made inside and out. It’s an unusual-looking circuit board, housing both tiny surface-mount components and traditional through-hole parts, including those four transistors.",
    "hrid": "wren-and-cuff-de-la-riva-bm20-ultra"
}